; ModuleID = 'fio_cli.c'
source_filename = "fio_cli.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.fio_cli_hash_s = type { i64, i64, i64, %struct.fio_cli_hash__ordered_s_*, %struct.fio_cli_hash__map_s_*, i8, i8, i8 }
%struct.fio_cli_hash__ordered_s_ = type { i64, %struct.fio_cli_hash_couplet_s }
%struct.fio_cli_hash_couplet_s = type { %struct.cstr_s, i8* }
%struct.cstr_s = type { i64, i8* }
%struct.fio_cli_hash__map_s_ = type { i64, %struct.fio_cli_hash__ordered_s_* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.fio_cli_parser_data_s = type { i32, i32, i32, i32, i32, i8**, i8*, i8** }

@.str = private unnamed_addr constant [26 x i8] c"... (warning: truncated).\00", align 1
@.str.1 = private unnamed_addr constant [40 x i8] c"ERROR: log output error (can't write).\0A\00", align 1
@stderr = external dso_local global %struct._IO_FILE*, align 8
@fio_cli_start.run_once = internal global i8 0, align 1, !dbg !0
@fio_values = internal global %struct.fio_cli_hash_s zeroinitializer, align 8, !dbg !79

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "run_once", scope: !2, file: !3, line: 313, type: !97, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "fio_cli_start", scope: !3, file: !3, line: 310, type: !4, scopeLine: 312, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !11, retainedNodes: !96)
!3 = !DIFile(filename: "fio_cli.c", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !7, !6, !6, !8, !7}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!11 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !12, retainedTypes: !31, globals: !72, splitDebugInlining: false, nameTableKind: None)
!12 = !{!13}
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 1579, baseType: !15, size: 32, elements: !16)
!14 = !DIFile(filename: "../include/fio.h", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!17 = !DIEnumerator(name: "FIO_CALL_ON_INITIALIZE", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "FIO_CALL_PRE_START", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "FIO_CALL_BEFORE_FORK", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "FIO_CALL_AFTER_FORK", value: 3, isUnsigned: true)
!21 = !DIEnumerator(name: "FIO_CALL_IN_CHILD", value: 4, isUnsigned: true)
!22 = !DIEnumerator(name: "FIO_CALL_IN_MASTER", value: 5, isUnsigned: true)
!23 = !DIEnumerator(name: "FIO_CALL_ON_START", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "FIO_CALL_ON_IDLE", value: 7, isUnsigned: true)
!25 = !DIEnumerator(name: "FIO_CALL_ON_SHUTDOWN", value: 8, isUnsigned: true)
!26 = !DIEnumerator(name: "FIO_CALL_ON_FINISH", value: 9, isUnsigned: true)
!27 = !DIEnumerator(name: "FIO_CALL_ON_PARENT_CRUSH", value: 10, isUnsigned: true)
!28 = !DIEnumerator(name: "FIO_CALL_ON_CHILD_CRUSH", value: 11, isUnsigned: true)
!29 = !DIEnumerator(name: "FIO_CALL_AT_EXIT", value: 12, isUnsigned: true)
!30 = !DIEnumerator(name: "FIO_CALL_NEVER", value: 13, isUnsigned: true)
!31 = !{!32, !33, !36, !37, !6, !42, !15, !43, !45, !46, !52, !68}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !34, line: 87, baseType: !35)
!34 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!35 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !38, line: 27, baseType: !39)
!38 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !40, line: 45, baseType: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!41 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !44, line: 46, baseType: !41)
!44 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !34, line: 90, baseType: !41)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_cli_hash__map_s_", file: !14, line: 5823, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fio_cli_hash__map_s_", file: !14, line: 5820, size: 128, elements: !49)
!49 = !{!50, !51}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !48, file: !14, line: 5821, baseType: !45, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !48, file: !14, line: 5822, baseType: !52, size: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_cli_hash__ordered_s_", file: !14, line: 5818, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fio_cli_hash__ordered_s_", file: !14, line: 5815, size: 256, elements: !55)
!55 = !{!56, !57}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !54, file: !14, line: 5816, baseType: !45, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !54, file: !14, line: 5817, baseType: !58, size: 192, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_cli_hash_couplet_s", file: !14, line: 5598, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 5595, size: 192, elements: !60)
!60 = !{!61, !67}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !59, file: !14, line: 5596, baseType: !62, size: 128)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "cstr_s", file: !3, line: 24, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 21, size: 128, elements: !64)
!64 = !{!65, !66}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !63, file: !3, line: 22, baseType: !43, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !63, file: !3, line: 23, baseType: !8, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !59, file: !14, line: 5597, baseType: !8, size: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !38, line: 24, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !40, line: 38, baseType: !71)
!71 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!72 = !{!0, !73, !75, !77, !79, !92, !94}
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "FIO_LOG_LEVEL", scope: !11, file: !14, line: 433, type: !6, isLocal: false, isDefinition: true)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "fio_hash_secret_marker1", scope: !11, file: !14, line: 2433, type: !69, isLocal: false, isDefinition: true)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "fio_hash_secret_marker2", scope: !11, file: !14, line: 2434, type: !69, isLocal: false, isDefinition: true)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "fio_values", scope: !11, file: !3, line: 35, type: !81, isLocal: true, isDefinition: true)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_cli_hash_s", file: !14, line: 5643, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fio_cli_hash_s", file: !14, line: 5826, size: 384, elements: !83)
!83 = !{!84, !85, !86, !87, !88, !89, !90, !91}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !82, file: !14, line: 5827, baseType: !45, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "capa", scope: !82, file: !14, line: 5828, baseType: !45, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !82, file: !14, line: 5829, baseType: !45, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ordered", scope: !82, file: !14, line: 5830, baseType: !52, size: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !82, file: !14, line: 5831, baseType: !46, size: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "has_collisions", scope: !82, file: !14, line: 5832, baseType: !69, size: 8, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "used_bits", scope: !82, file: !14, line: 5833, baseType: !69, size: 8, offset: 328)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "under_attack", scope: !82, file: !14, line: 5834, baseType: !69, size: 8, offset: 336)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "fio_aliases", scope: !11, file: !3, line: 34, type: !81, isLocal: true, isDefinition: true)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "fio_unnamed_count", scope: !11, file: !3, line: 36, type: !43, isLocal: true, isDefinition: true)
!96 = !{}
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_lock_i", file: !14, line: 2060, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !69)
!99 = !{i32 7, !"Dwarf Version", i32 4}
!100 = !{i32 2, !"Debug Info Version", i32 3}
!101 = !{i32 1, !"wchar_size", i32 4}
!102 = !{!"clang version 10.0.0-4ubuntu1 "}
!103 = distinct !DISubprogram(name: "FIO_LOG2STDERR", scope: !14, file: !14, line: 437, type: !104, scopeLine: 437, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !11, retainedNodes: !96)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !8, null}
!106 = !DILocalVariable(name: "format", arg: 1, scope: !103, file: !14, line: 437, type: !8)
!107 = !DILocation(line: 437, column: 28, scope: !103)
!108 = !DILocalVariable(name: "tmp___log", scope: !103, file: !14, line: 438, type: !109)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 16384, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 2048)
!112 = !DILocation(line: 438, column: 8, scope: !103)
!113 = !DILocalVariable(name: "argv", scope: !103, file: !14, line: 439, type: !114)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !115, line: 52, baseType: !116)
!115 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !117, line: 32, baseType: !118)
!117 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stdarg.h", directory: "")
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 439, baseType: !119)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 192, elements: !126)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 439, size: 192, elements: !121)
!121 = !{!122, !123, !124, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !120, file: !3, line: 439, baseType: !15, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !120, file: !3, line: 439, baseType: !15, size: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !120, file: !3, line: 439, baseType: !32, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !120, file: !3, line: 439, baseType: !32, size: 64, offset: 128)
!126 = !{!127}
!127 = !DISubrange(count: 1)
!128 = !DILocation(line: 439, column: 11, scope: !103)
!129 = !DILocation(line: 440, column: 3, scope: !103)
!130 = !DILocalVariable(name: "len___log", scope: !103, file: !14, line: 441, type: !6)
!131 = !DILocation(line: 441, column: 7, scope: !103)
!132 = !DILocation(line: 441, column: 29, scope: !103)
!133 = !DILocation(line: 441, column: 66, scope: !103)
!134 = !DILocation(line: 441, column: 74, scope: !103)
!135 = !DILocation(line: 441, column: 19, scope: !103)
!136 = !DILocation(line: 442, column: 3, scope: !103)
!137 = !DILocation(line: 443, column: 7, scope: !138)
!138 = distinct !DILexicalBlock(scope: !103, file: !14, line: 443, column: 7)
!139 = !DILocation(line: 443, column: 17, scope: !138)
!140 = !DILocation(line: 443, column: 22, scope: !138)
!141 = !DILocation(line: 443, column: 25, scope: !138)
!142 = !DILocation(line: 443, column: 35, scope: !138)
!143 = !DILocation(line: 443, column: 7, scope: !103)
!144 = !DILocation(line: 444, column: 9, scope: !145)
!145 = distinct !DILexicalBlock(scope: !146, file: !14, line: 444, column: 9)
!146 = distinct !DILexicalBlock(scope: !138, file: !14, line: 443, column: 64)
!147 = !DILocation(line: 444, column: 19, scope: !145)
!148 = !DILocation(line: 444, column: 9, scope: !146)
!149 = !DILocation(line: 445, column: 14, scope: !150)
!150 = distinct !DILexicalBlock(scope: !145, file: !14, line: 444, column: 48)
!151 = !DILocation(line: 445, column: 24, scope: !150)
!152 = !DILocation(line: 445, column: 7, scope: !150)
!153 = !DILocation(line: 447, column: 17, scope: !150)
!154 = !DILocation(line: 448, column: 5, scope: !150)
!155 = !DILocation(line: 449, column: 65, scope: !156)
!156 = distinct !DILexicalBlock(scope: !145, file: !14, line: 448, column: 12)
!157 = !DILocation(line: 449, column: 7, scope: !156)
!158 = !DILocation(line: 450, column: 7, scope: !156)
!159 = !DILocation(line: 452, column: 3, scope: !146)
!160 = !DILocation(line: 453, column: 22, scope: !103)
!161 = !DILocation(line: 453, column: 3, scope: !103)
!162 = !DILocation(line: 453, column: 26, scope: !103)
!163 = !DILocation(line: 454, column: 13, scope: !103)
!164 = !DILocation(line: 454, column: 3, scope: !103)
!165 = !DILocation(line: 454, column: 24, scope: !103)
!166 = !DILocation(line: 455, column: 10, scope: !103)
!167 = !DILocation(line: 455, column: 21, scope: !103)
!168 = !DILocation(line: 455, column: 35, scope: !103)
!169 = !DILocation(line: 455, column: 3, scope: !103)
!170 = !DILocation(line: 456, column: 1, scope: !103)
!171 = !DILocalVariable(name: "argc", arg: 1, scope: !2, file: !3, line: 310, type: !6)
!172 = !DILocation(line: 310, column: 36, scope: !2)
!173 = !DILocalVariable(name: "argv", arg: 2, scope: !2, file: !3, line: 310, type: !7)
!174 = !DILocation(line: 310, column: 54, scope: !2)
!175 = !DILocalVariable(name: "unnamed_min", arg: 3, scope: !2, file: !3, line: 310, type: !6)
!176 = !DILocation(line: 310, column: 66, scope: !2)
!177 = !DILocalVariable(name: "unnamed_max", arg: 4, scope: !2, file: !3, line: 311, type: !6)
!178 = !DILocation(line: 311, column: 36, scope: !2)
!179 = !DILocalVariable(name: "description", arg: 5, scope: !2, file: !3, line: 311, type: !8)
!180 = !DILocation(line: 311, column: 61, scope: !2)
!181 = !DILocalVariable(name: "names", arg: 6, scope: !2, file: !3, line: 312, type: !7)
!182 = !DILocation(line: 312, column: 45, scope: !2)
!183 = !DILocation(line: 314, column: 8, scope: !184)
!184 = distinct !DILexicalBlock(scope: !2, file: !3, line: 314, column: 7)
!185 = !DILocation(line: 314, column: 7, scope: !2)
!186 = !DILocation(line: 315, column: 5, scope: !184)
!187 = !DILocation(line: 316, column: 7, scope: !188)
!188 = distinct !DILexicalBlock(scope: !2, file: !3, line: 316, column: 7)
!189 = !DILocation(line: 316, column: 19, scope: !188)
!190 = !DILocation(line: 316, column: 24, scope: !188)
!191 = !DILocation(line: 316, column: 27, scope: !188)
!192 = !DILocation(line: 316, column: 41, scope: !188)
!193 = !DILocation(line: 316, column: 39, scope: !188)
!194 = !DILocation(line: 316, column: 7, scope: !2)
!195 = !DILocation(line: 317, column: 19, scope: !188)
!196 = !DILocation(line: 317, column: 17, scope: !188)
!197 = !DILocation(line: 317, column: 5, scope: !188)
!198 = !DILocalVariable(name: "parser", scope: !2, file: !3, line: 318, type: !199)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_cli_parser_data_s", file: !3, line: 47, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 38, size: 384, elements: !201)
!201 = !{!202, !203, !204, !205, !206, !207, !208, !209}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed_min", scope: !200, file: !3, line: 39, baseType: !6, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed_max", scope: !200, file: !3, line: 40, baseType: !6, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !200, file: !3, line: 41, baseType: !6, size: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed_count", scope: !200, file: !3, line: 42, baseType: !6, size: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !200, file: !3, line: 43, baseType: !6, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !200, file: !3, line: 44, baseType: !7, size: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !200, file: !3, line: 45, baseType: !8, size: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !200, file: !3, line: 46, baseType: !7, size: 64, offset: 320)
!210 = !DILocation(line: 318, column: 25, scope: !2)
!211 = !DILocation(line: 318, column: 34, scope: !2)
!212 = !DILocation(line: 319, column: 22, scope: !2)
!213 = !DILocation(line: 320, column: 22, scope: !2)
!214 = !DILocation(line: 322, column: 15, scope: !2)
!215 = !DILocation(line: 323, column: 15, scope: !2)
!216 = !DILocation(line: 321, column: 22, scope: !2)
!217 = !DILocation(line: 324, column: 16, scope: !2)
!218 = !DILocation(line: 328, column: 7, scope: !219)
!219 = distinct !DILexicalBlock(scope: !2, file: !3, line: 328, column: 7)
!220 = !DILocation(line: 328, column: 7, scope: !2)
!221 = !DILocation(line: 329, column: 5, scope: !222)
!222 = distinct !DILexicalBlock(scope: !219, file: !3, line: 328, column: 40)
!223 = !DILocation(line: 330, column: 3, scope: !222)
!224 = !DILocalVariable(name: "line", scope: !2, file: !3, line: 334, type: !7)
!225 = !DILocation(line: 334, column: 16, scope: !2)
!226 = !DILocation(line: 334, column: 23, scope: !2)
!227 = !DILocation(line: 335, column: 3, scope: !2)
!228 = !DILocation(line: 335, column: 11, scope: !2)
!229 = !DILocation(line: 335, column: 10, scope: !2)
!230 = !DILocation(line: 336, column: 24, scope: !231)
!231 = distinct !DILexicalBlock(scope: !2, file: !3, line: 335, column: 17)
!232 = !DILocation(line: 336, column: 23, scope: !231)
!233 = !DILocation(line: 336, column: 13, scope: !231)
!234 = !DILocation(line: 336, column: 5, scope: !231)
!235 = !DILocation(line: 342, column: 7, scope: !236)
!236 = distinct !DILexicalBlock(scope: !231, file: !3, line: 336, column: 30)
!237 = !DILocation(line: 343, column: 7, scope: !236)
!238 = distinct !{!238, !227, !239}
!239 = !DILocation(line: 349, column: 3, scope: !2)
!240 = !DILocation(line: 345, column: 9, scope: !241)
!241 = distinct !DILexicalBlock(scope: !231, file: !3, line: 345, column: 9)
!242 = !DILocation(line: 345, column: 17, scope: !241)
!243 = !DILocation(line: 345, column: 50, scope: !241)
!244 = !DILocation(line: 346, column: 9, scope: !241)
!245 = !DILocation(line: 346, column: 17, scope: !241)
!246 = !DILocation(line: 345, column: 9, scope: !231)
!247 = !DILocation(line: 347, column: 31, scope: !241)
!248 = !DILocation(line: 347, column: 30, scope: !241)
!249 = !DILocation(line: 347, column: 7, scope: !241)
!250 = !DILocation(line: 348, column: 5, scope: !231)
!251 = !DILocation(line: 353, column: 3, scope: !2)
!252 = !DILocation(line: 353, column: 20, scope: !2)
!253 = !DILocation(line: 353, column: 11, scope: !2)
!254 = !DILocation(line: 353, column: 27, scope: !2)
!255 = !DILocation(line: 353, column: 25, scope: !2)
!256 = !DILocalVariable(name: "value", scope: !257, file: !3, line: 354, type: !8)
!257 = distinct !DILexicalBlock(scope: !2, file: !3, line: 353, column: 33)
!258 = !DILocation(line: 354, column: 17, scope: !257)
!259 = !DILocalVariable(name: "n", scope: !257, file: !3, line: 355, type: !62)
!260 = !DILocation(line: 355, column: 12, scope: !257)
!261 = !DILocation(line: 355, column: 16, scope: !257)
!262 = !DILocation(line: 355, column: 57, scope: !257)
!263 = !DILocation(line: 355, column: 69, scope: !257)
!264 = !DILocation(line: 355, column: 50, scope: !257)
!265 = !DILocation(line: 355, column: 25, scope: !257)
!266 = !DILocation(line: 355, column: 37, scope: !257)
!267 = !DILocation(line: 356, column: 16, scope: !268)
!268 = distinct !DILexicalBlock(scope: !257, file: !3, line: 356, column: 9)
!269 = !DILocation(line: 356, column: 20, scope: !268)
!270 = !DILocation(line: 356, column: 26, scope: !268)
!271 = !DILocation(line: 356, column: 24, scope: !268)
!272 = !DILocation(line: 356, column: 9, scope: !257)
!273 = !DILocation(line: 357, column: 15, scope: !274)
!274 = distinct !DILexicalBlock(scope: !268, file: !3, line: 356, column: 32)
!275 = !DILocation(line: 357, column: 27, scope: !274)
!276 = !DILocation(line: 357, column: 31, scope: !274)
