; ModuleID = 'fio_tls_missing.c'
source_filename = "fio_tls_missing.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.fio_tls_s = type { i64, %struct.alpn_list_s, %struct.cert_ary_s, %struct.trust_ary_s }
%struct.alpn_list_s = type { i64, i64, i64, %struct.alpn_list__ordered_s_*, %struct.alpn_list__map_s_*, i8, i8, i8 }
%struct.alpn_list__ordered_s_ = type { i64, %struct.alpn_s }
%struct.alpn_s = type { %struct.fio_str_s, void (i64, i8*, i8*)*, i8*, void (i8*)* }
%struct.fio_str_s = type { i32, i8, i8, [10 x i8], i64, i64, void (i8*)*, i8* }
%struct.alpn_list__map_s_ = type { i64, %struct.alpn_list__ordered_s_* }
%struct.cert_ary_s = type { i64, i64, i64, %struct.cert_s* }
%struct.cert_s = type { %struct.fio_str_s, %struct.fio_str_s, %struct.fio_str_s }
%struct.trust_ary_s = type { i64, i64, i64, %struct.trust_s* }
%struct.trust_s = type { %struct.fio_str_s }

@.str = private unnamed_addr constant [26 x i8] c"... (warning: truncated).\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "FIO_LOG_LEVEL", scope: !2, file: !12, line: 433, type: !20, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !9, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "fio_tls_missing.c", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!4 = !{}
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !7, line: 46, baseType: !8)
!7 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!8 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!9 = !{!0, !10, !18}
!10 = !DIGlobalVariableExpression(var: !11, expr: !DIExpression())
!11 = distinct !DIGlobalVariable(name: "fio_hash_secret_marker1", scope: !2, file: !12, line: 2433, type: !13, isLocal: false, isDefinition: true)
!12 = !DIFile(filename: "../include/fio.h", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !14, line: 24, baseType: !15)
!14 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !16, line: 38, baseType: !17)
!16 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!17 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "fio_hash_secret_marker2", scope: !2, file: !12, line: 2434, type: !13, isLocal: false, isDefinition: true)
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = !{i32 7, !"Dwarf Version", i32 4}
!22 = !{i32 2, !"Debug Info Version", i32 3}
!23 = !{i32 1, !"wchar_size", i32 4}
!24 = !{!"clang version 10.0.0-4ubuntu1 "}
!25 = distinct !DISubprogram(name: "FIO_LOG2STDERR", scope: !12, file: !12, line: 437, type: !26, scopeLine: 437, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!26 = !DISubroutineType(types: !27)
!27 = !{null, !28, null}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!31 = !DILocalVariable(name: "format", arg: 1, scope: !25, file: !12, line: 437, type: !28)
!32 = !DILocation(line: 437, column: 28, scope: !25)
!33 = !DILocalVariable(name: "tmp___log", scope: !25, file: !12, line: 438, type: !34)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 16384, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 2048)
!37 = !DILocation(line: 438, column: 8, scope: !25)
!38 = !DILocalVariable(name: "argv", scope: !25, file: !12, line: 439, type: !39)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !40, line: 52, baseType: !41)
!40 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !42, line: 32, baseType: !43)
!42 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stdarg.h", directory: "")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 439, baseType: !44)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 192, elements: !53)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 439, size: 192, elements: !46)
!46 = !{!47, !49, !50, !52}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !45, file: !3, line: 439, baseType: !48, size: 32)
!48 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !45, file: !3, line: 439, baseType: !48, size: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !45, file: !3, line: 439, baseType: !51, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !45, file: !3, line: 439, baseType: !51, size: 64, offset: 128)
!53 = !{!54}
!54 = !DISubrange(count: 1)
!55 = !DILocation(line: 439, column: 11, scope: !25)
!56 = !DILocation(line: 440, column: 3, scope: !25)
!57 = !DILocalVariable(name: "len___log", scope: !25, file: !12, line: 441, type: !20)
!58 = !DILocation(line: 441, column: 7, scope: !25)
!59 = !DILocation(line: 441, column: 29, scope: !25)
!60 = !DILocation(line: 441, column: 66, scope: !25)
!61 = !DILocation(line: 441, column: 74, scope: !25)
!62 = !DILocation(line: 441, column: 19, scope: !25)
!63 = !DILocation(line: 442, column: 3, scope: !25)
!64 = !DILocation(line: 443, column: 7, scope: !65)
!65 = distinct !DILexicalBlock(scope: !25, file: !12, line: 443, column: 7)
!66 = !DILocation(line: 443, column: 17, scope: !65)
!67 = !DILocation(line: 443, column: 22, scope: !65)
!68 = !DILocation(line: 443, column: 25, scope: !65)
!69 = !DILocation(line: 443, column: 35, scope: !65)
!70 = !DILocation(line: 443, column: 7, scope: !25)
!71 = !DILocation(line: 444, column: 9, scope: !72)
!72 = distinct !DILexicalBlock(scope: !73, file: !12, line: 444, column: 9)
!73 = distinct !DILexicalBlock(scope: !65, file: !12, line: 443, column: 64)
!74 = !DILocation(line: 444, column: 19, scope: !72)
!75 = !DILocation(line: 444, column: 9, scope: !73)
!76 = !DILocation(line: 445, column: 14, scope: !77)
!77 = distinct !DILexicalBlock(scope: !72, file: !12, line: 444, column: 48)
!78 = !DILocation(line: 445, column: 24, scope: !77)
!79 = !DILocation(line: 445, column: 7, scope: !77)
!80 = !DILocation(line: 447, column: 17, scope: !77)
!81 = !DILocation(line: 448, column: 5, scope: !77)
!82 = !DILocation(line: 449, column: 65, scope: !83)
!83 = distinct !DILexicalBlock(scope: !72, file: !12, line: 448, column: 12)
!84 = !DILocation(line: 449, column: 7, scope: !83)
!85 = !DILocation(line: 450, column: 7, scope: !83)
!86 = !DILocation(line: 452, column: 3, scope: !73)
!87 = !DILocation(line: 453, column: 22, scope: !25)
!88 = !DILocation(line: 453, column: 3, scope: !25)
!89 = !DILocation(line: 453, column: 26, scope: !25)
!90 = !DILocation(line: 454, column: 13, scope: !25)
!91 = !DILocation(line: 454, column: 3, scope: !25)
!92 = !DILocation(line: 454, column: 24, scope: !25)
!93 = !DILocation(line: 455, column: 10, scope: !25)
!94 = !DILocation(line: 455, column: 21, scope: !25)
!95 = !DILocation(line: 455, column: 35, scope: !25)
!96 = !DILocation(line: 455, column: 3, scope: !25)
!97 = !DILocation(line: 456, column: 1, scope: !25)
!98 = distinct !DISubprogram(name: "fio_tls_new", scope: !3, file: !3, line: 478, type: !99, scopeLine: 479, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!99 = !DISubroutineType(types: !100)
!100 = !{!101, !28, !28, !28, !28}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_tls_s", file: !103, line: 22, baseType: !104)
!103 = !DIFile(filename: "../include/fio_tls.h", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fio_tls_s", file: !3, line: 141, size: 960, elements: !105)
!105 = !{!106, !107, !168, !183}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !104, file: !3, line: 142, baseType: !6, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "alpn", scope: !104, file: !3, line: 143, baseType: !108, size: 384, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "alpn_list_s", file: !12, line: 5643, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alpn_list_s", file: !12, line: 5826, size: 384, elements: !110)
!110 = !{!111, !114, !115, !116, !158, !165, !166, !167}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !109, file: !12, line: 5827, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !113, line: 90, baseType: !8)
!113 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!114 = !DIDerivedType(tag: DW_TAG_member, name: "capa", scope: !109, file: !12, line: 5828, baseType: !112, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !109, file: !12, line: 5829, baseType: !112, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ordered", scope: !109, file: !12, line: 5830, baseType: !117, size: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "alpn_list__ordered_s_", file: !12, line: 5818, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alpn_list__ordered_s_", file: !12, line: 5815, size: 640, elements: !120)
!120 = !{!121, !122}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !119, file: !12, line: 5816, baseType: !112, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !119, file: !12, line: 5817, baseType: !123, size: 576, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "alpn_s", file: !3, line: 108, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 103, size: 576, elements: !125)
!125 = !{!126, !150, !156, !157}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !124, file: !3, line: 104, baseType: !127, size: 384)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_str_s", file: !12, line: 3409, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 3390, size: 384, elements: !129)
!129 = !{!130, !134, !135, !136, !140, !143, !144, !148}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !128, file: !12, line: 3392, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !14, line: 26, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !16, line: 42, baseType: !48)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "small", scope: !128, file: !12, line: 3394, baseType: !13, size: 8, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "frozen", scope: !128, file: !12, line: 3395, baseType: !13, size: 8, offset: 40)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !128, file: !12, line: 3399, baseType: !137, size: 80, offset: 48)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 80, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 10)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "capa", scope: !128, file: !12, line: 3401, baseType: !141, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !14, line: 27, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !16, line: 45, baseType: !8)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !128, file: !12, line: 3402, baseType: !141, size: 64, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "dealloc", scope: !128, file: !12, line: 3403, baseType: !145, size: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !51}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !128, file: !12, line: 3404, baseType: !149, size: 64, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "on_selected", scope: !124, file: !3, line: 105, baseType: !151, size: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !154, !51, !51}
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !113, line: 87, baseType: !155)
!155 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "udata_tls", scope: !124, file: !3, line: 106, baseType: !51, size: 64, offset: 448)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "on_cleanup", scope: !124, file: !3, line: 107, baseType: !145, size: 64, offset: 512)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !109, file: !12, line: 5831, baseType: !159, size: 64, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "alpn_list__map_s_", file: !12, line: 5823, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alpn_list__map_s_", file: !12, line: 5820, size: 128, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !161, file: !12, line: 5821, baseType: !112, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !161, file: !12, line: 5822, baseType: !117, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "has_collisions", scope: !109, file: !12, line: 5832, baseType: !13, size: 8, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "used_bits", scope: !109, file: !12, line: 5833, baseType: !13, size: 8, offset: 328)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "under_attack", scope: !109, file: !12, line: 5834, baseType: !13, size: 8, offset: 336)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "sni", scope: !104, file: !3, line: 147, baseType: !169, size: 256, offset: 448)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "cert_ary_s", file: !12, line: 4724, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cert_ary_s", file: !12, line: 4878, size: 256, elements: !171)
!171 = !{!172, !173, !174, !175}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !170, file: !12, line: 4879, baseType: !6, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !170, file: !12, line: 4880, baseType: !6, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "capa", scope: !170, file: !12, line: 4881, baseType: !6, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "arry", scope: !170, file: !12, line: 4882, baseType: !176, size: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "cert_s", file: !3, line: 49, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 45, size: 1152, elements: !179)
!179 = !{!180, !181, !182}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "private_key", scope: !178, file: !3, line: 46, baseType: !127, size: 384)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "public_key", scope: !178, file: !3, line: 47, baseType: !127, size: 384, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !178, file: !3, line: 48, baseType: !127, size: 384, offset: 768)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !104, file: !3, line: 148, baseType: !184, size: 256, offset: 704)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "trust_ary_s", file: !12, line: 4724, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trust_ary_s", file: !12, line: 4878, size: 256, elements: !186)
!186 = !{!187, !188, !189, !190}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !185, file: !12, line: 4879, baseType: !6, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !185, file: !12, line: 4880, baseType: !6, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "capa", scope: !185, file: !12, line: 4881, baseType: !6, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "arry", scope: !185, file: !12, line: 4882, baseType: !191, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "trust_s", file: !3, line: 80, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 78, size: 384, elements: !194)
!194 = !{!195}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "pem", scope: !193, file: !3, line: 79, baseType: !127, size: 384)
!196 = !DILocalVariable(name: "server_name", arg: 1, scope: !98, file: !3, line: 478, type: !28)
!197 = !DILocation(line: 478, column: 49, scope: !98)
!198 = !DILocalVariable(name: "cert", arg: 2, scope: !98, file: !3, line: 478, type: !28)
!199 = !DILocation(line: 478, column: 74, scope: !98)
!200 = !DILocalVariable(name: "key", arg: 3, scope: !98, file: !3, line: 479, type: !28)
!201 = !DILocation(line: 479, column: 49, scope: !98)
!202 = !DILocalVariable(name: "pk_password", arg: 4, scope: !98, file: !3, line: 479, type: !28)
!203 = !DILocation(line: 479, column: 66, scope: !98)
!204 = !DILocation(line: 480, column: 3, scope: !98)
!205 = !DILocation(line: 480, column: 3, scope: !206)
!206 = distinct !DILexicalBlock(scope: !207, file: !3, line: 480, column: 3)
!207 = distinct !DILexicalBlock(scope: !98, file: !3, line: 480, column: 3)
!208 = !DILocation(line: 480, column: 3, scope: !207)
!209 = !DILocation(line: 480, column: 3, scope: !210)
!210 = distinct !DILexicalBlock(scope: !206, file: !3, line: 480, column: 3)
!211 = distinct !DISubprogram(name: "fio_tls_cert_add", scope: !3, file: !3, line: 490, type: !212, scopeLine: 492, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !101, !28, !28, !28, !28}
!214 = !DILocalVariable(name: "tls", arg: 1, scope: !211, file: !3, line: 490, type: !101)
!215 = !DILocation(line: 490, column: 47, scope: !211)
!216 = !DILocalVariable(name: "server_name", arg: 2, scope: !211, file: !3, line: 490, type: !28)
!217 = !DILocation(line: 490, column: 64, scope: !211)
!218 = !DILocalVariable(name: "cert", arg: 3, scope: !211, file: !3, line: 491, type: !28)
!219 = !DILocation(line: 491, column: 48, scope: !211)
!220 = !DILocalVariable(name: "key", arg: 4, scope: !211, file: !3, line: 491, type: !28)
!221 = !DILocation(line: 491, column: 66, scope: !211)
!222 = !DILocalVariable(name: "pk_password", arg: 5, scope: !211, file: !3, line: 492, type: !28)
!223 = !DILocation(line: 492, column: 48, scope: !211)
!224 = !DILocation(line: 493, column: 3, scope: !211)
!225 = !DILocation(line: 493, column: 3, scope: !226)
!226 = distinct !DILexicalBlock(scope: !227, file: !3, line: 493, column: 3)
!227 = distinct !DILexicalBlock(scope: !211, file: !3, line: 493, column: 3)
!228 = !DILocation(line: 493, column: 3, scope: !227)
!229 = !DILocation(line: 493, column: 3, scope: !230)
!230 = distinct !DILexicalBlock(scope: !226, file: !3, line: 493, column: 3)
!231 = !DILabel(scope: !211, name: "file_missing", file: !3, line: 514)
!232 = !DILocation(line: 514, column: 1, scope: !211)
!233 = !DILocation(line: 515, column: 3, scope: !211)
!234 = !DILocation(line: 515, column: 3, scope: !235)
!235 = distinct !DILexicalBlock(scope: !236, file: !3, line: 515, column: 3)
!236 = distinct !DILexicalBlock(scope: !211, file: !3, line: 515, column: 3)
!237 = !DILocation(line: 515, column: 3, scope: !236)
!238 = !DILocation(line: 515, column: 3, scope: !239)
!239 = distinct !DILexicalBlock(scope: !235, file: !3, line: 515, column: 3)
!240 = !DILocation(line: 517, column: 3, scope: !211)
!241 = distinct !DISubprogram(name: "fio_tls_alpn_add", scope: !3, file: !3, line: 536, type: !242, scopeLine: 539, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !101, !28, !151, !51, !145}
