; ModuleID = 'fiobj_numbers.c'
source_filename = "fiobj_numbers.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.fiobj_object_vtable_s = type { i8*, void (i64, void (i64, i8*)*, i8*)*, i64 (i64)*, i64 (i64)*, i64 (i64, i64)*, i64 (i64, i64, i32 (i64, i8*)*, i8*)*, void (%struct.fio_str_info_s*, i64)*, i64 (i64)*, double (i64)* }
%struct.fio_str_info_s = type { i64, i64, i8* }
%struct.fiobj_num_s = type { %struct.fiobj_object_header_s, i64 }
%struct.fiobj_object_header_s = type { i8, i32 }
%struct.fiobj_float_s = type { %struct.fiobj_object_header_s, double }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@.str = private unnamed_addr constant [26 x i8] c"... (warning: truncated).\00", align 1
@.str.1 = private unnamed_addr constant [40 x i8] c"ERROR: log output error (can't write).\0A\00", align 1
@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str.2 = private unnamed_addr constant [7 x i8] c"Number\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "FIOBJECT_VTABLE_NUMBER", scope: !2, file: !3, line: 79, type: !57, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !54, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "fiobj_numbers.c", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 50, baseType: !7, size: 8, elements: !8)
!6 = !DIFile(filename: "../include/fiobject.h", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!9 = !DIEnumerator(name: "FIOBJ_T_NUMBER", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "FIOBJ_T_NULL", value: 6, isUnsigned: true)
!11 = !DIEnumerator(name: "FIOBJ_T_TRUE", value: 22, isUnsigned: true)
!12 = !DIEnumerator(name: "FIOBJ_T_FALSE", value: 38, isUnsigned: true)
!13 = !DIEnumerator(name: "FIOBJ_T_FLOAT", value: 39, isUnsigned: true)
!14 = !DIEnumerator(name: "FIOBJ_T_STRING", value: 40, isUnsigned: true)
!15 = !DIEnumerator(name: "FIOBJ_T_ARRAY", value: 41, isUnsigned: true)
!16 = !DIEnumerator(name: "FIOBJ_T_HASH", value: 42, isUnsigned: true)
!17 = !DIEnumerator(name: "FIOBJ_T_DATA", value: 43, isUnsigned: true)
!18 = !DIEnumerator(name: "FIOBJ_T_UNKNOWN", value: 44, isUnsigned: true)
!19 = !{!20, !24, !29, !42, !21, !43, !41, !51, !49, !53}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "FIOBJ", file: !6, line: 63, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !22, line: 90, baseType: !23)
!22 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!23 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !25, line: 26, baseType: !26)
!25 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !27, line: 42, baseType: !28)
!27 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!28 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "fiobj_float_s", file: !3, line: 27, baseType: !31)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 24, size: 128, elements: !32)
!32 = !{!33, !40}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !31, file: !3, line: 25, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "fiobj_object_header_s", file: !6, line: 332, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 327, size: 64, elements: !36)
!36 = !{!37, !39}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !35, file: !6, line: 329, baseType: !38, size: 8)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "fiobj_type_enum", file: !6, line: 61, baseType: !5)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !35, file: !6, line: 331, baseType: !24, size: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !31, file: !3, line: 26, baseType: !41, size: 64, offset: 64)
!41 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "fiobj_num_s", file: !3, line: 22, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 19, size: 128, elements: !46)
!46 = !{!47, !48}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !45, file: !3, line: 20, baseType: !34, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !45, file: !3, line: 21, baseType: !49, size: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !22, line: 87, baseType: !50)
!50 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!54 = !{!0, !55, !121, !127, !132, !134, !138, !140}
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "FIOBJECT_VTABLE_FLOAT", scope: !2, file: !3, line: 90, type: !57, isLocal: false, isDefinition: true)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "fiobj_object_vtable_s", file: !6, line: 325, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 305, size: 576, elements: !60)
!60 = !{!61, !64, !72, !78, !85, !90, !99, !111, !116}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !59, file: !6, line: 307, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "dealloc", scope: !59, file: !6, line: 309, baseType: !65, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !20, !69, !42}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !20, !42}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !59, file: !6, line: 311, baseType: !73, size: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!21, !77}
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "is_true", scope: !59, file: !6, line: 313, baseType: !79, size: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!83, !77}
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !84, line: 46, baseType: !23)
!84 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!85 = !DIDerivedType(tag: DW_TAG_member, name: "is_eq", scope: !59, file: !6, line: 315, baseType: !86, size: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!83, !77, !77}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "each", scope: !59, file: !6, line: 317, baseType: !91, size: 64, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!83, !20, !83, !95, !42}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!98, !20, !42}
!98 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "to_str", scope: !59, file: !6, line: 320, baseType: !100, size: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!104, !77}
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_str_info_s", file: !105, line: 287, baseType: !106)
!105 = !DIFile(filename: "../include/fio.h", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fio_str_info_s", file: !105, line: 283, size: 192, elements: !107)
!107 = !{!108, !109, !110}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "capa", scope: !106, file: !105, line: 284, baseType: !83, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !106, file: !105, line: 285, baseType: !83, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !106, file: !105, line: 286, baseType: !51, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "to_i", scope: !59, file: !6, line: 322, baseType: !112, size: 64, offset: 448)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!49, !77}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "to_f", scope: !59, file: !6, line: 324, baseType: !117, size: 64, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!41, !77}
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "ret", scope: !123, file: !3, line: 131, type: !44, isLocal: true, isDefinition: true)
!123 = distinct !DISubprogram(name: "fiobj_num_tmp", scope: !3, file: !3, line: 130, type: !124, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !126)
!124 = !DISubroutineType(types: !125)
!125 = !{!20, !49}
!126 = !{}
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "ret", scope: !129, file: !3, line: 169, type: !30, isLocal: true, isDefinition: true)
!129 = distinct !DISubprogram(name: "fiobj_float_tmp", scope: !3, file: !3, line: 168, type: !130, scopeLine: 168, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !126)
!130 = !DISubroutineType(types: !131)
!131 = !{!20, !41}
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "FIO_LOG_LEVEL", scope: !2, file: !105, line: 433, type: !98, isLocal: false, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "fio_hash_secret_marker1", scope: !2, file: !105, line: 2433, type: !136, isLocal: false, isDefinition: true)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !25, line: 24, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !27, line: 38, baseType: !7)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "fio_hash_secret_marker2", scope: !2, file: !105, line: 2434, type: !136, isLocal: false, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "num_buffer", scope: !2, file: !3, line: 185, type: !142, isLocal: true, isDefinition: true)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 4096, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 512)
!145 = !{i32 7, !"Dwarf Version", i32 4}
!146 = !{i32 2, !"Debug Info Version", i32 3}
!147 = !{i32 1, !"wchar_size", i32 4}
!148 = !{!"clang version 10.0.0-4ubuntu1 "}
!149 = distinct !DISubprogram(name: "FIO_LOG2STDERR", scope: !105, file: !105, line: 437, type: !150, scopeLine: 437, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !126)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !62, null}
!152 = !DILocalVariable(name: "format", arg: 1, scope: !149, file: !105, line: 437, type: !62)
!153 = !DILocation(line: 437, column: 28, scope: !149)
!154 = !DILocalVariable(name: "tmp___log", scope: !149, file: !105, line: 438, type: !155)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 16384, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 2048)
!158 = !DILocation(line: 438, column: 8, scope: !149)
!159 = !DILocalVariable(name: "argv", scope: !149, file: !105, line: 439, type: !160)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !161, line: 52, baseType: !162)
!161 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !163, line: 32, baseType: !164)
!163 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stdarg.h", directory: "")
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 439, baseType: !165)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 192, elements: !172)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 439, size: 192, elements: !167)
!167 = !{!168, !169, !170, !171}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !166, file: !3, line: 439, baseType: !28, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !166, file: !3, line: 439, baseType: !28, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !166, file: !3, line: 439, baseType: !42, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !166, file: !3, line: 439, baseType: !42, size: 64, offset: 128)
!172 = !{!173}
!173 = !DISubrange(count: 1)
!174 = !DILocation(line: 439, column: 11, scope: !149)
!175 = !DILocation(line: 440, column: 3, scope: !149)
!176 = !DILocalVariable(name: "len___log", scope: !149, file: !105, line: 441, type: !98)
!177 = !DILocation(line: 441, column: 7, scope: !149)
!178 = !DILocation(line: 441, column: 29, scope: !149)
!179 = !DILocation(line: 441, column: 66, scope: !149)
!180 = !DILocation(line: 441, column: 74, scope: !149)
!181 = !DILocation(line: 441, column: 19, scope: !149)
!182 = !DILocation(line: 442, column: 3, scope: !149)
!183 = !DILocation(line: 443, column: 7, scope: !184)
!184 = distinct !DILexicalBlock(scope: !149, file: !105, line: 443, column: 7)
!185 = !DILocation(line: 443, column: 17, scope: !184)
!186 = !DILocation(line: 443, column: 22, scope: !184)
!187 = !DILocation(line: 443, column: 25, scope: !184)
!188 = !DILocation(line: 443, column: 35, scope: !184)
!189 = !DILocation(line: 443, column: 7, scope: !149)
!190 = !DILocation(line: 444, column: 9, scope: !191)
!191 = distinct !DILexicalBlock(scope: !192, file: !105, line: 444, column: 9)
!192 = distinct !DILexicalBlock(scope: !184, file: !105, line: 443, column: 64)
!193 = !DILocation(line: 444, column: 19, scope: !191)
!194 = !DILocation(line: 444, column: 9, scope: !192)
!195 = !DILocation(line: 445, column: 14, scope: !196)
!196 = distinct !DILexicalBlock(scope: !191, file: !105, line: 444, column: 48)
!197 = !DILocation(line: 445, column: 24, scope: !196)
!198 = !DILocation(line: 445, column: 7, scope: !196)
!199 = !DILocation(line: 447, column: 17, scope: !196)
!200 = !DILocation(line: 448, column: 5, scope: !196)
!201 = !DILocation(line: 449, column: 65, scope: !202)
!202 = distinct !DILexicalBlock(scope: !191, file: !105, line: 448, column: 12)
!203 = !DILocation(line: 449, column: 7, scope: !202)
!204 = !DILocation(line: 450, column: 7, scope: !202)
!205 = !DILocation(line: 452, column: 3, scope: !192)
!206 = !DILocation(line: 453, column: 22, scope: !149)
!207 = !DILocation(line: 453, column: 3, scope: !149)
!208 = !DILocation(line: 453, column: 26, scope: !149)
!209 = !DILocation(line: 454, column: 13, scope: !149)
!210 = !DILocation(line: 454, column: 3, scope: !149)
!211 = !DILocation(line: 454, column: 24, scope: !149)
!212 = !DILocation(line: 455, column: 10, scope: !149)
!213 = !DILocation(line: 455, column: 21, scope: !149)
!214 = !DILocation(line: 455, column: 35, scope: !149)
!215 = !DILocation(line: 455, column: 3, scope: !149)
!216 = !DILocation(line: 456, column: 1, scope: !149)
!217 = distinct !DISubprogram(name: "fio_itrue", scope: !3, file: !3, line: 45, type: !81, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!218 = !DILocalVariable(name: "o", arg: 1, scope: !217, file: !3, line: 45, type: !77)
!219 = !DILocation(line: 45, column: 37, scope: !217)
!220 = !DILocation(line: 45, column: 50, scope: !217)
!221 = !DILocation(line: 45, column: 62, scope: !217)
!222 = !DILocation(line: 45, column: 64, scope: !217)
!223 = !DILocation(line: 45, column: 49, scope: !217)
!224 = !DILocation(line: 45, column: 42, scope: !217)
!225 = distinct !DISubprogram(name: "fiobj_i_is_eq", scope: !3, file: !3, line: 69, type: !88, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!226 = !DILocalVariable(name: "self", arg: 1, scope: !225, file: !3, line: 69, type: !77)
!227 = !DILocation(line: 69, column: 41, scope: !225)
!228 = !DILocalVariable(name: "other", arg: 2, scope: !225, file: !3, line: 69, type: !77)
!229 = !DILocation(line: 69, column: 59, scope: !225)
!230 = !DILocation(line: 70, column: 10, scope: !225)
!231 = !DILocation(line: 70, column: 25, scope: !225)
!232 = !DILocation(line: 70, column: 30, scope: !225)
