; ModuleID = 'fiobj_hash.c'
source_filename = "fiobj_hash.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.fiobj_object_vtable_s = type { i8*, void (i64, void (i64, i8*)*, i8*)*, i64 (i64)*, i64 (i64)*, i64 (i64, i64)*, i64 (i64, i64, i32 (i64, i8*)*, i8*)*, void (%struct.fio_str_info_s*, i64)*, i64 (i64)*, double (i64)* }
%struct.fio_str_info_s = type { i64, i64, i8* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.fiobj_hash_s = type { %struct.fiobj_object_header_s, %struct.fio_hash___s }
%struct.fiobj_object_header_s = type { i8, i32 }
%struct.fio_hash___s = type { i64, i64, i64, %struct.fio_hash____ordered_s_*, %struct.fio_hash____map_s_*, i8, i8, i8 }
%struct.fio_hash____ordered_s_ = type { i64, %struct.fio_hash___couplet_s }
%struct.fio_hash___couplet_s = type { i64, i64 }
%struct.fio_hash____map_s_ = type { i64, %struct.fio_hash____ordered_s_* }

@.str = private unnamed_addr constant [26 x i8] c"... (warning: truncated).\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "each_at_key", scope: !2, file: !3, line: 72, type: !58, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !81, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "fiobj_hash.c", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 50, baseType: !7, size: 8, elements: !8)
!6 = !DIFile(filename: "../include/fiobject.h", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!9 = !DIEnumerator(name: "FIOBJ_T_NUMBER", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "FIOBJ_T_NULL", value: 6, isUnsigned: true)
!11 = !DIEnumerator(name: "FIOBJ_T_TRUE", value: 22, isUnsigned: true)
!12 = !DIEnumerator(name: "FIOBJ_T_FALSE", value: 38, isUnsigned: true)
!13 = !DIEnumerator(name: "FIOBJ_T_FLOAT", value: 39, isUnsigned: true)
!14 = !DIEnumerator(name: "FIOBJ_T_STRING", value: 40, isUnsigned: true)
!15 = !DIEnumerator(name: "FIOBJ_T_ARRAY", value: 41, isUnsigned: true)
!16 = !DIEnumerator(name: "FIOBJ_T_HASH", value: 42, isUnsigned: true)
!17 = !DIEnumerator(name: "FIOBJ_T_DATA", value: 43, isUnsigned: true)
!18 = !DIEnumerator(name: "FIOBJ_T_UNKNOWN", value: 44, isUnsigned: true)
!19 = !{!20, !72, !42, !73, !58, !75, !61, !48, !76, !29, !77, !79}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "fiobj_hash_s", file: !3, line: 45, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 42, size: 448, elements: !23)
!23 = !{!24, !36}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !22, file: !3, line: 43, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "fiobj_object_header_s", file: !6, line: 332, baseType: !26)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 327, size: 64, elements: !27)
!27 = !{!28, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !26, file: !6, line: 329, baseType: !29, size: 8)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "fiobj_type_enum", file: !6, line: 61, baseType: !5)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !26, file: !6, line: 331, baseType: !31, size: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !32, line: 26, baseType: !33)
!32 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !34, line: 42, baseType: !35)
!34 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!35 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !22, file: !3, line: 44, baseType: !37, size: 384, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_hash___s", file: !38, line: 5643, baseType: !39)
!38 = !DIFile(filename: "../include/fio.h", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fio_hash___s", file: !38, line: 5826, size: 384, elements: !40)
!40 = !{!41, !45, !46, !47, !60, !67, !70, !71}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !39, file: !38, line: 5827, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !43, line: 90, baseType: !44)
!43 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!44 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "capa", scope: !39, file: !38, line: 5828, baseType: !42, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !39, file: !38, line: 5829, baseType: !42, size: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ordered", scope: !39, file: !38, line: 5830, baseType: !48, size: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_hash____ordered_s_", file: !38, line: 5818, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fio_hash____ordered_s_", file: !38, line: 5815, size: 192, elements: !51)
!51 = !{!52, !53}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !50, file: !38, line: 5816, baseType: !42, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !50, file: !38, line: 5817, baseType: !54, size: 128, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_hash___couplet_s", file: !38, line: 5598, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 5595, size: 128, elements: !56)
!56 = !{!57, !59}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !55, file: !38, line: 5596, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "FIOBJ", file: !6, line: 63, baseType: !42)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !55, file: !38, line: 5597, baseType: !58, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !39, file: !38, line: 5831, baseType: !61, size: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_hash____map_s_", file: !38, line: 5823, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fio_hash____map_s_", file: !38, line: 5820, size: 128, elements: !64)
!64 = !{!65, !66}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !63, file: !38, line: 5821, baseType: !42, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !63, file: !38, line: 5822, baseType: !48, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "has_collisions", scope: !39, file: !38, line: 5832, baseType: !68, size: 8, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !32, line: 24, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !34, line: 38, baseType: !7)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "used_bits", scope: !39, file: !38, line: 5833, baseType: !68, size: 8, offset: 328)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "under_attack", scope: !39, file: !38, line: 5834, baseType: !68, size: 8, offset: 336)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !43, line: 87, baseType: !74)
!74 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !78, line: 46, baseType: !44)
!78 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !32, line: 27, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !34, line: 45, baseType: !44)
!81 = !{!82, !148, !150, !152, !0}
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "FIOBJECT_VTABLE_HASH", scope: !2, file: !3, line: 138, type: !84, isLocal: false, isDefinition: true)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "fiobj_object_vtable_s", file: !6, line: 325, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 305, size: 576, elements: !87)
!87 = !{!88, !92, !100, !106, !111, !116, !125, !137, !142}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !86, file: !6, line: 307, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!91 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "dealloc", scope: !86, file: !6, line: 309, baseType: !93, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{null, !58, !97, !72}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{null, !58, !72}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !86, file: !6, line: 311, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!42, !105}
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "is_true", scope: !86, file: !6, line: 313, baseType: !107, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!77, !105}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "is_eq", scope: !86, file: !6, line: 315, baseType: !112, size: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!77, !105, !105}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "each", scope: !86, file: !6, line: 317, baseType: !117, size: 64, offset: 320)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!77, !58, !77, !121, !72}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!124, !58, !72}
!124 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "to_str", scope: !86, file: !6, line: 320, baseType: !126, size: 64, offset: 384)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!130, !105}
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_str_info_s", file: !38, line: 287, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fio_str_info_s", file: !38, line: 283, size: 192, elements: !132)
!132 = !{!133, !134, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "capa", scope: !131, file: !38, line: 284, baseType: !77, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !131, file: !38, line: 285, baseType: !77, size: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !131, file: !38, line: 286, baseType: !136, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "to_i", scope: !86, file: !6, line: 322, baseType: !138, size: 64, offset: 448)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!73, !105}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "to_f", scope: !86, file: !6, line: 324, baseType: !143, size: 64, offset: 512)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!147, !105}
!147 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "FIO_LOG_LEVEL", scope: !2, file: !38, line: 433, type: !124, isLocal: false, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "fio_hash_secret_marker1", scope: !2, file: !38, line: 2433, type: !68, isLocal: false, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "fio_hash_secret_marker2", scope: !2, file: !38, line: 2434, type: !68, isLocal: false, isDefinition: true)
!154 = !{i32 7, !"Dwarf Version", i32 4}
!155 = !{i32 2, !"Debug Info Version", i32 3}
!156 = !{i32 1, !"wchar_size", i32 4}
!157 = !{!"clang version 10.0.0-4ubuntu1 "}
!158 = distinct !DISubprogram(name: "FIO_LOG2STDERR", scope: !38, file: !38, line: 437, type: !159, scopeLine: 437, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !161)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !89, null}
!161 = !{}
!162 = !DILocalVariable(name: "format", arg: 1, scope: !158, file: !38, line: 437, type: !89)
!163 = !DILocation(line: 437, column: 28, scope: !158)
!164 = !DILocalVariable(name: "tmp___log", scope: !158, file: !38, line: 438, type: !165)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 16384, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 2048)
!168 = !DILocation(line: 438, column: 8, scope: !158)
!169 = !DILocalVariable(name: "argv", scope: !158, file: !38, line: 439, type: !170)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !171, line: 52, baseType: !172)
!171 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !173, line: 32, baseType: !174)
!173 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stdarg.h", directory: "")
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 439, baseType: !175)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 192, elements: !182)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 439, size: 192, elements: !177)
!177 = !{!178, !179, !180, !181}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !176, file: !3, line: 439, baseType: !35, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !176, file: !3, line: 439, baseType: !35, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !176, file: !3, line: 439, baseType: !72, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !176, file: !3, line: 439, baseType: !72, size: 64, offset: 128)
!182 = !{!183}
!183 = !DISubrange(count: 1)
!184 = !DILocation(line: 439, column: 11, scope: !158)
!185 = !DILocation(line: 440, column: 3, scope: !158)
!186 = !DILocalVariable(name: "len___log", scope: !158, file: !38, line: 441, type: !124)
!187 = !DILocation(line: 441, column: 7, scope: !158)
!188 = !DILocation(line: 441, column: 29, scope: !158)
!189 = !DILocation(line: 441, column: 66, scope: !158)
!190 = !DILocation(line: 441, column: 74, scope: !158)
!191 = !DILocation(line: 441, column: 19, scope: !158)
!192 = !DILocation(line: 442, column: 3, scope: !158)
!193 = !DILocation(line: 443, column: 7, scope: !194)
!194 = distinct !DILexicalBlock(scope: !158, file: !38, line: 443, column: 7)
!195 = !DILocation(line: 443, column: 17, scope: !194)
!196 = !DILocation(line: 443, column: 22, scope: !194)
!197 = !DILocation(line: 443, column: 25, scope: !194)
!198 = !DILocation(line: 443, column: 35, scope: !194)
!199 = !DILocation(line: 443, column: 7, scope: !158)
!200 = !DILocation(line: 444, column: 9, scope: !201)
!201 = distinct !DILexicalBlock(scope: !202, file: !38, line: 444, column: 9)
!202 = distinct !DILexicalBlock(scope: !194, file: !38, line: 443, column: 64)
!203 = !DILocation(line: 444, column: 19, scope: !201)
!204 = !DILocation(line: 444, column: 9, scope: !202)
!205 = !DILocation(line: 445, column: 14, scope: !206)
!206 = distinct !DILexicalBlock(scope: !201, file: !38, line: 444, column: 48)
!207 = !DILocation(line: 445, column: 24, scope: !206)
!208 = !DILocation(line: 445, column: 7, scope: !206)
!209 = !DILocation(line: 447, column: 17, scope: !206)
!210 = !DILocation(line: 448, column: 5, scope: !206)
!211 = !DILocation(line: 449, column: 65, scope: !212)
!212 = distinct !DILexicalBlock(scope: !201, file: !38, line: 448, column: 12)
!213 = !DILocation(line: 449, column: 7, scope: !212)
!214 = !DILocation(line: 450, column: 7, scope: !212)
!215 = !DILocation(line: 452, column: 3, scope: !202)
!216 = !DILocation(line: 453, column: 22, scope: !158)
!217 = !DILocation(line: 453, column: 3, scope: !158)
!218 = !DILocation(line: 453, column: 26, scope: !158)
!219 = !DILocation(line: 454, column: 13, scope: !158)
!220 = !DILocation(line: 454, column: 3, scope: !158)
!221 = !DILocation(line: 454, column: 24, scope: !158)
!222 = !DILocation(line: 455, column: 10, scope: !158)
!223 = !DILocation(line: 455, column: 21, scope: !158)
!224 = !DILocation(line: 455, column: 35, scope: !158)
!225 = !DILocation(line: 455, column: 3, scope: !158)
!226 = !DILocation(line: 456, column: 1, scope: !158)
!227 = distinct !DISubprogram(name: "fiobj_hash_rehash", scope: !3, file: !3, line: 49, type: !228, scopeLine: 49, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !161)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !58}
!230 = !DILocalVariable(name: "h", arg: 1, scope: !227, file: !3, line: 49, type: !58)
!231 = !DILocation(line: 49, column: 30, scope: !227)
!232 = !DILocation(line: 50, column: 3, scope: !233)
!233 = distinct !DILexicalBlock(scope: !234, file: !3, line: 50, column: 3)
!234 = distinct !DILexicalBlock(scope: !227, file: !3, line: 50, column: 3)
!235 = !DILocation(line: 50, column: 3, scope: !234)
!236 = !DILocation(line: 51, column: 22, scope: !227)
!237 = !DILocation(line: 51, column: 35, scope: !227)
!238 = !DILocation(line: 51, column: 3, scope: !227)
!239 = !DILocation(line: 52, column: 1, scope: !227)
!240 = distinct !DISubprogram(name: "fiobj_type_is", scope: !6, file: !6, line: 269, type: !241, scopeLine: 269, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !161)
!241 = !DISubroutineType(types: !242)
!242 = !{!77, !58, !29}
!243 = !DILocalVariable(name: "o", arg: 1, scope: !240, file: !6, line: 269, type: !58)
!244 = !DILocation(line: 269, column: 39, scope: !240)
