; ModuleID = 'fiobj_ary.c'
source_filename = "fiobj_ary.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.fiobj_object_vtable_s = type { i8*, void (i64, void (i64, i8*)*, i8*)*, i64 (i64)*, i64 (i64)*, i64 (i64, i64)*, i64 (i64, i64, i32 (i64, i8*)*, i8*)*, void (%struct.fio_str_info_s*, i64)*, i64 (i64)*, double (i64)* }
%struct.fio_str_info_s = type { i64, i64, i8* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.fiobj_ary_s = type { %struct.fiobj_object_header_s, %struct.fio_ary___s }
%struct.fiobj_object_header_s = type { i8, i32 }
%struct.fio_ary___s = type { i64, i64, i64, i64* }

@.str = private unnamed_addr constant [26 x i8] c"... (warning: truncated).\00", align 1
@.str.1 = private unnamed_addr constant [40 x i8] c"ERROR: log output error (can't write).\0A\00", align 1
@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str.2 = private unnamed_addr constant [34 x i8] c"FIOBJ_TYPE_IS(ary, FIOBJ_T_ARRAY)\00", align 1
@.str.3 = private unnamed_addr constant [12 x i8] c"fiobj_ary.c\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "FIOBJECT_VTABLE_ARRAY", scope: !2, file: !3, line: 65, type: !70, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !60, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "fiobj_ary.c", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 50, baseType: !7, size: 8, elements: !8)
!6 = !DIFile(filename: "../include/fiobject.h", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!9 = !DIEnumerator(name: "FIOBJ_T_NUMBER", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "FIOBJ_T_NULL", value: 6, isUnsigned: true)
!11 = !DIEnumerator(name: "FIOBJ_T_TRUE", value: 22, isUnsigned: true)
!12 = !DIEnumerator(name: "FIOBJ_T_FALSE", value: 38, isUnsigned: true)
!13 = !DIEnumerator(name: "FIOBJ_T_FLOAT", value: 39, isUnsigned: true)
!14 = !DIEnumerator(name: "FIOBJ_T_STRING", value: 40, isUnsigned: true)
!15 = !DIEnumerator(name: "FIOBJ_T_ARRAY", value: 41, isUnsigned: true)
!16 = !DIEnumerator(name: "FIOBJ_T_HASH", value: 42, isUnsigned: true)
!17 = !DIEnumerator(name: "FIOBJ_T_DATA", value: 43, isUnsigned: true)
!18 = !DIEnumerator(name: "FIOBJ_T_UNKNOWN", value: 44, isUnsigned: true)
!19 = !{!20, !48, !52, !56, !57, !58, !50, !49, !42, !59, !29}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "fiobj_ary_s", file: !3, line: 24, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 21, size: 320, elements: !23)
!23 = !{!24, !36}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !22, file: !3, line: 22, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "fiobj_object_header_s", file: !6, line: 332, baseType: !26)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 327, size: 64, elements: !27)
!27 = !{!28, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !26, file: !6, line: 329, baseType: !29, size: 8)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "fiobj_type_enum", file: !6, line: 61, baseType: !5)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !26, file: !6, line: 331, baseType: !31, size: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !32, line: 26, baseType: !33)
!32 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !34, line: 42, baseType: !35)
!34 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!35 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ary", scope: !22, file: !3, line: 23, baseType: !37, size: 256, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_ary___s", file: !38, line: 4724, baseType: !39)
!38 = !DIFile(filename: "../include/fio.h", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fio_ary___s", file: !38, line: 4878, size: 256, elements: !40)
!40 = !{!41, !45, !46, !47}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !39, file: !38, line: 4879, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !43, line: 46, baseType: !44)
!43 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!44 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !39, file: !38, line: 4880, baseType: !42, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "capa", scope: !39, file: !38, line: 4881, baseType: !42, size: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "arry", scope: !39, file: !38, line: 4882, baseType: !48, size: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "FIOBJ", file: !6, line: 63, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !51, line: 90, baseType: !44)
!51 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !53, line: 27, baseType: !54)
!53 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !34, line: 44, baseType: !55)
!55 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !51, line: 87, baseType: !55)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!60 = !{!0, !61, !64, !68}
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "FIO_LOG_LEVEL", scope: !2, file: !38, line: 433, type: !63, isLocal: false, isDefinition: true)
!63 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "fio_hash_secret_marker1", scope: !2, file: !38, line: 2433, type: !66, isLocal: false, isDefinition: true)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !32, line: 24, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !34, line: 38, baseType: !7)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "fio_hash_secret_marker2", scope: !2, file: !38, line: 2434, type: !66, isLocal: false, isDefinition: true)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "fiobj_object_vtable_s", file: !6, line: 325, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 305, size: 576, elements: !73)
!73 = !{!74, !78, !86, !92, !97, !102, !110, !122, !127}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !72, file: !6, line: 307, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!77 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "dealloc", scope: !72, file: !6, line: 309, baseType: !79, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !49, !83, !58}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !49, !58}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !72, file: !6, line: 311, baseType: !87, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!50, !91}
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "is_true", scope: !72, file: !6, line: 313, baseType: !93, size: 64, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!42, !91}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "is_eq", scope: !72, file: !6, line: 315, baseType: !98, size: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!42, !91, !91}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "each", scope: !72, file: !6, line: 317, baseType: !103, size: 64, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!42, !49, !42, !107, !58}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!63, !49, !58}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "to_str", scope: !72, file: !6, line: 320, baseType: !111, size: 64, offset: 384)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!115, !91}
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_str_info_s", file: !38, line: 287, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fio_str_info_s", file: !38, line: 283, size: 192, elements: !117)
!117 = !{!118, !119, !120}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "capa", scope: !116, file: !38, line: 284, baseType: !42, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !116, file: !38, line: 285, baseType: !42, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !116, file: !38, line: 286, baseType: !121, size: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "to_i", scope: !72, file: !6, line: 322, baseType: !123, size: 64, offset: 448)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!56, !91}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "to_f", scope: !72, file: !6, line: 324, baseType: !128, size: 64, offset: 512)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!132, !91}
!132 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!133 = !{i32 7, !"Dwarf Version", i32 4}
!134 = !{i32 2, !"Debug Info Version", i32 3}
!135 = !{i32 1, !"wchar_size", i32 4}
!136 = !{!"clang version 10.0.0-4ubuntu1 "}
!137 = distinct !DISubprogram(name: "FIO_LOG2STDERR", scope: !38, file: !38, line: 437, type: !138, scopeLine: 437, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !140)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !75, null}
!140 = !{}
!141 = !DILocalVariable(name: "format", arg: 1, scope: !137, file: !38, line: 437, type: !75)
!142 = !DILocation(line: 437, column: 28, scope: !137)
!143 = !DILocalVariable(name: "tmp___log", scope: !137, file: !38, line: 438, type: !144)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 16384, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 2048)
!147 = !DILocation(line: 438, column: 8, scope: !137)
!148 = !DILocalVariable(name: "argv", scope: !137, file: !38, line: 439, type: !149)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !150, line: 52, baseType: !151)
!150 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !152, line: 32, baseType: !153)
!152 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stdarg.h", directory: "")
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 439, baseType: !154)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 192, elements: !161)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 439, size: 192, elements: !156)
!156 = !{!157, !158, !159, !160}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !155, file: !3, line: 439, baseType: !35, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !155, file: !3, line: 439, baseType: !35, size: 32, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !155, file: !3, line: 439, baseType: !58, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !155, file: !3, line: 439, baseType: !58, size: 64, offset: 128)
!161 = !{!162}
!162 = !DISubrange(count: 1)
!163 = !DILocation(line: 439, column: 11, scope: !137)
!164 = !DILocation(line: 440, column: 3, scope: !137)
!165 = !DILocalVariable(name: "len___log", scope: !137, file: !38, line: 441, type: !63)
!166 = !DILocation(line: 441, column: 7, scope: !137)
!167 = !DILocation(line: 441, column: 29, scope: !137)
!168 = !DILocation(line: 441, column: 66, scope: !137)
!169 = !DILocation(line: 441, column: 74, scope: !137)
!170 = !DILocation(line: 441, column: 19, scope: !137)
!171 = !DILocation(line: 442, column: 3, scope: !137)
!172 = !DILocation(line: 443, column: 7, scope: !173)
!173 = distinct !DILexicalBlock(scope: !137, file: !38, line: 443, column: 7)
!174 = !DILocation(line: 443, column: 17, scope: !173)
!175 = !DILocation(line: 443, column: 22, scope: !173)
!176 = !DILocation(line: 443, column: 25, scope: !173)
!177 = !DILocation(line: 443, column: 35, scope: !173)
!178 = !DILocation(line: 443, column: 7, scope: !137)
!179 = !DILocation(line: 444, column: 9, scope: !180)
!180 = distinct !DILexicalBlock(scope: !181, file: !38, line: 444, column: 9)
!181 = distinct !DILexicalBlock(scope: !173, file: !38, line: 443, column: 64)
!182 = !DILocation(line: 444, column: 19, scope: !180)
!183 = !DILocation(line: 444, column: 9, scope: !181)
!184 = !DILocation(line: 445, column: 14, scope: !185)
!185 = distinct !DILexicalBlock(scope: !180, file: !38, line: 444, column: 48)
!186 = !DILocation(line: 445, column: 24, scope: !185)
!187 = !DILocation(line: 445, column: 7, scope: !185)
!188 = !DILocation(line: 447, column: 17, scope: !185)
!189 = !DILocation(line: 448, column: 5, scope: !185)
!190 = !DILocation(line: 449, column: 65, scope: !191)
!191 = distinct !DILexicalBlock(scope: !180, file: !38, line: 448, column: 12)
!192 = !DILocation(line: 449, column: 7, scope: !191)
!193 = !DILocation(line: 450, column: 7, scope: !191)
!194 = !DILocation(line: 452, column: 3, scope: !181)
!195 = !DILocation(line: 453, column: 22, scope: !137)
!196 = !DILocation(line: 453, column: 3, scope: !137)
!197 = !DILocation(line: 453, column: 26, scope: !137)
!198 = !DILocation(line: 454, column: 13, scope: !137)
!199 = !DILocation(line: 454, column: 3, scope: !137)
!200 = !DILocation(line: 454, column: 24, scope: !137)
!201 = !DILocation(line: 455, column: 10, scope: !137)
!202 = !DILocation(line: 455, column: 21, scope: !137)
!203 = !DILocation(line: 455, column: 35, scope: !137)
!204 = !DILocation(line: 455, column: 3, scope: !137)
!205 = !DILocation(line: 456, column: 1, scope: !137)
!206 = distinct !DISubprogram(name: "fiobj_ary_count", scope: !3, file: !3, line: 52, type: !95, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !140)
!207 = !DILocalVariable(name: "ary", arg: 1, scope: !206, file: !3, line: 52, type: !91)
!208 = !DILocation(line: 52, column: 36, scope: !206)
!209 = !DILocation(line: 53, column: 3, scope: !210)
!210 = distinct !DILexicalBlock(scope: !211, file: !3, line: 53, column: 3)
!211 = distinct !DILexicalBlock(scope: !206, file: !3, line: 53, column: 3)
!212 = !DILocation(line: 53, column: 3, scope: !211)
!213 = !DILocation(line: 54, column: 27, scope: !206)
!214 = !DILocation(line: 54, column: 41, scope: !206)
!215 = !DILocation(line: 54, column: 10, scope: !206)
!216 = !DILocation(line: 54, column: 3, scope: !206)
!217 = distinct !DISubprogram(name: "fiobj_type_is", scope: !6, file: !6, line: 269, type: !218, scopeLine: 269, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !140)
!218 = !DISubroutineType(types: !219)
!219 = !{!42, !49, !29}
!220 = !DILocalVariable(name: "o", arg: 1, scope: !217, file: !6, line: 269, type: !49)
!221 = !DILocation(line: 269, column: 39, scope: !217)
!222 = !DILocalVariable(name: "type", arg: 2, scope: !217, file: !6, line: 269, type: !29)
