; ModuleID = 'http1.c'
source_filename = "http1.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.http_vtable_s = type { i32 (%struct.http_s*, i8*, i64)*, i32 (%struct.http_s*, i32, i64, i64)*, i32 (%struct.http_s*, i8*, i64)*, void (%struct.http_s*)*, i32 (%struct.http_s*, i8*, i64, i64)*, i32 (%struct.http_s*, %struct.websocket_settings_s*)*, i32 (%struct.http_s*, i64, i64)*, void (%struct.http_s*, %struct.http_fio_protocol_s*)*, void (%struct.http_s*, %struct.http_fio_protocol_s*)*, i64 (%struct.http_s*, %struct.fio_str_info_s*)*, i32 (%struct.http_s*, %struct.http_sse_s*)*, i32 (%struct.http_sse_s*, i64)*, i32 (%struct.http_sse_s*)* }
%struct.http_s = type { %struct.anon, %struct.timespec, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i8* }
%struct.anon = type { i8*, i64, i64 }
%struct.timespec = type { i64, i64 }
%struct.websocket_settings_s = type { void (%struct.ws_s*, %struct.fio_str_info_s*, i8)*, void (%struct.ws_s*)*, void (%struct.ws_s*)*, void (%struct.ws_s*)*, void (i64, i8*)*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "HTTP1_VTABLE", scope: !2, file: !3, line: 529, type: !231, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !26, globals: !302, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "http1.c", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fio_io_event", file: !6, line: 654, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../include/fio.h", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "FIO_EVENT_ON_DATA", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "FIO_EVENT_ON_READY", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "FIO_EVENT_ON_TIMEOUT", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 50, baseType: !14, size: 8, elements: !15)
!13 = !DIFile(filename: "../include/fiobject.h", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!14 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!16 = !DIEnumerator(name: "FIOBJ_T_NUMBER", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "FIOBJ_T_NULL", value: 6, isUnsigned: true)
!18 = !DIEnumerator(name: "FIOBJ_T_TRUE", value: 22, isUnsigned: true)
!19 = !DIEnumerator(name: "FIOBJ_T_FALSE", value: 38, isUnsigned: true)
!20 = !DIEnumerator(name: "FIOBJ_T_FLOAT", value: 39, isUnsigned: true)
!21 = !DIEnumerator(name: "FIOBJ_T_STRING", value: 40, isUnsigned: true)
!22 = !DIEnumerator(name: "FIOBJ_T_ARRAY", value: 41, isUnsigned: true)
!23 = !DIEnumerator(name: "FIOBJ_T_HASH", value: 42, isUnsigned: true)
!24 = !DIEnumerator(name: "FIOBJ_T_DATA", value: 43, isUnsigned: true)
!25 = !DIEnumerator(name: "FIOBJ_T_UNKNOWN", value: 44, isUnsigned: true)
!26 = !{!27, !28, !163, !45, !165, !166, !84, !86, !167, !168, !176, !110, !204, !210, !238, !150, !61, !47, !146, !299}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "http1pr_s", file: !3, line: 32, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "http1pr_s", file: !3, line: 21, size: 2048, elements: !31)
!31 = !{!32, !135, !152, !153, !154, !155, !156, !157, !158, !159}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !30, file: !3, line: 22, baseType: !33, size: 512)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "http_fio_protocol_s", file: !34, line: 25, baseType: !35)
!34 = !DIFile(filename: "../include/http_internal.h", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "http_fio_protocol_s", file: !34, line: 61, size: 512, elements: !36)
!36 = !{!37, !64, !65}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !35, file: !34, line: 62, baseType: !38, size: 384)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_protocol_s", file: !6, line: 544, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fio_protocol_s", file: !6, line: 561, size: 384, elements: !40)
!40 = !{!41, !49, !50, !58, !59, !60}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "on_data", scope: !39, file: !6, line: 563, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !45, !48}
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !46, line: 87, baseType: !47)
!46 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!47 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "on_ready", scope: !39, file: !6, line: 565, baseType: !42, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "on_shutdown", scope: !39, file: !6, line: 584, baseType: !51, size: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!54, !45, !48}
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !55, line: 24, baseType: !56)
!55 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !57, line: 38, baseType: !14)
!57 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!58 = !DIDerivedType(tag: DW_TAG_member, name: "on_close", scope: !39, file: !6, line: 586, baseType: !42, size: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !39, file: !6, line: 588, baseType: !42, size: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "rsv", scope: !39, file: !6, line: 590, baseType: !61, size: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !62, line: 46, baseType: !63)
!62 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!63 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "uuid", scope: !35, file: !34, line: 63, baseType: !45, size: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !35, file: !34, line: 64, baseType: !66, size: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "http_settings_s", file: !68, line: 62, baseType: !69)
!68 = !DIFile(filename: "../include/http.h", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "http_settings_s", file: !68, line: 318, size: 1024, elements: !70)
!70 = !{!71, !106, !112, !113, !118, !119, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "on_request", scope: !69, file: !68, line: 320, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !75}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "http_s", file: !68, line: 121, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 74, size: 1024, elements: !78)
!78 = !{!79, !87, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !77, file: !68, line: 83, baseType: !80, size: 192)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !77, file: !68, line: 76, size: 192, elements: !81)
!81 = !{!82, !83, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "vtbl", scope: !80, file: !68, line: 78, baseType: !27, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !80, file: !68, line: 80, baseType: !84, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !46, line: 90, baseType: !63)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "out_headers", scope: !80, file: !68, line: 82, baseType: !86, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "FIOBJ", file: !13, line: 63, baseType: !84)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "received_at", scope: !77, file: !68, line: 85, baseType: !88, size: 128, offset: 192)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !89, line: 10, size: 128, elements: !90)
!89 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!90 = !{!91, !93}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !88, file: !89, line: 12, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !57, line: 160, baseType: !47)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !88, file: !89, line: 16, baseType: !94, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !57, line: 196, baseType: !47)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !77, file: !68, line: 87, baseType: !86, size: 64, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "status_str", scope: !77, file: !68, line: 89, baseType: !86, size: 64, offset: 384)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !77, file: !68, line: 91, baseType: !86, size: 64, offset: 448)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !77, file: !68, line: 96, baseType: !84, size: 64, offset: 512)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !77, file: !68, line: 98, baseType: !86, size: 64, offset: 576)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !77, file: !68, line: 100, baseType: !86, size: 64, offset: 640)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !77, file: !68, line: 103, baseType: !86, size: 64, offset: 704)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "cookies", scope: !77, file: !68, line: 108, baseType: !86, size: 64, offset: 768)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !77, file: !68, line: 113, baseType: !86, size: 64, offset: 832)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !77, file: !68, line: 118, baseType: !86, size: 64, offset: 896)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "udata", scope: !77, file: !68, line: 120, baseType: !27, size: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "on_upgrade", scope: !69, file: !68, line: 326, baseType: !107, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !75, !110, !61}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "on_response", scope: !69, file: !68, line: 328, baseType: !72, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "on_finish", scope: !69, file: !68, line: 330, baseType: !114, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !117}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "udata", scope: !69, file: !68, line: 332, baseType: !27, size: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "public_folder", scope: !69, file: !68, line: 339, baseType: !120, size: 64, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "public_folder_length", scope: !69, file: !68, line: 343, baseType: !61, size: 64, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "max_header_size", scope: !69, file: !68, line: 353, baseType: !61, size: 64, offset: 448)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "max_body_size", scope: !69, file: !68, line: 359, baseType: !61, size: 64, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "max_clients", scope: !69, file: !68, line: 372, baseType: !45, size: 64, offset: 576)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !69, file: !68, line: 374, baseType: !27, size: 64, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !69, file: !68, line: 376, baseType: !45, size: 64, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !69, file: !68, line: 378, baseType: !45, size: 64, offset: 768)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "reserved3", scope: !69, file: !68, line: 380, baseType: !45, size: 64, offset: 832)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ws_max_msg_size", scope: !69, file: !68, line: 385, baseType: !61, size: 64, offset: 896)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !69, file: !68, line: 393, baseType: !54, size: 8, offset: 960)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "ws_timeout", scope: !69, file: !68, line: 401, baseType: !54, size: 8, offset: 968)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !69, file: !68, line: 403, baseType: !54, size: 8, offset: 976)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "is_client", scope: !69, file: !68, line: 405, baseType: !54, size: 8, offset: 984)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !30, file: !3, line: 23, baseType: !136, size: 256, offset: 512)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "http1_parser_s", file: !137, line: 66, baseType: !138)
!137 = !DIFile(filename: "../include/http1_parser.h", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "http1_parser_s", file: !137, line: 59, size: 256, elements: !139)
!139 = !{!140}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !138, file: !137, line: 65, baseType: !141, size: 256)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "http1_parser_protected_read_only_state_s", file: !137, line: 60, size: 256, elements: !142)
!142 = !{!143, !145, !149, !151}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "content_length", scope: !141, file: !137, line: 61, baseType: !144, size: 64)
!144 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !141, file: !137, line: 62, baseType: !146, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !147, line: 77, baseType: !148)
!147 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !57, line: 193, baseType: !47)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !141, file: !137, line: 63, baseType: !150, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !141, file: !137, line: 64, baseType: !54, size: 8, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !30, file: !3, line: 24, baseType: !76, size: 1024, offset: 768)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !30, file: !3, line: 25, baseType: !84, size: 64, offset: 1792)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "max_header_size", scope: !30, file: !3, line: 26, baseType: !84, size: 64, offset: 1856)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !30, file: !3, line: 27, baseType: !84, size: 64, offset: 1920)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !30, file: !3, line: 28, baseType: !54, size: 8, offset: 1984)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "is_client", scope: !30, file: !3, line: 29, baseType: !54, size: 8, offset: 1992)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !30, file: !3, line: 30, baseType: !54, size: 8, offset: 2000)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !30, file: !3, line: 31, baseType: !160, offset: 2008)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: -1)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !55, line: 27, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !57, line: 45, baseType: !63)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "fiobj_type_enum", file: !13, line: 61, baseType: !12)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "fiobj_object_header_s", file: !13, line: 332, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 327, size: 64, elements: !171)
!171 = !{!172, !173}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !170, file: !13, line: 329, baseType: !165, size: 8)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !170, file: !13, line: 331, baseType: !174, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !55, line: 26, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !57, line: 42, baseType: !7)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "websocket_settings_s", file: !68, line: 546, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 503, size: 384, elements: !179)
!179 = !{!180, !193, !197, !198, !199, !203}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "on_message", scope: !178, file: !68, line: 512, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !184, !187, !54}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "ws_s", file: !68, line: 497, baseType: !186)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "ws_s", file: !68, line: 497, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_str_info_s", file: !6, line: 287, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fio_str_info_s", file: !6, line: 283, size: 192, elements: !189)
!189 = !{!190, !191, !192}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "capa", scope: !188, file: !6, line: 284, baseType: !61, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !188, file: !6, line: 285, baseType: !61, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !188, file: !6, line: 286, baseType: !110, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "on_open", scope: !178, file: !68, line: 518, baseType: !194, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !184}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "on_ready", scope: !178, file: !68, line: 525, baseType: !194, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "on_shutdown", scope: !178, file: !68, line: 531, baseType: !194, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "on_close", scope: !178, file: !68, line: 543, baseType: !200, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !45, !27}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "udata", scope: !178, file: !68, line: 545, baseType: !27, size: 64, offset: 320)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "http1_sse_fio_protocol_s", file: !3, line: 428, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 425, size: 448, elements: !207)
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !206, file: !3, line: 426, baseType: !38, size: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !206, file: !3, line: 427, baseType: !210, size: 64, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "http_sse_internal_s", file: !34, line: 163, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "http_sse_internal_s", file: !34, line: 155, size: 832, elements: !213)
!213 = !{!214, !227, !228, !284, !285, !295, !298}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !212, file: !34, line: 156, baseType: !215, size: 320)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "http_sse_s", file: !68, line: 604, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "http_sse_s", file: !68, line: 610, size: 320, elements: !217)
!217 = !{!218, !223, !224, !225, !226}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "on_open", scope: !216, file: !68, line: 615, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !222}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "on_ready", scope: !216, file: !68, line: 622, baseType: !219, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "on_shutdown", scope: !216, file: !68, line: 627, baseType: !219, size: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "on_close", scope: !216, file: !68, line: 635, baseType: !219, size: 64, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "udata", scope: !216, file: !68, line: 637, baseType: !27, size: 64, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "uuid", scope: !212, file: !34, line: 157, baseType: !45, size: 64, offset: 320)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !212, file: !34, line: 158, baseType: !229, size: 64, offset: 384)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "http_vtable_s", file: !34, line: 26, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "http_vtable_s", file: !34, line: 28, size: 832, elements: !232)
!232 = !{!233, !239, !244, !245, !247, !252, !257, !262, !266, !267, !272, !276, !280}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "http_send_body", scope: !231, file: !34, line: 30, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!238, !75, !27, !84}
!238 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "http_sendfile", scope: !231, file: !34, line: 32, baseType: !240, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!238, !75, !238, !84, !84}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "http_stream", scope: !231, file: !34, line: 35, baseType: !234, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "http_finish", scope: !231, file: !34, line: 37, baseType: !246, size: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "http_push_data", scope: !231, file: !34, line: 39, baseType: !248, size: 64, offset: 256)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!238, !75, !27, !84, !86}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "http2websocket", scope: !231, file: !34, line: 42, baseType: !253, size: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!238, !75, !176}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "http_push_file", scope: !231, file: !34, line: 44, baseType: !258, size: 64, offset: 384)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!238, !75, !86, !86}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "http_on_pause", scope: !231, file: !34, line: 46, baseType: !263, size: 64, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !75, !167}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "http_on_resume", scope: !231, file: !34, line: 49, baseType: !263, size: 64, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "http_hijack", scope: !231, file: !34, line: 51, baseType: !268, size: 64, offset: 576)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!45, !75, !271}
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "http_upgrade2sse", scope: !231, file: !34, line: 54, baseType: !273, size: 64, offset: 640)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!238, !75, !222}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "http_sse_write", scope: !231, file: !34, line: 56, baseType: !277, size: 64, offset: 704)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!238, !222, !86}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "http_sse_close", scope: !231, file: !34, line: 58, baseType: !281, size: 64, offset: 768)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!238, !222}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !212, file: !34, line: 159, baseType: !84, size: 64, offset: 448)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "subscriptions", scope: !212, file: !34, line: 160, baseType: !286, size: 192, offset: 512)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_ls_s", file: !6, line: 3141, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fio_ls_s", file: !6, line: 3137, size: 192, elements: !288)
!288 = !{!289, !291, !292}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !287, file: !6, line: 3138, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !287, file: !6, line: 3139, baseType: !290, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !287, file: !6, line: 3140, baseType: !293, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !212, file: !34, line: 161, baseType: !296, size: 8, offset: 704)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_lock_i", file: !6, line: 2060, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !54)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !212, file: !34, line: 162, baseType: !61, size: 64, offset: 768)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!302 = !{!0, !303, !305, !307, !309, !315, !317, !325, !331, !333}
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "FIO_LOG_LEVEL", scope: !2, file: !6, line: 433, type: !238, isLocal: false, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "fio_hash_secret_marker1", scope: !2, file: !6, line: 2433, type: !54, isLocal: false, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "fio_hash_secret_marker2", scope: !2, file: !6, line: 2434, type: !54, isLocal: false, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "connection_hash", scope: !311, file: !3, line: 102, type: !84, isLocal: true, isDefinition: true)
!311 = distinct !DISubprogram(name: "headers2str", scope: !3, file: !3, line: 98, type: !312, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !314)
!312 = !DISubroutineType(types: !313)
!313 = !{!86, !75, !84}
!314 = !{}
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "host_hash", scope: !311, file: !3, line: 157, type: !163, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "status2str", scope: !319, file: !3, line: 834, type: !322, isLocal: true, isDefinition: true)
!319 = distinct !DISubprogram(name: "http1pr_status2str", scope: !3, file: !3, line: 833, type: !320, scopeLine: 833, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !314)
!320 = !DISubroutineType(types: !321)
!321 = !{!187, !84}
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 79104, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 412)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "ws_key_accpt_str", scope: !327, file: !3, line: 325, type: !328, isLocal: true, isDefinition: true)
!327 = distinct !DISubprogram(name: "http1_http2websocket_server", scope: !3, file: !3, line: 323, type: !255, scopeLine: 323, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !314)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 296, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 37)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "sec_version", scope: !327, file: !3, line: 326, type: !84, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "sec_key", scope: !327, file: !3, line: 327, type: !84, isLocal: true, isDefinition: true)
!335 = !{i32 7, !"Dwarf Version", i32 4}
!336 = !{i32 2, !"Debug Info Version", i32 3}
!337 = !{i32 1, !"wchar_size", i32 4}
!338 = !{!"clang version 10.0.0-4ubuntu1 "}
!339 = distinct !DISubprogram(name: "FIO_LOG2STDERR", scope: !6, file: !6, line: 437, type: !340, scopeLine: 437, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !314)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !120, null}
!342 = !DILocalVariable(name: "format", arg: 1, scope: !339, file: !6, line: 437, type: !120)
!343 = !DILocation(line: 437, column: 28, scope: !339)
!344 = !DILocalVariable(name: "tmp___log", scope: !339, file: !6, line: 438, type: !345)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 16384, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 2048)
!348 = !DILocation(line: 438, column: 8, scope: !339)
!349 = !DILocalVariable(name: "argv", scope: !339, file: !6, line: 439, type: !350)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !147, line: 52, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !352, line: 32, baseType: !353)
!352 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stdarg.h", directory: "")
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 439, baseType: !354)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 192, elements: !361)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 439, size: 192, elements: !356)
!356 = !{!357, !358, !359, !360}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !355, file: !3, line: 439, baseType: !7, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !355, file: !3, line: 439, baseType: !7, size: 32, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !355, file: !3, line: 439, baseType: !27, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !355, file: !3, line: 439, baseType: !27, size: 64, offset: 128)
!361 = !{!362}
!362 = !DISubrange(count: 1)
!363 = !DILocation(line: 439, column: 11, scope: !339)
!364 = !DILocation(line: 440, column: 3, scope: !339)
!365 = !DILocalVariable(name: "len___log", scope: !339, file: !6, line: 441, type: !238)
!366 = !DILocation(line: 441, column: 7, scope: !339)
!367 = !DILocation(line: 441, column: 29, scope: !339)
!368 = !DILocation(line: 441, column: 66, scope: !339)
!369 = !DILocation(line: 441, column: 74, scope: !339)
!370 = !DILocation(line: 441, column: 19, scope: !339)
!371 = !DILocation(line: 442, column: 3, scope: !339)
!372 = !DILocation(line: 443, column: 7, scope: !373)
!373 = distinct !DILexicalBlock(scope: !339, file: !6, line: 443, column: 7)
!374 = !DILocation(line: 443, column: 17, scope: !373)
!375 = !DILocation(line: 443, column: 22, scope: !373)
!376 = !DILocation(line: 443, column: 25, scope: !373)
!377 = !DILocation(line: 443, column: 35, scope: !373)
!378 = !DILocation(line: 443, column: 7, scope: !339)
!379 = !DILocation(line: 444, column: 9, scope: !380)
!380 = distinct !DILexicalBlock(scope: !381, file: !6, line: 444, column: 9)
!381 = distinct !DILexicalBlock(scope: !373, file: !6, line: 443, column: 64)
!382 = !DILocation(line: 444, column: 19, scope: !380)
!383 = !DILocation(line: 444, column: 9, scope: !381)
!384 = !DILocation(line: 445, column: 14, scope: !385)
!385 = distinct !DILexicalBlock(scope: !380, file: !6, line: 444, column: 48)
!386 = !DILocation(line: 445, column: 24, scope: !385)
!387 = !DILocation(line: 445, column: 7, scope: !385)
!388 = !DILocation(line: 447, column: 17, scope: !385)
!389 = !DILocation(line: 448, column: 5, scope: !385)
!390 = !DILocation(line: 449, column: 65, scope: !391)
!391 = distinct !DILexicalBlock(scope: !380, file: !6, line: 448, column: 12)
!392 = !DILocation(line: 449, column: 7, scope: !391)
!393 = !DILocation(line: 450, column: 7, scope: !391)
!394 = !DILocation(line: 452, column: 3, scope: !381)
!395 = !DILocation(line: 453, column: 22, scope: !339)
!396 = !DILocation(line: 453, column: 3, scope: !339)
!397 = !DILocation(line: 453, column: 26, scope: !339)
!398 = !DILocation(line: 454, column: 13, scope: !339)
!399 = !DILocation(line: 454, column: 3, scope: !339)
!400 = !DILocation(line: 454, column: 24, scope: !339)
!401 = !DILocation(line: 455, column: 10, scope: !339)
!402 = !DILocation(line: 455, column: 21, scope: !339)
!403 = !DILocation(line: 455, column: 35, scope: !339)
!404 = !DILocation(line: 455, column: 3, scope: !339)
!405 = !DILocation(line: 456, column: 1, scope: !339)
!406 = distinct !DISubprogram(name: "http1_send_body", scope: !3, file: !3, line: 177, type: !236, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !314)
!407 = !DILocalVariable(name: "h", arg: 1, scope: !406, file: !3, line: 177, type: !75)
!408 = !DILocation(line: 177, column: 36, scope: !406)
!409 = !DILocalVariable(name: "data", arg: 2, scope: !406, file: !3, line: 177, type: !27)
!410 = !DILocation(line: 177, column: 45, scope: !406)
!411 = !DILocalVariable(name: "length", arg: 3, scope: !406, file: !3, line: 177, type: !84)
!412 = !DILocation(line: 177, column: 61, scope: !406)
!413 = !DILocalVariable(name: "packet", scope: !406, file: !3, line: 179, type: !86)
!414 = !DILocation(line: 179, column: 9, scope: !406)
!415 = !DILocation(line: 179, column: 30, scope: !406)
!416 = !DILocation(line: 179, column: 33, scope: !406)
!417 = !DILocation(line: 179, column: 18, scope: !406)
!418 = !DILocation(line: 180, column: 8, scope: !419)
!419 = distinct !DILexicalBlock(scope: !406, file: !3, line: 180, column: 7)
!420 = !DILocation(line: 180, column: 7, scope: !406)
!421 = !DILocation(line: 181, column: 24, scope: !422)
!422 = distinct !DILexicalBlock(scope: !419, file: !3, line: 180, column: 16)
!423 = !DILocation(line: 181, column: 5, scope: !422)
!424 = !DILocation(line: 182, column: 5, scope: !422)
!425 = !DILocation(line: 184, column: 19, scope: !406)
!426 = !DILocation(line: 184, column: 27, scope: !406)
!427 = !DILocation(line: 184, column: 33, scope: !406)
!428 = !DILocation(line: 184, column: 3, scope: !406)
!429 = !DILocation(line: 185, column: 20, scope: !406)
!430 = !DILocation(line: 185, column: 34, scope: !406)
!431 = !DILocation(line: 185, column: 36, scope: !406)
!432 = !DILocation(line: 185, column: 43, scope: !406)
!433 = !DILocation(line: 185, column: 3, scope: !406)
!434 = !DILocation(line: 186, column: 22, scope: !406)
!435 = !DILocation(line: 186, column: 3, scope: !406)
!436 = !DILocation(line: 187, column: 3, scope: !406)
!437 = !DILocation(line: 188, column: 1, scope: !406)
!438 = distinct !DISubprogram(name: "http1_sendfile", scope: !3, file: !3, line: 190, type: !242, scopeLine: 191, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !314)
!439 = !DILocalVariable(name: "h", arg: 1, scope: !438, file: !3, line: 190, type: !75)
!440 = !DILocation(line: 190, column: 35, scope: !438)
!441 = !DILocalVariable(name: "fd", arg: 2, scope: !438, file: !3, line: 190, type: !238)
!442 = !DILocation(line: 190, column: 42, scope: !438)
!443 = !DILocalVariable(name: "length", arg: 3, scope: !438, file: !3, line: 190, type: !84)
!444 = !DILocation(line: 190, column: 56, scope: !438)
!445 = !DILocalVariable(name: "offset", arg: 4, scope: !438, file: !3, line: 191, type: !84)
!446 = !DILocation(line: 191, column: 37, scope: !438)
!447 = !DILocalVariable(name: "packet", scope: !438, file: !3, line: 192, type: !86)
!448 = !DILocation(line: 192, column: 9, scope: !438)
!449 = !DILocation(line: 192, column: 30, scope: !438)
!450 = !DILocation(line: 192, column: 18, scope: !438)
!451 = !DILocation(line: 193, column: 8, scope: !452)
!452 = distinct !DILexicalBlock(scope: !438, file: !3, line: 193, column: 7)
!453 = !DILocation(line: 193, column: 7, scope: !438)
!454 = !DILocation(line: 194, column: 11, scope: !455)
!455 = distinct !DILexicalBlock(scope: !452, file: !3, line: 193, column: 16)
!456 = !DILocation(line: 194, column: 5, scope: !455)
!457 = !DILocation(line: 195, column: 24, scope: !455)
!458 = !DILocation(line: 195, column: 5, scope: !455)
!459 = !DILocation(line: 196, column: 5, scope: !455)
!460 = !DILocation(line: 198, column: 7, scope: !461)
!461 = distinct !DILexicalBlock(scope: !438, file: !3, line: 198, column: 7)
!462 = !DILocation(line: 198, column: 14, scope: !461)
!463 = !DILocation(line: 198, column: 7, scope: !438)
!464 = !DILocalVariable(name: "s", scope: !465, file: !3, line: 200, type: !187)
!465 = distinct !DILexicalBlock(scope: !461, file: !3, line: 198, column: 40)
!466 = !DILocation(line: 200, column: 20, scope: !465)
!467 = !DILocation(line: 200, column: 39, scope: !465)
!468 = !DILocation(line: 200, column: 24, scope: !465)
!469 = !DILocation(line: 201, column: 27, scope: !465)
!470 = !DILocation(line: 201, column: 37, scope: !465)
!471 = !DILocation(line: 201, column: 43, scope: !465)
!472 = !DILocation(line: 201, column: 41, scope: !465)
!473 = !DILocation(line: 201, column: 5, scope: !465)
!474 = !DILocation(line: 202, column: 24, scope: !465)
!475 = !DILocation(line: 202, column: 9, scope: !465)
!476 = !DILocalVariable(name: "i", scope: !465, file: !3, line: 203, type: !45)
!477 = !DILocation(line: 203, column: 14, scope: !465)
!478 = !DILocation(line: 203, column: 24, scope: !465)
!479 = !DILocation(line: 203, column: 30, scope: !465)
!480 = !DILocation(line: 203, column: 39, scope: !465)
!481 = !DILocation(line: 203, column: 35, scope: !465)
!482 = !DILocation(line: 203, column: 44, scope: !465)
!483 = !DILocation(line: 203, column: 52, scope: !465)
!484 = !DILocation(line: 203, column: 18, scope: !465)
!485 = !DILocation(line: 204, column: 9, scope: !486)
!486 = distinct !DILexicalBlock(scope: !465, file: !3, line: 204, column: 9)
!487 = !DILocation(line: 204, column: 11, scope: !486)
!488 = !DILocation(line: 204, column: 9, scope: !465)
!489 = !DILocation(line: 205, column: 13, scope: !490)
!490 = distinct !DILexicalBlock(scope: !486, file: !3, line: 204, column: 16)
!491 = !DILocation(line: 205, column: 7, scope: !490)
!492 = !DILocation(line: 206, column: 24, scope: !490)
!493 = !DILocation(line: 206, column: 38, scope: !490)
!494 = !DILocation(line: 206, column: 40, scope: !490)
!495 = !DILocation(line: 206, column: 47, scope: !490)
!496 = !DILocation(line: 206, column: 7, scope: !490)
!497 = !DILocation(line: 207, column: 18, scope: !490)
!498 = !DILocation(line: 207, column: 32, scope: !490)
!499 = !DILocation(line: 207, column: 34, scope: !490)
!500 = !DILocation(line: 207, column: 7, scope: !490)
!501 = !DILocation(line: 208, column: 7, scope: !490)
!502 = !DILocation(line: 210, column: 11, scope: !465)
!503 = !DILocation(line: 210, column: 5, scope: !465)
!504 = !DILocation(line: 211, column: 22, scope: !465)
!505 = !DILocation(line: 211, column: 32, scope: !465)
!506 = !DILocation(line: 211, column: 38, scope: !465)
!507 = !DILocation(line: 211, column: 36, scope: !465)
!508 = !DILocation(line: 211, column: 5, scope: !465)
!509 = !DILocation(line: 212, column: 22, scope: !465)
!510 = !DILocation(line: 212, column: 36, scope: !465)
!511 = !DILocation(line: 212, column: 38, scope: !465)
!512 = !DILocation(line: 212, column: 45, scope: !465)
!513 = !DILocation(line: 212, column: 5, scope: !465)
!514 = !DILocation(line: 213, column: 24, scope: !465)
!515 = !DILocation(line: 213, column: 5, scope: !465)
!516 = !DILocation(line: 214, column: 5, scope: !465)
!517 = !DILocation(line: 216, column: 20, scope: !438)
!518 = !DILocation(line: 216, column: 34, scope: !438)
!519 = !DILocation(line: 216, column: 36, scope: !438)
!520 = !DILocation(line: 216, column: 43, scope: !438)
!521 = !DILocation(line: 216, column: 3, scope: !438)
!522 = !DILocation(line: 217, column: 17, scope: !438)
!523 = !DILocation(line: 217, column: 31, scope: !438)
!524 = !DILocation(line: 217, column: 33, scope: !438)
!525 = !DILocation(line: 217, column: 40, scope: !438)
!526 = !DILocation(line: 217, column: 44, scope: !438)
!527 = !DILocation(line: 217, column: 52, scope: !438)
!528 = !DILocation(line: 217, column: 3, scope: !438)
!529 = !DILocation(line: 218, column: 22, scope: !438)
!530 = !DILocation(line: 218, column: 3, scope: !438)
!531 = !DILocation(line: 219, column: 3, scope: !438)
!532 = !DILocation(line: 220, column: 1, scope: !438)
!533 = distinct !DISubprogram(name: "htt1p_finish", scope: !3, file: !3, line: 223, type: !73, scopeLine: 223, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !314)
!534 = !DILocalVariable(name: "h", arg: 1, scope: !533, file: !3, line: 223, type: !75)
!535 = !DILocation(line: 223, column: 34, scope: !533)
!536 = !DILocalVariable(name: "packet", scope: !533, file: !3, line: 224, type: !86)
!537 = !DILocation(line: 224, column: 9, scope: !533)
!538 = !DILocation(line: 224, column: 30, scope: !533)
!539 = !DILocation(line: 224, column: 18, scope: !533)
!540 = !DILocation(line: 225, column: 7, scope: !541)
!541 = distinct !DILexicalBlock(scope: !533, file: !3, line: 225, column: 7)
!542 = !DILocation(line: 225, column: 7, scope: !533)
!543 = !DILocation(line: 226, column: 22, scope: !541)
!544 = !DILocation(line: 226, column: 36, scope: !541)
!545 = !DILocation(line: 226, column: 38, scope: !541)
!546 = !DILocation(line: 226, column: 45, scope: !541)
!547 = !DILocation(line: 226, column: 5, scope: !541)
!548 = !DILocation(line: 230, column: 22, scope: !533)
!549 = !DILocation(line: 230, column: 3, scope: !533)
!550 = !DILocation(line: 231, column: 1, scope: !533)
!551 = distinct !DISubprogram(name: "http1_push_data", scope: !3, file: !3, line: 233, type: !250, scopeLine: 234, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !314)
!552 = !DILocalVariable(name: "h", arg: 1, scope: !551, file: !3, line: 233, type: !75)
!553 = !DILocation(line: 233, column: 36, scope: !551)
!554 = !DILocalVariable(name: "data", arg: 2, scope: !551, file: !3, line: 233, type: !27)
!555 = !DILocation(line: 233, column: 45, scope: !551)
!556 = !DILocalVariable(name: "length", arg: 3, scope: !551, file: !3, line: 233, type: !84)
!557 = !DILocation(line: 233, column: 61, scope: !551)
!558 = !DILocalVariable(name: "mime_type", arg: 4, scope: !551, file: !3, line: 234, type: !86)
!559 = !DILocation(line: 234, column: 34, scope: !551)
!560 = !DILocation(line: 235, column: 3, scope: !551)
!561 = distinct !DISubprogram(name: "http1_http2websocket", scope: !3, file: !3, line: 409, type: !255, scopeLine: 409, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !314)
!562 = !DILocalVariable(name: "h", arg: 1, scope: !561, file: !3, line: 409, type: !75)
!563 = !DILocation(line: 409, column: 41, scope: !561)
!564 = !DILocalVariable(name: "args", arg: 2, scope: !561, file: !3, line: 409, type: !176)
!565 = !DILocation(line: 409, column: 66, scope: !561)
!566 = !DILocation(line: 410, column: 3, scope: !567)
!567 = distinct !DILexicalBlock(scope: !568, file: !3, line: 410, column: 3)
!568 = distinct !DILexicalBlock(scope: !561, file: !3, line: 410, column: 3)
!569 = !DILocation(line: 410, column: 3, scope: !568)
!570 = !DILocalVariable(name: "p", scope: !561, file: !3, line: 411, type: !28)
!571 = !DILocation(line: 411, column: 14, scope: !561)
!572 = !DILocation(line: 411, column: 18, scope: !561)
!573 = !DILocation(line: 413, column: 7, scope: !574)
!574 = distinct !DILexicalBlock(scope: !561, file: !3, line: 413, column: 7)
!575 = !DILocation(line: 413, column: 10, scope: !574)
!576 = !DILocation(line: 413, column: 20, scope: !574)
!577 = !DILocation(line: 413, column: 7, scope: !561)
!578 = !DILocation(line: 414, column: 40, scope: !579)
!579 = distinct !DILexicalBlock(scope: !574, file: !3, line: 413, column: 26)
!580 = !DILocation(line: 414, column: 43, scope: !579)
!581 = !DILocation(line: 414, column: 12, scope: !579)
!582 = !DILocation(line: 414, column: 5, scope: !579)
!583 = !DILocation(line: 416, column: 38, scope: !561)
!584 = !DILocation(line: 416, column: 41, scope: !561)
!585 = !DILocation(line: 416, column: 10, scope: !561)
!586 = !DILocation(line: 416, column: 3, scope: !561)
!587 = !DILocation(line: 417, column: 1, scope: !561)
!588 = distinct !DISubprogram(name: "http1_push_file", scope: !3, file: !3, line: 242, type: !260, scopeLine: 242, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !314)
!589 = !DILocalVariable(name: "h", arg: 1, scope: !588, file: !3, line: 242, type: !75)
!590 = !DILocation(line: 242, column: 36, scope: !588)
!591 = !DILocalVariable(name: "filename", arg: 2, scope: !588, file: !3, line: 242, type: !86)
!592 = !DILocation(line: 242, column: 45, scope: !588)
!593 = !DILocalVariable(name: "mime_type", arg: 3, scope: !588, file: !3, line: 242, type: !86)
!594 = !DILocation(line: 242, column: 61, scope: !588)
!595 = !DILocation(line: 243, column: 3, scope: !588)
!596 = distinct !DISubprogram(name: "http1_on_pause", scope: !3, file: !3, line: 252, type: !264, scopeLine: 252, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !314)
!597 = !DILocalVariable(name: "h", arg: 1, scope: !596, file: !3, line: 252, type: !75)
!598 = !DILocation(line: 252, column: 36, scope: !596)
!599 = !DILocalVariable(name: "pr", arg: 2, scope: !596, file: !3, line: 252, type: !167)
!600 = !DILocation(line: 252, column: 60, scope: !596)
!601 = !DILocation(line: 253, column: 17, scope: !596)
!602 = !DILocation(line: 253, column: 22, scope: !596)
!603 = !DILocation(line: 253, column: 27, scope: !596)
!604 = !DILocation(line: 254, column: 15, scope: !596)
!605 = !DILocation(line: 254, column: 19, scope: !596)
!606 = !DILocation(line: 254, column: 3, scope: !596)
!607 = !DILocation(line: 255, column: 9, scope: !596)
!608 = !DILocation(line: 256, column: 1, scope: !596)
!609 = distinct !DISubprogram(name: "http1_on_resume", scope: !3, file: !3, line: 261, type: !264, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !314)
!610 = !DILocalVariable(name: "h", arg: 1, scope: !609, file: !3, line: 261, type: !75)
!611 = !DILocation(line: 261, column: 37, scope: !609)
!612 = !DILocalVariable(name: "pr", arg: 2, scope: !609, file: !3, line: 261, type: !167)
!613 = !DILocation(line: 261, column: 61, scope: !609)
!614 = !DILocation(line: 262, column: 22, scope: !615)
!615 = distinct !DILexicalBlock(scope: !609, file: !3, line: 262, column: 7)
!616 = !DILocation(line: 262, column: 27, scope: !615)
!617 = !DILocation(line: 262, column: 8, scope: !615)
!618 = !DILocation(line: 262, column: 7, scope: !609)
!619 = !DILocation(line: 263, column: 21, scope: !620)
!620 = distinct !DILexicalBlock(scope: !615, file: !3, line: 262, column: 33)
!621 = !DILocation(line: 263, column: 25, scope: !620)
!622 = !DILocation(line: 263, column: 5, scope: !620)
!623 = !DILocation(line: 264, column: 3, scope: !620)
!624 = !DILocation(line: 265, column: 9, scope: !609)
!625 = !DILocation(line: 266, column: 1, scope: !609)
!626 = distinct !DISubprogram(name: "http1_hijack", scope: !3, file: !3, line: 268, type: !269, scopeLine: 268, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !314)
!627 = !DILocalVariable(name: "h", arg: 1, scope: !626, file: !3, line: 268, type: !75)
!628 = !DILocation(line: 268, column: 38, scope: !626)
!629 = !DILocalVariable(name: "leftover", arg: 2, scope: !626, file: !3, line: 268, type: !271)
!630 = !DILocation(line: 268, column: 57, scope: !626)
!631 = !DILocation(line: 269, column: 7, scope: !632)
!632 = distinct !DILexicalBlock(scope: !626, file: !3, line: 269, column: 7)
!633 = !DILocation(line: 269, column: 7, scope: !626)
!634 = !DILocalVariable(name: "len", scope: !635, file: !3, line: 270, type: !45)
!635 = distinct !DILexicalBlock(scope: !632, file: !3, line: 269, column: 17)
!636 = !DILocation(line: 270, column: 14, scope: !635)
!637 = !DILocation(line: 271, column: 9, scope: !635)
!638 = !DILocation(line: 271, column: 23, scope: !635)
!639 = !DILocation(line: 272, column: 20, scope: !635)
!640 = !DILocation(line: 272, column: 34, scope: !635)
!641 = !DILocation(line: 272, column: 41, scope: !635)
!642 = !DILocation(line: 272, column: 47, scope: !635)
!643 = !DILocation(line: 272, column: 54, scope: !635)
!644 = !DILocation(line: 272, column: 68, scope: !635)
!645 = !DILocation(line: 272, column: 52, scope: !635)
!646 = !DILocation(line: 271, column: 31, scope: !635)
!647 = !DILocation(line: 273, column: 9, scope: !648)
!648 = distinct !DILexicalBlock(scope: !635, file: !3, line: 273, column: 9)
!649 = !DILocation(line: 273, column: 9, scope: !635)
!650 = !DILocation(line: 274, column: 8, scope: !651)
!651 = distinct !DILexicalBlock(scope: !648, file: !3, line: 273, column: 14)
!652 = !DILocation(line: 274, column: 35, scope: !651)
!653 = !DILocation(line: 275, column: 18, scope: !651)
!654 = !DILocation(line: 275, column: 39, scope: !651)
!655 = !DILocation(line: 275, column: 53, scope: !651)
!656 = !DILocation(line: 275, column: 60, scope: !651)
!657 = !DILocation(line: 275, column: 66, scope: !651)
!658 = !DILocation(line: 274, column: 19, scope: !651)
!659 = !DILocation(line: 276, column: 5, scope: !651)
!660 = !DILocation(line: 277, column: 8, scope: !661)
!661 = distinct !DILexicalBlock(scope: !648, file: !3, line: 276, column: 12)
!662 = !DILocation(line: 277, column: 35, scope: !661)
!663 = !DILocation(line: 277, column: 19, scope: !661)
!664 = !DILocation(line: 279, column: 3, scope: !635)
!665 = !DILocation(line: 281, column: 3, scope: !626)
!666 = !DILocation(line: 281, column: 17, scope: !626)
!667 = !DILocation(line: 281, column: 22, scope: !626)
!668 = !DILocalVariable(name: "uuid", scope: !626, file: !3, line: 282, type: !45)
!669 = !DILocation(line: 282, column: 12, scope: !626)
!670 = !DILocation(line: 282, column: 19, scope: !626)
!671 = !DILocation(line: 282, column: 33, scope: !626)
!672 = !DILocation(line: 282, column: 35, scope: !626)
!673 = !DILocation(line: 283, column: 14, scope: !626)
!674 = !DILocation(line: 283, column: 3, scope: !626)
!675 = !DILocation(line: 284, column: 10, scope: !626)
!676 = !DILocation(line: 284, column: 3, scope: !626)
!677 = distinct !DISubprogram(name: "http1_upgrade2sse", scope: !3, file: !3, line: 463, type: !274, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !314)
!678 = !DILocalVariable(name: "h", arg: 1, scope: !677, file: !3, line: 463, type: !75)
!679 = !DILocation(line: 463, column: 38, scope: !677)
!680 = !DILocalVariable(name: "sse", arg: 2, scope: !677, file: !3, line: 463, type: !222)
!681 = !DILocation(line: 463, column: 53, scope: !677)
!682 = !DILocalVariable(name: "uuid", scope: !677, file: !3, line: 464, type: !683)
!683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!684 = !DILocation(line: 464, column: 18, scope: !677)
!685 = !DILocation(line: 464, column: 25, scope: !677)
!686 = !DILocation(line: 464, column: 39, scope: !677)
!687 = !DILocation(line: 464, column: 41, scope: !677)
!688 = !DILocation(line: 466, column: 3, scope: !677)
!689 = !DILocation(line: 466, column: 6, scope: !677)
!690 = !DILocation(line: 466, column: 13, scope: !677)
!691 = !DILocation(line: 467, column: 19, scope: !677)
!692 = !DILocation(line: 467, column: 22, scope: !677)
!693 = !DILocation(line: 467, column: 58, scope: !677)
!694 = !DILocation(line: 467, column: 48, scope: !677)
!695 = !DILocation(line: 467, column: 3, scope: !677)
!696 = !DILocation(line: 468, column: 19, scope: !677)
!697 = !DILocation(line: 468, column: 22, scope: !677)
!698 = !DILocation(line: 469, column: 29, scope: !677)
!699 = !DILocation(line: 469, column: 19, scope: !677)
!700 = !DILocation(line: 468, column: 3, scope: !677)
!701 = !DILocation(line: 470, column: 19, scope: !677)
!702 = !DILocation(line: 470, column: 22, scope: !677)
!703 = !DILocation(line: 471, column: 19, scope: !677)
!704 = !DILocation(line: 470, column: 3, scope: !677)
!705 = !DILocation(line: 472, column: 3, scope: !677)
!706 = !DILocation(line: 472, column: 17, scope: !677)
!707 = !DILocation(line: 472, column: 22, scope: !677)
!708 = !DILocation(line: 473, column: 16, scope: !677)
!709 = !DILocation(line: 473, column: 3, scope: !677)
!710 = !DILocalVariable(name: "sse_pr", scope: !677, file: !3, line: 476, type: !204)
!711 = !DILocation(line: 476, column: 29, scope: !677)
!712 = !DILocation(line: 476, column: 38, scope: !677)
!713 = !DILocation(line: 477, column: 8, scope: !714)
!714 = distinct !DILexicalBlock(scope: !715, file: !3, line: 477, column: 7)
!715 = !DILexicalBlockFile(scope: !677, file: !3, discriminator: 0)
!716 = !DILocation(line: 477, column: 7, scope: !715)
!717 = !DILocation(line: 478, column: 5, scope: !714)
!718 = !DILocation(line: 479, column: 4, scope: !715)
!719 = !DILocation(line: 479, column: 39, scope: !715)
!720 = !DILocation(line: 481, column: 11, scope: !715)
!721 = !DILocation(line: 487, column: 14, scope: !715)
!722 = !DILocation(line: 479, column: 13, scope: !715)
!723 = !DILocation(line: 490, column: 8, scope: !724)
!724 = distinct !DILexicalBlock(scope: !715, file: !3, line: 490, column: 7)
!725 = !DILocation(line: 490, column: 16, scope: !724)
!726 = !DILocation(line: 490, column: 7, scope: !715)
!727 = !DILocation(line: 491, column: 5, scope: !724)
!728 = !DILocation(line: 493, column: 17, scope: !715)
!729 = !DILocation(line: 493, column: 25, scope: !715)
!730 = !DILocation(line: 493, column: 30, scope: !715)
!731 = !DILocation(line: 493, column: 51, scope: !715)
!732 = !DILocation(line: 493, column: 3, scope: !715)
!733 = !DILocation(line: 494, column: 19, scope: !715)
!734 = !DILocation(line: 494, column: 25, scope: !715)
!735 = !DILocation(line: 494, column: 39, scope: !715)
!736 = !DILocation(line: 494, column: 41, scope: !715)
!737 = !DILocation(line: 494, column: 51, scope: !715)
!738 = !DILocation(line: 494, column: 3, scope: !715)
!739 = !DILocation(line: 495, column: 7, scope: !740)
!740 = distinct !DILexicalBlock(scope: !715, file: !3, line: 495, column: 7)
!741 = !DILocation(line: 495, column: 12, scope: !740)
!742 = !DILocation(line: 495, column: 7, scope: !715)
!743 = !DILocation(line: 496, column: 5, scope: !740)
!744 = !DILocation(line: 496, column: 10, scope: !740)
!745 = !DILocation(line: 496, column: 19, scope: !740)
!746 = !DILocation(line: 496, column: 27, scope: !740)
!747 = !DILocation(line: 496, column: 32, scope: !740)
!748 = !DILocation(line: 497, column: 14, scope: !715)
!749 = !DILocation(line: 497, column: 21, scope: !715)
!750 = !DILocation(line: 497, column: 29, scope: !715)
!751 = !DILocation(line: 497, column: 3, scope: !715)
!752 = !DILocation(line: 498, column: 3, scope: !715)
!753 = !DILabel(scope: !715, name: "failed", file: !3, line: 500)
!754 = !DILocation(line: 500, column: 1, scope: !715)
!755 = !DILocation(line: 501, column: 13, scope: !715)
!756 = !DILocation(line: 501, column: 27, scope: !715)
!757 = !DILocation(line: 501, column: 29, scope: !715)
!758 = !DILocation(line: 501, column: 3, scope: !715)
!759 = !DILocation(line: 502, column: 7, scope: !760)
!760 = distinct !DILexicalBlock(scope: !715, file: !3, line: 502, column: 7)
!761 = !DILocation(line: 502, column: 12, scope: !760)
!762 = !DILocation(line: 502, column: 7, scope: !715)
!763 = !DILocation(line: 503, column: 5, scope: !760)
!764 = !DILocation(line: 503, column: 10, scope: !760)
!765 = !DILocation(line: 503, column: 19, scope: !760)
!766 = !DILocation(line: 504, column: 3, scope: !715)
!767 = !DILocation(line: 506, column: 1, scope: !715)
!768 = distinct !DISubprogram(name: "http1_sse_write", scope: !3, file: !3, line: 514, type: !278, scopeLine: 514, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !314)
!769 = !DILocalVariable(name: "sse", arg: 1, scope: !768, file: !3, line: 514, type: !222)
!770 = !DILocation(line: 514, column: 40, scope: !768)
!771 = !DILocalVariable(name: "str", arg: 2, scope: !768, file: !3, line: 514, type: !86)
!772 = !DILocation(line: 514, column: 51, scope: !768)
!773 = !DILocation(line: 515, column: 50, scope: !768)
!774 = !DILocation(line: 515, column: 56, scope: !768)
!775 = !DILocation(line: 515, column: 62, scope: !768)
!776 = !DILocation(line: 515, column: 10, scope: !768)
!777 = !DILocation(line: 515, column: 3, scope: !768)
!778 = distinct !DISubprogram(name: "http1_sse_close", scope: !3, file: !3, line: 521, type: !282, scopeLine: 521, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !314)
!779 = !DILocalVariable(name: "sse", arg: 1, scope: !778, file: !3, line: 521, type: !222)
!780 = !DILocation(line: 521, column: 40, scope: !778)
!781 = !DILocation(line: 522, column: 37, scope: !778)
!782 = !DILocation(line: 522, column: 43, scope: !778)
!783 = !DILocation(line: 522, column: 3, scope: !778)
!784 = !DILocation(line: 523, column: 3, scope: !778)
!785 = distinct !DISubprogram(name: "http1_vtable", scope: !3, file: !3, line: 544, type: !786, scopeLine: 544, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !314)
!786 = !DISubroutineType(types: !787)
!787 = !{!27}
!788 = !DILocation(line: 544, column: 28, scope: !785)
!789 = distinct !DISubprogram(name: "http1_new", scope: !3, file: !3, line: 784, type: !790, scopeLine: 785, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !314)
!790 = !DISubroutineType(types: !791)
!791 = !{!48, !84, !66, !27, !61}
!792 = !DILocalVariable(name: "uuid", arg: 1, scope: !789, file: !3, line: 784, type: !84)
!793 = !DILocation(line: 784, column: 37, scope: !789)
!794 = !DILocalVariable(name: "settings", arg: 2, scope: !789, file: !3, line: 784, type: !66)
!795 = !DILocation(line: 784, column: 60, scope: !789)
!796 = !DILocalVariable(name: "unread_data", arg: 3, scope: !789, file: !3, line: 785, type: !27)
!797 = !DILocation(line: 785, column: 33, scope: !789)
!798 = !DILocalVariable(name: "unread_length", arg: 4, scope: !789, file: !3, line: 785, type: !61)
!799 = !DILocation(line: 785, column: 53, scope: !789)
!800 = !DILocation(line: 786, column: 7, scope: !801)
!801 = distinct !DILexicalBlock(scope: !789, file: !3, line: 786, column: 7)
!802 = !DILocation(line: 786, column: 19, scope: !801)
!803 = !DILocation(line: 786, column: 22, scope: !801)
!804 = !DILocation(line: 786, column: 36, scope: !801)
!805 = !DILocation(line: 786, column: 7, scope: !789)
!806 = !DILocation(line: 787, column: 5, scope: !801)
!807 = !DILocalVariable(name: "p", scope: !789, file: !3, line: 788, type: !28)
!808 = !DILocation(line: 788, column: 14, scope: !789)
!809 = !DILocation(line: 788, column: 18, scope: !789)
!810 = !DILocation(line: 790, column: 3, scope: !811)
!811 = distinct !DILexicalBlock(scope: !812, file: !3, line: 790, column: 3)
!812 = !DILexicalBlockFile(scope: !789, file: !3, discriminator: 0)
!813 = !DILocation(line: 790, column: 3, scope: !812)
!814 = !DILocation(line: 790, column: 3, scope: !815)
!815 = distinct !DILexicalBlock(scope: !811, file: !3, line: 790, column: 3)
!816 = !DILocation(line: 790, column: 3, scope: !817)
!817 = distinct !DILexicalBlock(scope: !818, file: !3, line: 790, column: 3)
!818 = distinct !DILexicalBlock(scope: !815, file: !3, line: 790, column: 3)
!819 = !DILocation(line: 790, column: 3, scope: !818)
!820 = !DILocation(line: 790, column: 3, scope: !821)
!821 = distinct !DILexicalBlock(scope: !817, file: !3, line: 790, column: 3)
!822 = !DILocation(line: 791, column: 4, scope: !812)
!823 = !DILocation(line: 791, column: 8, scope: !812)
!824 = !DILocation(line: 791, column: 19, scope: !812)
!825 = !DILocation(line: 792, column: 9, scope: !812)
!826 = !DILocation(line: 793, column: 11, scope: !812)
!827 = !DILocation(line: 798, column: 17, scope: !812)
!828 = !DILocation(line: 799, column: 21, scope: !812)
!829 = !DILocation(line: 800, column: 26, scope: !812)
!830 = !DILocation(line: 800, column: 36, scope: !812)
!831 = !DILocation(line: 801, column: 20, scope: !812)
!832 = !DILocation(line: 801, column: 30, scope: !812)
!833 = !DILocation(line: 803, column: 15, scope: !812)
!834 = !DILocation(line: 803, column: 18, scope: !812)
!835 = !DILocation(line: 803, column: 28, scope: !812)
!836 = !DILocation(line: 803, column: 31, scope: !812)
!837 = !DILocation(line: 803, column: 3, scope: !812)
!838 = !DILocation(line: 804, column: 7, scope: !839)
!839 = distinct !DILexicalBlock(scope: !812, file: !3, line: 804, column: 7)
!840 = !DILocation(line: 804, column: 19, scope: !839)
!841 = !DILocation(line: 804, column: 22, scope: !839)
!842 = !DILocation(line: 804, column: 36, scope: !839)
!843 = !DILocation(line: 804, column: 7, scope: !812)
!844 = !DILocation(line: 805, column: 12, scope: !845)
!845 = distinct !DILexicalBlock(scope: !839, file: !3, line: 804, column: 63)
!846 = !DILocation(line: 805, column: 15, scope: !845)
!847 = !DILocation(line: 805, column: 5, scope: !845)
!848 = !DILocation(line: 805, column: 20, scope: !845)
!849 = !DILocation(line: 805, column: 33, scope: !845)
!850 = !DILocation(line: 806, column: 18, scope: !845)
!851 = !DILocation(line: 806, column: 5, scope: !845)
!852 = !DILocation(line: 806, column: 8, scope: !845)
!853 = !DILocation(line: 806, column: 16, scope: !845)
!854 = !DILocation(line: 807, column: 3, scope: !845)
!855 = !DILocation(line: 808, column: 14, scope: !812)
!856 = !DILocation(line: 808, column: 21, scope: !812)
!857 = !DILocation(line: 808, column: 24, scope: !812)
!858 = !DILocation(line: 808, column: 26, scope: !812)
!859 = !DILocation(line: 808, column: 3, scope: !812)
!860 = !DILocation(line: 809, column: 7, scope: !861)
!861 = distinct !DILexicalBlock(scope: !812, file: !3, line: 809, column: 7)
!862 = !DILocation(line: 809, column: 19, scope: !861)
!863 = !DILocation(line: 809, column: 22, scope: !861)
!864 = !DILocation(line: 809, column: 36, scope: !861)
!865 = !DILocation(line: 809, column: 7, scope: !812)
!866 = !DILocation(line: 810, column: 21, scope: !867)
!867 = distinct !DILexicalBlock(scope: !861, file: !3, line: 809, column: 63)
!868 = !DILocation(line: 810, column: 5, scope: !867)
!869 = !DILocation(line: 811, column: 3, scope: !867)
!870 = !DILocation(line: 812, column: 11, scope: !812)
!871 = !DILocation(line: 812, column: 14, scope: !812)
!872 = !DILocation(line: 812, column: 16, scope: !812)
!873 = !DILocation(line: 812, column: 3, scope: !812)
!874 = !DILocation(line: 813, column: 1, scope: !812)
!875 = distinct !DISubprogram(name: "http1_on_data_first_time", scope: !3, file: !3, line: 756, type: !43, scopeLine: 756, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !314)
!876 = !DILocalVariable(name: "uuid", arg: 1, scope: !875, file: !3, line: 756, type: !45)
!877 = !DILocation(line: 756, column: 47, scope: !875)
!878 = !DILocalVariable(name: "protocol", arg: 2, scope: !875, file: !3, line: 756, type: !48)
!879 = !DILocation(line: 756, column: 69, scope: !875)
!880 = !DILocalVariable(name: "p", scope: !875, file: !3, line: 757, type: !28)
!881 = !DILocation(line: 757, column: 14, scope: !875)
!882 = !DILocation(line: 757, column: 31, scope: !875)
!883 = !DILocation(line: 757, column: 18, scope: !875)
!884 = !DILocalVariable(name: "i", scope: !875, file: !3, line: 758, type: !146)
!885 = !DILocation(line: 758, column: 11, scope: !875)
!886 = !DILocation(line: 760, column: 16, scope: !875)
!887 = !DILocation(line: 760, column: 22, scope: !875)
!888 = !DILocation(line: 760, column: 25, scope: !875)
!889 = !DILocation(line: 760, column: 31, scope: !875)
!890 = !DILocation(line: 760, column: 34, scope: !875)
!891 = !DILocation(line: 760, column: 29, scope: !875)
!892 = !DILocation(line: 760, column: 68, scope: !875)
!893 = !DILocation(line: 760, column: 71, scope: !875)
!894 = !DILocation(line: 760, column: 66, scope: !875)
!895 = !DILocation(line: 760, column: 7, scope: !875)
!896 = !DILocation(line: 760, column: 5, scope: !875)
!897 = !DILocation(line: 762, column: 7, scope: !898)
!898 = distinct !DILexicalBlock(scope: !875, file: !3, line: 762, column: 7)
!899 = !DILocation(line: 762, column: 9, scope: !898)
!900 = !DILocation(line: 762, column: 7, scope: !875)
!901 = !DILocation(line: 763, column: 5, scope: !898)
!902 = !DILocation(line: 764, column: 17, scope: !875)
!903 = !DILocation(line: 764, column: 3, scope: !875)
!904 = !DILocation(line: 764, column: 6, scope: !875)
!905 = !DILocation(line: 764, column: 14, scope: !875)
!906 = !DILocation(line: 767, column: 3, scope: !875)
!907 = !DILocation(line: 767, column: 6, scope: !875)
!908 = !DILocation(line: 767, column: 8, scope: !875)
!909 = !DILocation(line: 767, column: 17, scope: !875)
!910 = !DILocation(line: 767, column: 25, scope: !875)
!911 = !DILocation(line: 768, column: 7, scope: !912)
!912 = distinct !DILexicalBlock(scope: !875, file: !3, line: 768, column: 7)
!913 = !DILocation(line: 768, column: 9, scope: !912)
!914 = !DILocation(line: 768, column: 15, scope: !912)
!915 = !DILocation(line: 768, column: 26, scope: !912)
!916 = !DILocation(line: 768, column: 29, scope: !912)
!917 = !DILocation(line: 768, column: 19, scope: !912)
!918 = !DILocation(line: 768, column: 7, scope: !875)
!919 = !DILocation(line: 769, column: 5, scope: !920)
!920 = distinct !DILexicalBlock(scope: !912, file: !3, line: 768, column: 75)
!921 = !DILocation(line: 769, column: 5, scope: !922)
!922 = distinct !DILexicalBlock(scope: !923, file: !3, line: 769, column: 5)
!923 = distinct !DILexicalBlock(scope: !920, file: !3, line: 769, column: 5)
!924 = !DILocation(line: 769, column: 5, scope: !923)
!925 = !DILocation(line: 769, column: 5, scope: !926)
!926 = distinct !DILexicalBlock(scope: !922, file: !3, line: 769, column: 5)
!927 = !DILocation(line: 770, column: 15, scope: !920)
!928 = !DILocation(line: 770, column: 5, scope: !920)
!929 = !DILocation(line: 771, column: 5, scope: !920)
!930 = !DILocation(line: 775, column: 22, scope: !875)
!931 = !DILocation(line: 775, column: 28, scope: !875)
!932 = !DILocation(line: 775, column: 3, scope: !875)
!933 = !DILocation(line: 776, column: 1, scope: !875)
!934 = distinct !DISubprogram(name: "http1_on_ready", scope: !3, file: !3, line: 745, type: !43, scopeLine: 745, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !314)
!935 = !DILocalVariable(name: "uuid", arg: 1, scope: !934, file: !3, line: 745, type: !45)
!936 = !DILocation(line: 745, column: 37, scope: !934)
!937 = !DILocalVariable(name: "protocol", arg: 2, scope: !934, file: !3, line: 745, type: !48)
!938 = !DILocation(line: 745, column: 59, scope: !934)
!939 = !DILocalVariable(name: "p", scope: !934, file: !3, line: 747, type: !28)
!940 = !DILocation(line: 747, column: 14, scope: !934)
!941 = !DILocation(line: 747, column: 31, scope: !934)
!942 = !DILocation(line: 747, column: 18, scope: !934)
!943 = !DILocation(line: 748, column: 7, scope: !944)
!944 = distinct !DILexicalBlock(scope: !934, file: !3, line: 748, column: 7)
!945 = !DILocation(line: 748, column: 10, scope: !944)
!946 = !DILocation(line: 748, column: 15, scope: !944)
!947 = !DILocation(line: 748, column: 7, scope: !934)
!948 = !DILocation(line: 749, column: 5, scope: !949)
!949 = distinct !DILexicalBlock(scope: !944, file: !3, line: 748, column: 20)
!950 = !DILocation(line: 749, column: 8, scope: !949)
!951 = !DILocation(line: 749, column: 13, scope: !949)
!952 = !DILocation(line: 750, column: 21, scope: !949)
!953 = !DILocation(line: 750, column: 5, scope: !949)
!954 = !DILocation(line: 751, column: 3, scope: !949)
!955 = !DILocation(line: 752, column: 9, scope: !934)
!956 = !DILocation(line: 753, column: 1, scope: !934)
!957 = distinct !DISubprogram(name: "http1_on_close", scope: !3, file: !3, line: 739, type: !43, scopeLine: 739, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !314)
!958 = !DILocalVariable(name: "uuid", arg: 1, scope: !957, file: !3, line: 739, type: !45)
!959 = !DILocation(line: 739, column: 37, scope: !957)
!960 = !DILocalVariable(name: "protocol", arg: 2, scope: !957, file: !3, line: 739, type: !48)
!961 = !DILocation(line: 739, column: 59, scope: !957)
!962 = !DILocation(line: 740, column: 17, scope: !957)
!963 = !DILocation(line: 740, column: 3, scope: !957)
!964 = !DILocation(line: 741, column: 9, scope: !957)
!965 = !DILocation(line: 742, column: 1, scope: !957)
!966 = distinct !DISubprogram(name: "http_s_new", scope: !34, file: !34, line: 93, type: !967, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !314)
!967 = !DISubroutineType(types: !968)
!968 = !{null, !75, !167, !229}
!969 = !DILocalVariable(name: "h", arg: 1, scope: !966, file: !34, line: 93, type: !75)
!970 = !DILocation(line: 93, column: 39, scope: !966)
!971 = !DILocalVariable(name: "owner", arg: 2, scope: !966, file: !34, line: 93, type: !167)
!972 = !DILocation(line: 93, column: 63, scope: !966)
!973 = !DILocalVariable(name: "vtbl", arg: 3, scope: !966, file: !34, line: 94, type: !229)
!974 = !DILocation(line: 94, column: 46, scope: !966)
!975 = !DILocation(line: 95, column: 4, scope: !966)
!976 = !DILocation(line: 95, column: 16, scope: !966)
!977 = !DILocation(line: 97, column: 11, scope: !966)
!978 = !DILocation(line: 98, column: 23, scope: !966)
!979 = !DILocation(line: 99, column: 34, scope: !966)
!980 = !DILocation(line: 99, column: 23, scope: !966)
!981 = !DILocation(line: 100, column: 30, scope: !966)
!982 = !DILocation(line: 103, column: 22, scope: !966)
!983 = !DILocation(line: 102, column: 18, scope: !966)
!984 = !DILocation(line: 95, column: 8, scope: !966)
!985 = !DILocation(line: 106, column: 1, scope: !966)
!986 = distinct !DISubprogram(name: "http1_destroy", scope: !3, file: !3, line: 816, type: !987, scopeLine: 816, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !314)
!987 = !DISubroutineType(types: !988)
!988 = !{null, !48}
!989 = !DILocalVariable(name: "pr", arg: 1, scope: !986, file: !3, line: 816, type: !48)
!990 = !DILocation(line: 816, column: 36, scope: !986)
!991 = !DILocalVariable(name: "p", scope: !986, file: !3, line: 817, type: !28)
!992 = !DILocation(line: 817, column: 14, scope: !986)
!993 = !DILocation(line: 817, column: 31, scope: !986)
!994 = !DILocation(line: 817, column: 18, scope: !986)
!995 = !DILocation(line: 818, column: 3, scope: !986)
!996 = !DILocation(line: 818, column: 22, scope: !986)
!997 = !DILocation(line: 818, column: 29, scope: !986)
!998 = !DILocation(line: 819, column: 19, scope: !986)
!999 = !DILocation(line: 819, column: 3, scope: !986)
!1000 = !DILocation(line: 820, column: 12, scope: !986)
!1001 = !DILocation(line: 820, column: 3, scope: !986)
!1002 = !DILocation(line: 822, column: 1, scope: !986)
!1003 = distinct !DISubprogram(name: "http_s_destroy", scope: !34, file: !34, line: 108, type: !1004, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !314)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{null, !75, !54}
!1006 = !DILocalVariable(name: "h", arg: 1, scope: !1003, file: !34, line: 108, type: !75)
!1007 = !DILocation(line: 108, column: 43, scope: !1003)
!1008 = !DILocalVariable(name: "log", arg: 2, scope: !1003, file: !34, line: 108, type: !54)
!1009 = !DILocation(line: 108, column: 54, scope: !1003)
!1010 = !DILocation(line: 109, column: 7, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1003, file: !34, line: 109, column: 7)
!1012 = !DILocation(line: 109, column: 11, scope: !1011)
!1013 = !DILocation(line: 109, column: 14, scope: !1011)
!1014 = !DILocation(line: 109, column: 17, scope: !1011)
!1015 = !DILocation(line: 109, column: 24, scope: !1011)
!1016 = !DILocation(line: 109, column: 28, scope: !1011)
!1017 = !DILocation(line: 109, column: 31, scope: !1011)
!1018 = !DILocation(line: 109, column: 7, scope: !1003)
!1019 = !DILocation(line: 110, column: 20, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !1011, file: !34, line: 109, column: 43)
!1021 = !DILocation(line: 110, column: 5, scope: !1020)
!1022 = !DILocation(line: 111, column: 3, scope: !1020)
!1023 = !DILocation(line: 112, column: 14, scope: !1003)
!1024 = !DILocation(line: 112, column: 17, scope: !1003)
!1025 = !DILocation(line: 112, column: 3, scope: !1003)
!1026 = !DILocation(line: 113, column: 14, scope: !1003)
!1027 = !DILocation(line: 113, column: 17, scope: !1003)
!1028 = !DILocation(line: 113, column: 3, scope: !1003)
!1029 = !DILocation(line: 114, column: 14, scope: !1003)
!1030 = !DILocation(line: 114, column: 17, scope: !1003)
!1031 = !DILocation(line: 114, column: 30, scope: !1003)
!1032 = !DILocation(line: 114, column: 3, scope: !1003)
!1033 = !DILocation(line: 115, column: 14, scope: !1003)
!1034 = !DILocation(line: 115, column: 17, scope: !1003)
!1035 = !DILocation(line: 115, column: 3, scope: !1003)
!1036 = !DILocation(line: 116, column: 14, scope: !1003)
!1037 = !DILocation(line: 116, column: 17, scope: !1003)
!1038 = !DILocation(line: 116, column: 3, scope: !1003)
!1039 = !DILocation(line: 117, column: 14, scope: !1003)
!1040 = !DILocation(line: 117, column: 17, scope: !1003)
!1041 = !DILocation(line: 117, column: 3, scope: !1003)
!1042 = !DILocation(line: 118, column: 14, scope: !1003)
!1043 = !DILocation(line: 118, column: 17, scope: !1003)
!1044 = !DILocation(line: 118, column: 3, scope: !1003)
!1045 = !DILocation(line: 119, column: 14, scope: !1003)
!1046 = !DILocation(line: 119, column: 17, scope: !1003)
!1047 = !DILocation(line: 119, column: 3, scope: !1003)
!1048 = !DILocation(line: 120, column: 14, scope: !1003)
!1049 = !DILocation(line: 120, column: 17, scope: !1003)
!1050 = !DILocation(line: 120, column: 3, scope: !1003)
!1051 = !DILocation(line: 121, column: 14, scope: !1003)
!1052 = !DILocation(line: 121, column: 17, scope: !1003)
!1053 = !DILocation(line: 121, column: 3, scope: !1003)
!1054 = !DILocation(line: 123, column: 4, scope: !1003)
!1055 = !DILocation(line: 123, column: 8, scope: !1003)
!1056 = !DILocation(line: 123, column: 16, scope: !1003)
!1057 = !DILocation(line: 124, column: 20, scope: !1003)
!1058 = !DILocation(line: 124, column: 28, scope: !1003)
!1059 = !DILocation(line: 124, column: 31, scope: !1003)
!1060 = !DILocation(line: 124, column: 44, scope: !1003)
!1061 = !DILocation(line: 125, column: 28, scope: !1003)
!1062 = !DILocation(line: 125, column: 31, scope: !1003)
!1063 = !DILocation(line: 125, column: 44, scope: !1003)
!1064 = !DILocation(line: 127, column: 1, scope: !1003)
!1065 = !DILocalVariable(name: "h", arg: 1, scope: !311, file: !3, line: 98, type: !75)
!1066 = !DILocation(line: 98, column: 34, scope: !311)
!1067 = !DILocalVariable(name: "padding", arg: 2, scope: !311, file: !3, line: 98, type: !84)
!1068 = !DILocation(line: 98, column: 47, scope: !311)
!1069 = !DILocation(line: 99, column: 8, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !311, file: !3, line: 99, column: 7)
!1071 = !DILocation(line: 99, column: 11, scope: !1070)
!1072 = !DILocation(line: 99, column: 18, scope: !1070)
!1073 = !DILocation(line: 99, column: 23, scope: !1070)
!1074 = !DILocation(line: 99, column: 26, scope: !1070)
!1075 = !DILocation(line: 99, column: 7, scope: !311)
!1076 = !DILocation(line: 100, column: 5, scope: !1070)
!1077 = !DILocation(line: 103, column: 8, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !311, file: !3, line: 103, column: 7)
!1079 = !DILocation(line: 103, column: 7, scope: !311)
!1080 = !DILocation(line: 104, column: 23, scope: !1078)
!1081 = !DILocation(line: 104, column: 21, scope: !1078)
!1082 = !DILocation(line: 104, column: 5, scope: !1078)
!1083 = !DILocalVariable(name: "w", scope: !311, file: !3, line: 106, type: !1084)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "header_writer_s", file: !3, line: 67, size: 192, elements: !1085)
!1085 = !{!1086, !1087, !1088}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1084, file: !3, line: 68, baseType: !86, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1084, file: !3, line: 69, baseType: !86, size: 64, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1084, file: !3, line: 70, baseType: !86, size: 64, offset: 128)
!1089 = !DILocation(line: 106, column: 26, scope: !311)
!1090 = !DILocalVariable(name: "header_length_guess", scope: !1091, file: !3, line: 108, type: !1092)
!1091 = distinct !DILexicalBlock(scope: !311, file: !3, line: 107, column: 3)
!1092 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!1093 = !DILocation(line: 108, column: 21, scope: !1091)
!1094 = !DILocation(line: 109, column: 26, scope: !1091)
!1095 = !DILocation(line: 109, column: 29, scope: !1091)
!1096 = !DILocation(line: 109, column: 42, scope: !1091)
!1097 = !DILocation(line: 109, column: 9, scope: !1091)
!1098 = !DILocation(line: 109, column: 55, scope: !1091)
!1099 = !DILocation(line: 110, column: 28, scope: !1091)
!1100 = !DILocation(line: 110, column: 50, scope: !1091)
!1101 = !DILocation(line: 110, column: 48, scope: !1091)
!1102 = !DILocation(line: 110, column: 14, scope: !1091)
!1103 = !DILocation(line: 110, column: 7, scope: !1091)
!1104 = !DILocation(line: 110, column: 12, scope: !1091)
!1105 = !DILocalVariable(name: "p", scope: !311, file: !3, line: 112, type: !28)
!1106 = !DILocation(line: 112, column: 14, scope: !311)
!1107 = !DILocation(line: 112, column: 18, scope: !311)
!1108 = !DILocation(line: 114, column: 7, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !311, file: !3, line: 114, column: 7)
!1110 = !DILocation(line: 114, column: 10, scope: !1109)
!1111 = !DILocation(line: 114, column: 20, scope: !1109)
!1112 = !DILocation(line: 114, column: 7, scope: !311)
!1113 = !DILocalVariable(name: "t", scope: !1114, file: !3, line: 115, type: !187)
!1114 = distinct !DILexicalBlock(scope: !1109, file: !3, line: 114, column: 26)
!1115 = !DILocation(line: 115, column: 20, scope: !1114)
!1116 = !DILocation(line: 115, column: 43, scope: !1114)
!1117 = !DILocation(line: 115, column: 46, scope: !1114)
!1118 = !DILocation(line: 115, column: 24, scope: !1114)
!1119 = !DILocation(line: 116, column: 23, scope: !1114)
!1120 = !DILocation(line: 116, column: 31, scope: !1114)
!1121 = !DILocation(line: 116, column: 39, scope: !1114)
!1122 = !DILocation(line: 116, column: 5, scope: !1114)
!1123 = !DILocalVariable(name: "tmp", scope: !1114, file: !3, line: 117, type: !86)
!1124 = !DILocation(line: 117, column: 11, scope: !1114)
!1125 = !DILocation(line: 117, column: 33, scope: !1114)
!1126 = !DILocation(line: 117, column: 36, scope: !1114)
!1127 = !DILocation(line: 117, column: 49, scope: !1114)
!1128 = !DILocation(line: 117, column: 62, scope: !1114)
!1129 = !DILocation(line: 117, column: 17, scope: !1114)
!1130 = !DILocation(line: 118, column: 9, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1114, file: !3, line: 118, column: 9)
!1132 = !DILocation(line: 118, column: 9, scope: !1114)
!1133 = !DILocation(line: 119, column: 26, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1131, file: !3, line: 118, column: 14)
!1135 = !DILocation(line: 119, column: 11, scope: !1134)
!1136 = !DILocation(line: 120, column: 13, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1134, file: !3, line: 120, column: 11)
!1138 = !DILocation(line: 120, column: 11, scope: !1137)
!1139 = !DILocation(line: 120, column: 21, scope: !1137)
!1140 = !DILocation(line: 120, column: 28, scope: !1137)
!1141 = !DILocation(line: 120, column: 33, scope: !1137)
!1142 = !DILocation(line: 120, column: 31, scope: !1137)
!1143 = !DILocation(line: 120, column: 41, scope: !1137)
!1144 = !DILocation(line: 120, column: 11, scope: !1134)
!1145 = !DILocation(line: 121, column: 9, scope: !1137)
!1146 = !DILocation(line: 121, column: 12, scope: !1137)
!1147 = !DILocation(line: 121, column: 18, scope: !1137)
!1148 = !DILocation(line: 122, column: 5, scope: !1134)
!1149 = !DILocation(line: 123, column: 29, scope: !1150)
!1150 = distinct !DILexicalBlock(scope: !1131, file: !3, line: 122, column: 12)
!1151 = !DILocation(line: 123, column: 32, scope: !1150)
!1152 = !DILocation(line: 123, column: 41, scope: !1150)
!1153 = !DILocation(line: 123, column: 13, scope: !1150)
!1154 = !DILocation(line: 123, column: 11, scope: !1150)
!1155 = !DILocation(line: 124, column: 11, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1150, file: !3, line: 124, column: 11)
!1157 = !DILocation(line: 124, column: 11, scope: !1150)
!1158 = !DILocation(line: 125, column: 28, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !1156, file: !3, line: 124, column: 16)
!1160 = !DILocation(line: 125, column: 13, scope: !1159)
!1161 = !DILocation(line: 126, column: 16, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1159, file: !3, line: 126, column: 13)
!1163 = !DILocation(line: 126, column: 14, scope: !1162)
!1164 = !DILocation(line: 126, column: 21, scope: !1162)
!1165 = !DILocation(line: 126, column: 27, scope: !1162)
!1166 = !DILocation(line: 126, column: 25, scope: !1162)
!1167 = !DILocation(line: 126, column: 31, scope: !1162)
!1168 = !DILocation(line: 126, column: 36, scope: !1162)
!1169 = !DILocation(line: 126, column: 34, scope: !1162)
!1170 = !DILocation(line: 126, column: 44, scope: !1162)
!1171 = !DILocation(line: 126, column: 51, scope: !1162)
!1172 = !DILocation(line: 126, column: 56, scope: !1162)
!1173 = !DILocation(line: 126, column: 54, scope: !1162)
!1174 = !DILocation(line: 126, column: 64, scope: !1162)
!1175 = !DILocation(line: 126, column: 13, scope: !1159)
!1176 = !DILocation(line: 127, column: 29, scope: !1162)
!1177 = !DILocation(line: 127, column: 11, scope: !1162)
!1178 = !DILocation(line: 129, column: 29, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1162, file: !3, line: 128, column: 14)
!1180 = !DILocation(line: 129, column: 11, scope: !1179)
!1181 = !DILocation(line: 130, column: 11, scope: !1179)
!1182 = !DILocation(line: 130, column: 14, scope: !1179)
!1183 = !DILocation(line: 130, column: 20, scope: !1179)
!1184 = !DILocation(line: 132, column: 7, scope: !1159)
!1185 = !DILocation(line: 133, column: 28, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1156, file: !3, line: 132, column: 14)
!1187 = !DILocation(line: 133, column: 31, scope: !1186)
!1188 = !DILocation(line: 133, column: 13, scope: !1186)
!1189 = !DILocation(line: 134, column: 14, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !1186, file: !3, line: 134, column: 13)
!1191 = !DILocation(line: 134, column: 17, scope: !1190)
!1192 = !DILocation(line: 134, column: 23, scope: !1190)
!1193 = !DILocation(line: 134, column: 28, scope: !1190)
!1194 = !DILocation(line: 134, column: 32, scope: !1190)
!1195 = !DILocation(line: 134, column: 36, scope: !1190)
!1196 = !DILocation(line: 134, column: 41, scope: !1190)
!1197 = !DILocation(line: 134, column: 39, scope: !1190)
!1198 = !DILocation(line: 134, column: 46, scope: !1190)
!1199 = !DILocation(line: 134, column: 51, scope: !1190)
!1200 = !DILocation(line: 134, column: 49, scope: !1190)
!1201 = !DILocation(line: 134, column: 59, scope: !1190)
!1202 = !DILocation(line: 134, column: 66, scope: !1190)
!1203 = !DILocation(line: 135, column: 15, scope: !1190)
!1204 = !DILocation(line: 135, column: 13, scope: !1190)
!1205 = !DILocation(line: 135, column: 23, scope: !1190)
!1206 = !DILocation(line: 135, column: 30, scope: !1190)
!1207 = !DILocation(line: 135, column: 35, scope: !1190)
!1208 = !DILocation(line: 135, column: 33, scope: !1190)
!1209 = !DILocation(line: 135, column: 43, scope: !1190)
!1210 = !DILocation(line: 134, column: 13, scope: !1186)
!1211 = !DILocation(line: 136, column: 29, scope: !1190)
!1212 = !DILocation(line: 136, column: 11, scope: !1190)
!1213 = !DILocation(line: 138, column: 29, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1190, file: !3, line: 137, column: 14)
!1215 = !DILocation(line: 138, column: 11, scope: !1214)
!1216 = !DILocation(line: 139, column: 11, scope: !1214)
!1217 = !DILocation(line: 139, column: 14, scope: !1214)
!1218 = !DILocation(line: 139, column: 20, scope: !1214)
!1219 = !DILocation(line: 143, column: 3, scope: !1114)
!1220 = !DILocation(line: 144, column: 9, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !1222, file: !3, line: 144, column: 9)
!1222 = distinct !DILexicalBlock(scope: !1109, file: !3, line: 143, column: 10)
!1223 = !DILocation(line: 144, column: 12, scope: !1221)
!1224 = !DILocation(line: 144, column: 9, scope: !1222)
!1225 = !DILocation(line: 145, column: 7, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !1221, file: !3, line: 144, column: 20)
!1227 = !DILocation(line: 146, column: 25, scope: !1226)
!1228 = !DILocation(line: 146, column: 7, scope: !1226)
!1229 = !DILocation(line: 147, column: 5, scope: !1226)
!1230 = !DILocation(line: 148, column: 25, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1221, file: !3, line: 147, column: 12)
!1232 = !DILocation(line: 148, column: 7, scope: !1231)
!1233 = !DILocation(line: 150, column: 5, scope: !1222)
!1234 = !DILocation(line: 151, column: 9, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1222, file: !3, line: 151, column: 9)
!1236 = !DILocation(line: 151, column: 12, scope: !1235)
!1237 = !DILocation(line: 151, column: 9, scope: !1222)
!1238 = !DILocation(line: 152, column: 25, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !1235, file: !3, line: 151, column: 19)
!1240 = !DILocation(line: 152, column: 7, scope: !1239)
!1241 = !DILocation(line: 153, column: 7, scope: !1239)
!1242 = !DILocation(line: 154, column: 5, scope: !1239)
!1243 = !DILocation(line: 155, column: 23, scope: !1222)
!1244 = !DILocation(line: 155, column: 5, scope: !1222)
!1245 = !DILocation(line: 158, column: 10, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !1222, file: !3, line: 158, column: 9)
!1247 = !DILocation(line: 158, column: 9, scope: !1222)
!1248 = !DILocation(line: 159, column: 19, scope: !1246)
!1249 = !DILocation(line: 159, column: 17, scope: !1246)
!1250 = !DILocation(line: 159, column: 7, scope: !1246)
!1251 = !DILocalVariable(name: "tmp", scope: !1222, file: !3, line: 160, type: !86)
!1252 = !DILocation(line: 160, column: 11, scope: !1222)
!1253 = !DILocation(line: 161, column: 26, scope: !1254)
!1254 = distinct !DILexicalBlock(scope: !1222, file: !3, line: 161, column: 9)
!1255 = !DILocation(line: 161, column: 29, scope: !1254)
!1256 = !DILocation(line: 161, column: 42, scope: !1254)
!1257 = !DILocation(line: 161, column: 55, scope: !1254)
!1258 = !DILocation(line: 161, column: 10, scope: !1254)
!1259 = !DILocation(line: 161, column: 66, scope: !1254)
!1260 = !DILocation(line: 162, column: 32, scope: !1254)
!1261 = !DILocation(line: 162, column: 35, scope: !1254)
!1262 = !DILocation(line: 162, column: 44, scope: !1254)
!1263 = !DILocation(line: 162, column: 16, scope: !1254)
!1264 = !DILocation(line: 162, column: 14, scope: !1254)
!1265 = !DILocation(line: 161, column: 9, scope: !1222)
!1266 = !DILocation(line: 163, column: 25, scope: !1267)
!1267 = distinct !DILexicalBlock(scope: !1254, file: !3, line: 162, column: 57)
!1268 = !DILocation(line: 163, column: 7, scope: !1267)
!1269 = !DILocation(line: 164, column: 7, scope: !1267)
!1270 = !DILocation(line: 165, column: 25, scope: !1267)
!1271 = !DILocation(line: 165, column: 7, scope: !1267)
!1272 = !DILocation(line: 166, column: 5, scope: !1267)
!1273 = !DILocation(line: 167, column: 26, scope: !1274)
!1274 = distinct !DILexicalBlock(scope: !1222, file: !3, line: 167, column: 9)
!1275 = !DILocation(line: 167, column: 29, scope: !1274)
!1276 = !DILocation(line: 167, column: 42, scope: !1274)
!1277 = !DILocation(line: 167, column: 55, scope: !1274)
!1278 = !DILocation(line: 167, column: 10, scope: !1274)
!1279 = !DILocation(line: 167, column: 9, scope: !1222)
!1280 = !DILocation(line: 168, column: 25, scope: !1274)
!1281 = !DILocation(line: 168, column: 7, scope: !1274)
!1282 = !DILocation(line: 171, column: 15, scope: !311)
!1283 = !DILocation(line: 171, column: 18, scope: !311)
!1284 = !DILocation(line: 171, column: 31, scope: !311)
!1285 = !DILocation(line: 171, column: 61, scope: !311)
!1286 = !DILocation(line: 171, column: 3, scope: !311)
!1287 = !DILocation(line: 172, column: 21, scope: !311)
!1288 = !DILocation(line: 172, column: 3, scope: !311)
!1289 = !DILocation(line: 173, column: 12, scope: !311)
!1290 = !DILocation(line: 173, column: 3, scope: !311)
!1291 = !DILocation(line: 174, column: 1, scope: !311)
!1292 = distinct !DISubprogram(name: "http1_after_finish", scope: !3, file: !3, line: 51, type: !73, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !314)
!1293 = !DILocalVariable(name: "h", arg: 1, scope: !1292, file: !3, line: 51, type: !75)
!1294 = !DILocation(line: 51, column: 47, scope: !1292)
!1295 = !DILocalVariable(name: "p", scope: !1292, file: !3, line: 52, type: !28)
!1296 = !DILocation(line: 52, column: 14, scope: !1292)
!1297 = !DILocation(line: 52, column: 18, scope: !1292)
!1298 = !DILocation(line: 53, column: 13, scope: !1292)
!1299 = !DILocation(line: 53, column: 16, scope: !1292)
!1300 = !DILocation(line: 53, column: 21, scope: !1292)
!1301 = !DILocation(line: 53, column: 3, scope: !1292)
!1302 = !DILocation(line: 53, column: 6, scope: !1292)
!1303 = !DILocation(line: 53, column: 11, scope: !1292)
!1304 = !DILocation(line: 54, column: 7, scope: !1305)
!1305 = distinct !DILexicalBlock(scope: !1292, file: !3, line: 54, column: 7)
!1306 = !DILocation(line: 54, column: 13, scope: !1305)
!1307 = !DILocation(line: 54, column: 16, scope: !1305)
!1308 = !DILocation(line: 54, column: 9, scope: !1305)
!1309 = !DILocation(line: 54, column: 7, scope: !1292)
!1310 = !DILocation(line: 55, column: 20, scope: !1311)
!1311 = distinct !DILexicalBlock(scope: !1305, file: !3, line: 54, column: 25)
!1312 = !DILocation(line: 55, column: 5, scope: !1311)
!1313 = !DILocation(line: 56, column: 14, scope: !1311)
!1314 = !DILocation(line: 56, column: 5, scope: !1311)
!1315 = !DILocation(line: 57, column: 3, scope: !1311)
!1316 = !DILocation(line: 58, column: 18, scope: !1317)
!1317 = distinct !DILexicalBlock(scope: !1305, file: !3, line: 57, column: 10)
!1318 = !DILocation(line: 58, column: 21, scope: !1317)
!1319 = !DILocation(line: 58, column: 24, scope: !1317)
!1320 = !DILocation(line: 58, column: 26, scope: !1317)
!1321 = !DILocation(line: 58, column: 36, scope: !1317)
!1322 = !DILocation(line: 58, column: 5, scope: !1317)
!1323 = !DILocation(line: 60, column: 7, scope: !1324)
!1324 = distinct !DILexicalBlock(scope: !1292, file: !3, line: 60, column: 7)
!1325 = !DILocation(line: 60, column: 10, scope: !1324)
!1326 = !DILocation(line: 60, column: 7, scope: !1292)
!1327 = !DILocation(line: 61, column: 15, scope: !1324)
!1328 = !DILocation(line: 61, column: 18, scope: !1324)
!1329 = !DILocation(line: 61, column: 20, scope: !1324)
!1330 = !DILocation(line: 61, column: 5, scope: !1324)
!1331 = !DILocation(line: 62, column: 1, scope: !1292)
!1332 = distinct !DISubprogram(name: "fiobj_send_free", scope: !1333, file: !1333, line: 13, type: !1334, scopeLine: 14, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !314)
!1333 = !DIFile(filename: "../include/fiobj4fio.h", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!1334 = !DISubroutineType(types: !1335)
!1335 = !{!146, !45, !86}
!1336 = !DILocalVariable(name: "uuid", arg: 1, scope: !1332, file: !1333, line: 13, type: !45)
!1337 = !DILocation(line: 13, column: 72, scope: !1332)
!1338 = !DILocalVariable(name: "o", arg: 2, scope: !1332, file: !1333, line: 14, type: !86)
!1339 = !DILocation(line: 14, column: 69, scope: !1332)
!1340 = !DILocalVariable(name: "s", scope: !1332, file: !1333, line: 15, type: !187)
!1341 = !DILocation(line: 15, column: 18, scope: !1332)
!1342 = !DILocation(line: 15, column: 37, scope: !1332)
!1343 = !DILocation(line: 15, column: 22, scope: !1332)
!1344 = !DILocation(line: 16, column: 10, scope: !1332)
!1345 = !DILocation(line: 16, column: 3, scope: !1332)
!1346 = distinct !DISubprogram(name: "fiobj_hash_string", scope: !13, file: !13, line: 560, type: !1347, scopeLine: 560, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !314)
!1347 = !DISubroutineType(types: !1348)
!1348 = !{!163, !293, !61}
!1349 = !DILocalVariable(name: "data", arg: 1, scope: !1346, file: !13, line: 560, type: !293)
!1350 = !DILocation(line: 560, column: 51, scope: !1346)
!1351 = !DILocalVariable(name: "len", arg: 2, scope: !1346, file: !13, line: 560, type: !61)
!1352 = !DILocation(line: 560, column: 64, scope: !1346)
!1353 = !DILocation(line: 561, column: 10, scope: !1346)
!1354 = !DILocation(line: 561, column: 3, scope: !1346)
!1355 = !DILocalVariable(name: "status", arg: 1, scope: !319, file: !3, line: 833, type: !84)
!1356 = !DILocation(line: 833, column: 52, scope: !319)
!1357 = !DILocalVariable(name: "ret", scope: !319, file: !3, line: 900, type: !187)
!1358 = !DILocation(line: 900, column: 18, scope: !319)
!1359 = !DILocation(line: 901, column: 7, scope: !1360)
!1360 = distinct !DILexicalBlock(scope: !319, file: !3, line: 901, column: 7)
!1361 = !DILocation(line: 901, column: 14, scope: !1360)
!1362 = !DILocation(line: 901, column: 21, scope: !1360)
!1363 = !DILocation(line: 902, column: 8, scope: !1360)
!1364 = !DILocation(line: 902, column: 15, scope: !1360)
!1365 = !DILocation(line: 902, column: 22, scope: !1360)
!1366 = !DILocation(line: 901, column: 7, scope: !319)
!1367 = !DILocation(line: 903, column: 22, scope: !1360)
!1368 = !DILocation(line: 903, column: 29, scope: !1360)
!1369 = !DILocation(line: 903, column: 11, scope: !1360)
!1370 = !DILocation(line: 903, column: 5, scope: !1360)
!1371 = !DILocation(line: 904, column: 12, scope: !1372)
!1372 = distinct !DILexicalBlock(scope: !319, file: !3, line: 904, column: 7)
!1373 = !DILocation(line: 904, column: 8, scope: !1372)
!1374 = !DILocation(line: 904, column: 7, scope: !319)
!1375 = !DILocation(line: 905, column: 11, scope: !1376)
!1376 = distinct !DILexicalBlock(scope: !1372, file: !3, line: 904, column: 18)
!1377 = !DILocation(line: 906, column: 3, scope: !1376)
!1378 = !DILocation(line: 907, column: 3, scope: !319)
!1379 = distinct !DISubprogram(name: "fiobj_obj2cstr", scope: !13, file: !13, line: 515, type: !1380, scopeLine: 515, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !314)
!1380 = !DISubroutineType(types: !1381)
!1381 = !{!187, !1382}
!1382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!1383 = !DILocalVariable(name: "o", arg: 1, scope: !1379, file: !13, line: 515, type: !1382)
!1384 = !DILocation(line: 515, column: 54, scope: !1379)
!1385 = !DILocation(line: 516, column: 8, scope: !1386)
