; ModuleID = 'secdesk.c'
source_filename = "secdesk.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.fio_str_info_s = type { i64, i64, i8* }
%struct.fiobj_object_vtable_s = type { i8*, void (i64, void (i64, i8*)*, i8*)*, i64 (i64)*, i64 (i64)*, i64 (i64, i64)*, i64 (i64, i64, i32 (i64, i8*)*, i8*)*, void (%struct.fio_str_info_s*, i64)*, i64 (i64)*, double (i64)* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.http_settings_s = type { void (%struct.http_s*)*, void (%struct.http_s*, i8*, i64)*, void (%struct.http_s*)*, void (%struct.http_settings_s*)*, i8*, i8*, i64, i64, i64, i64, i8*, i64, i64, i64, i64, i8, i8, i8, i8 }
%struct.http_s = type { %struct.anon, %struct.timespec, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i8* }
%struct.anon = type { i8*, i64, i64 }
%struct.timespec = type { i64, i64 }
%struct.fio_start_args = type { i16, i16 }
%struct.secinput = type { i64, i64, i64, i64, i64 }

@.str = private unnamed_addr constant [26 x i8] c"... (warning: truncated).\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "FIO_LOG_LEVEL", scope: !2, file: !31, line: 433, type: !42, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !28, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "secdesk.c", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 50, baseType: !7, size: 8, elements: !8)
!6 = !DIFile(filename: "facilio/include/fiobject.h", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored")
!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!9 = !DIEnumerator(name: "FIOBJ_T_NUMBER", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "FIOBJ_T_NULL", value: 6, isUnsigned: true)
!11 = !DIEnumerator(name: "FIOBJ_T_TRUE", value: 22, isUnsigned: true)
!12 = !DIEnumerator(name: "FIOBJ_T_FALSE", value: 38, isUnsigned: true)
!13 = !DIEnumerator(name: "FIOBJ_T_FLOAT", value: 39, isUnsigned: true)
!14 = !DIEnumerator(name: "FIOBJ_T_STRING", value: 40, isUnsigned: true)
!15 = !DIEnumerator(name: "FIOBJ_T_ARRAY", value: 41, isUnsigned: true)
!16 = !DIEnumerator(name: "FIOBJ_T_HASH", value: 42, isUnsigned: true)
!17 = !DIEnumerator(name: "FIOBJ_T_DATA", value: 43, isUnsigned: true)
!18 = !DIEnumerator(name: "FIOBJ_T_UNKNOWN", value: 44, isUnsigned: true)
!19 = !{!20, !21, !24, !25, !26}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !22, line: 87, baseType: !23)
!22 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!23 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "fiobj_type_enum", file: !6, line: 61, baseType: !5)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !22, line: 90, baseType: !27)
!27 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!28 = !{!0, !29, !36, !38}
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "fio_hash_secret_marker1", scope: !2, file: !31, line: 2433, type: !32, isLocal: false, isDefinition: true)
!31 = !DIFile(filename: "facilio/include/fio.h", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !33, line: 24, baseType: !34)
!33 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !35, line: 38, baseType: !7)
!35 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "fio_hash_secret_marker2", scope: !2, file: !31, line: 2434, type: !32, isLocal: false, isDefinition: true)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "RESPONSE_FORMAT", scope: !2, file: !3, line: 10, type: !40, isLocal: true, isDefinition: true)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!42 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!43 = !{i32 7, !"Dwarf Version", i32 4}
!44 = !{i32 2, !"Debug Info Version", i32 3}
!45 = !{i32 1, !"wchar_size", i32 4}
!46 = !{!"clang version 10.0.0-4ubuntu1 "}
!47 = distinct !DISubprogram(name: "FIO_LOG2STDERR", scope: !31, file: !31, line: 437, type: !48, scopeLine: 437, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !52)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !50, null}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!52 = !{}
!53 = !DILocalVariable(name: "format", arg: 1, scope: !47, file: !31, line: 437, type: !50)
!54 = !DILocation(line: 437, column: 28, scope: !47)
!55 = !DILocalVariable(name: "tmp___log", scope: !47, file: !31, line: 438, type: !56)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 16384, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 2048)
!59 = !DILocation(line: 438, column: 8, scope: !47)
!60 = !DILocalVariable(name: "argv", scope: !47, file: !31, line: 439, type: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !62, line: 52, baseType: !63)
!62 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !64, line: 32, baseType: !65)
!64 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stdarg.h", directory: "")
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 439, baseType: !66)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 192, elements: !74)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 439, size: 192, elements: !68)
!68 = !{!69, !71, !72, !73}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !67, file: !3, line: 439, baseType: !70, size: 32)
!70 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !67, file: !3, line: 439, baseType: !70, size: 32, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !67, file: !3, line: 439, baseType: !20, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !67, file: !3, line: 439, baseType: !20, size: 64, offset: 128)
!74 = !{!75}
!75 = !DISubrange(count: 1)
!76 = !DILocation(line: 439, column: 11, scope: !47)
!77 = !DILocation(line: 440, column: 3, scope: !47)
!78 = !DILocalVariable(name: "len___log", scope: !47, file: !31, line: 441, type: !42)
!79 = !DILocation(line: 441, column: 7, scope: !47)
!80 = !DILocation(line: 441, column: 29, scope: !47)
!81 = !DILocation(line: 441, column: 66, scope: !47)
!82 = !DILocation(line: 441, column: 74, scope: !47)
!83 = !DILocation(line: 441, column: 19, scope: !47)
!84 = !DILocation(line: 442, column: 3, scope: !47)
!85 = !DILocation(line: 443, column: 7, scope: !86)
!86 = distinct !DILexicalBlock(scope: !47, file: !31, line: 443, column: 7)
!87 = !DILocation(line: 443, column: 17, scope: !86)
!88 = !DILocation(line: 443, column: 22, scope: !86)
!89 = !DILocation(line: 443, column: 25, scope: !86)
!90 = !DILocation(line: 443, column: 35, scope: !86)
!91 = !DILocation(line: 443, column: 7, scope: !47)
!92 = !DILocation(line: 444, column: 9, scope: !93)
!93 = distinct !DILexicalBlock(scope: !94, file: !31, line: 444, column: 9)
!94 = distinct !DILexicalBlock(scope: !86, file: !31, line: 443, column: 64)
!95 = !DILocation(line: 444, column: 19, scope: !93)
!96 = !DILocation(line: 444, column: 9, scope: !94)
!97 = !DILocation(line: 445, column: 14, scope: !98)
!98 = distinct !DILexicalBlock(scope: !93, file: !31, line: 444, column: 48)
!99 = !DILocation(line: 445, column: 24, scope: !98)
!100 = !DILocation(line: 445, column: 7, scope: !98)
!101 = !DILocation(line: 447, column: 17, scope: !98)
!102 = !DILocation(line: 448, column: 5, scope: !98)
!103 = !DILocation(line: 449, column: 65, scope: !104)
!104 = distinct !DILexicalBlock(scope: !93, file: !31, line: 448, column: 12)
!105 = !DILocation(line: 449, column: 7, scope: !104)
!106 = !DILocation(line: 450, column: 7, scope: !104)
!107 = !DILocation(line: 452, column: 3, scope: !94)
!108 = !DILocation(line: 453, column: 22, scope: !47)
!109 = !DILocation(line: 453, column: 3, scope: !47)
!110 = !DILocation(line: 453, column: 26, scope: !47)
!111 = !DILocation(line: 454, column: 13, scope: !47)
!112 = !DILocation(line: 454, column: 3, scope: !47)
!113 = !DILocation(line: 454, column: 24, scope: !47)
!114 = !DILocation(line: 455, column: 10, scope: !47)
!115 = !DILocation(line: 455, column: 21, scope: !47)
!116 = !DILocation(line: 455, column: 35, scope: !47)
!117 = !DILocation(line: 455, column: 3, scope: !47)
!118 = !DILocation(line: 456, column: 1, scope: !47)
!119 = distinct !DISubprogram(name: "run_secdesk_service", scope: !3, file: !3, line: 149, type: !120, scopeLine: 149, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !52)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !42, !122}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!123 = !DILocalVariable(name: "argc", arg: 1, scope: !119, file: !3, line: 149, type: !42)
!124 = !DILocation(line: 149, column: 30, scope: !119)
!125 = !DILocalVariable(name: "argv", arg: 2, scope: !119, file: !3, line: 149, type: !122)
!126 = !DILocation(line: 149, column: 48, scope: !119)
!127 = !DILocation(line: 151, column: 18, scope: !119)
!128 = !DILocation(line: 151, column: 24, scope: !119)
!129 = !DILocation(line: 151, column: 3, scope: !119)
!130 = !DILocation(line: 152, column: 7, scope: !131)
!131 = distinct !DILexicalBlock(scope: !119, file: !3, line: 152, column: 7)
!132 = !DILocation(line: 157, column: 60, scope: !131)
!133 = !DILocation(line: 152, column: 7, scope: !119)
!134 = !DILocation(line: 158, column: 5, scope: !135)
!135 = distinct !DILexicalBlock(scope: !131, file: !3, line: 157, column: 67)
!136 = !DILocation(line: 159, column: 5, scope: !135)
!137 = !DILocalVariable(name: "d", scope: !119, file: !3, line: 162, type: !50)
!138 = !DILocation(line: 162, column: 15, scope: !119)
!139 = !DILocation(line: 162, column: 19, scope: !119)
!140 = !DILocation(line: 163, column: 18, scope: !119)
!141 = !DILocation(line: 163, column: 3, scope: !119)
!142 = !DILocation(line: 164, column: 3, scope: !119)
!143 = !DILocation(line: 165, column: 3, scope: !119)
!144 = !DILocation(line: 166, column: 3, scope: !119)
!145 = !DILocation(line: 167, column: 3, scope: !119)
!146 = !DILocation(line: 168, column: 3, scope: !119)
!147 = !DILocation(line: 169, column: 3, scope: !119)
!148 = !DILocation(line: 170, column: 3, scope: !119)
!149 = !DILocation(line: 171, column: 1, scope: !119)
!150 = distinct !DISubprogram(name: "initialize_cli", scope: !3, file: !3, line: 13, type: !120, scopeLine: 13, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !52)
!151 = !DILocalVariable(name: "argc", arg: 1, scope: !150, file: !3, line: 13, type: !42)
!152 = !DILocation(line: 13, column: 32, scope: !150)
!153 = !DILocalVariable(name: "argv", arg: 2, scope: !150, file: !3, line: 13, type: !122)
!154 = !DILocation(line: 13, column: 50, scope: !150)
!155 = !DILocation(line: 14, column: 3, scope: !150)
!156 = !DILocation(line: 30, column: 8, scope: !157)
!157 = distinct !DILexicalBlock(scope: !150, file: !3, line: 30, column: 7)
!158 = !DILocation(line: 30, column: 7, scope: !150)
!159 = !DILocalVariable(name: "tmp", scope: !160, file: !3, line: 31, type: !40)
!160 = distinct !DILexicalBlock(scope: !157, file: !3, line: 30, column: 27)
!161 = !DILocation(line: 31, column: 11, scope: !160)
!162 = !DILocation(line: 31, column: 17, scope: !160)
!163 = !DILocation(line: 32, column: 9, scope: !164)
!164 = distinct !DILexicalBlock(scope: !160, file: !3, line: 32, column: 9)
!165 = !DILocation(line: 32, column: 9, scope: !160)
!166 = !DILocation(line: 33, column: 25, scope: !167)
!167 = distinct !DILexicalBlock(scope: !164, file: !3, line: 32, column: 14)
!168 = !DILocation(line: 33, column: 7, scope: !167)
!169 = !DILocation(line: 34, column: 28, scope: !167)
!170 = !DILocation(line: 34, column: 7, scope: !167)
!171 = !DILocation(line: 35, column: 5, scope: !167)
!172 = !DILocation(line: 36, column: 3, scope: !160)
!173 = !DILocation(line: 37, column: 8, scope: !174)
!174 = distinct !DILexicalBlock(scope: !150, file: !3, line: 37, column: 7)
!175 = !DILocation(line: 37, column: 7, scope: !150)
!176 = !DILocalVariable(name: "tmp", scope: !177, file: !3, line: 38, type: !40)
!177 = distinct !DILexicalBlock(scope: !174, file: !3, line: 37, column: 27)
!178 = !DILocation(line: 38, column: 11, scope: !177)
!179 = !DILocation(line: 38, column: 17, scope: !177)
!180 = !DILocation(line: 39, column: 10, scope: !181)
!181 = distinct !DILexicalBlock(scope: !177, file: !3, line: 39, column: 9)
!182 = !DILocation(line: 39, column: 14, scope: !181)
!183 = !DILocation(line: 39, column: 18, scope: !181)
!184 = !DILocation(line: 39, column: 9, scope: !177)
!185 = !DILocation(line: 39, column: 41, scope: !181)
!186 = !DILocation(line: 39, column: 37, scope: !181)
!187 = !DILocation(line: 40, column: 23, scope: !177)
!188 = !DILocation(line: 40, column: 5, scope: !177)
!189 = !DILocation(line: 41, column: 26, scope: !177)
!190 = !DILocation(line: 41, column: 5, scope: !177)
!191 = !DILocation(line: 42, column: 3, scope: !177)
!192 = !DILocation(line: 43, column: 8, scope: !193)
!193 = distinct !DILexicalBlock(scope: !150, file: !3, line: 43, column: 7)
!194 = !DILocation(line: 43, column: 7, scope: !150)
!195 = !DILocalVariable(name: "tmp", scope: !196, file: !3, line: 44, type: !40)
!196 = distinct !DILexicalBlock(scope: !193, file: !3, line: 43, column: 29)
!197 = !DILocation(line: 44, column: 11, scope: !196)
!198 = !DILocation(line: 44, column: 17, scope: !196)
!199 = !DILocation(line: 45, column: 9, scope: !200)
!200 = distinct !DILexicalBlock(scope: !196, file: !3, line: 45, column: 9)
!201 = !DILocation(line: 45, column: 9, scope: !196)
!202 = !DILocation(line: 46, column: 30, scope: !203)
!203 = distinct !DILexicalBlock(scope: !200, file: !3, line: 45, column: 14)
!204 = !DILocation(line: 46, column: 7, scope: !203)
!205 = !DILocation(line: 47, column: 27, scope: !203)
!206 = !DILocation(line: 47, column: 7, scope: !203)
!207 = !DILocation(line: 48, column: 5, scope: !203)
!208 = !DILocation(line: 49, column: 3, scope: !196)
!209 = !DILocation(line: 50, column: 8, scope: !210)
!210 = distinct !DILexicalBlock(scope: !150, file: !3, line: 50, column: 7)
!211 = !DILocation(line: 50, column: 7, scope: !150)
!212 = !DILocalVariable(name: "tmp", scope: !213, file: !3, line: 51, type: !40)
!213 = distinct !DILexicalBlock(scope: !210, file: !3, line: 50, column: 28)
!214 = !DILocation(line: 51, column: 11, scope: !213)
!215 = !DILocation(line: 51, column: 17, scope: !213)
!216 = !DILocation(line: 52, column: 10, scope: !217)
!217 = distinct !DILexicalBlock(scope: !213, file: !3, line: 52, column: 9)
!218 = !DILocation(line: 52, column: 9, scope: !213)
!219 = !DILocation(line: 52, column: 19, scope: !217)
!220 = !DILocation(line: 52, column: 15, scope: !217)
!221 = !DILocation(line: 53, column: 30, scope: !213)
!222 = !DILocation(line: 53, column: 5, scope: !213)
!223 = !DILocation(line: 54, column: 24, scope: !213)
!224 = !DILocation(line: 54, column: 5, scope: !213)
!225 = !DILocation(line: 55, column: 3, scope: !213)
!226 = !DILocation(line: 56, column: 1, scope: !150)
!227 = distinct !DISubprogram(name: "on_http_request", scope: !3, file: !3, line: 131, type: !228, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !52)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !230}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "http_s", file: !232, line: 121, baseType: !233)
!232 = !DIFile(filename: "facilio/include/http.h", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored")
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !232, line: 74, size: 1024, elements: !234)
!234 = !{!235, !242, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !233, file: !232, line: 83, baseType: !236, size: 192)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !233, file: !232, line: 76, size: 192, elements: !237)
!237 = !{!238, !239, !240}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "vtbl", scope: !236, file: !232, line: 78, baseType: !20, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !236, file: !232, line: 80, baseType: !26, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "out_headers", scope: !236, file: !232, line: 82, baseType: !241, size: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "FIOBJ", file: !6, line: 63, baseType: !26)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "received_at", scope: !233, file: !232, line: 85, baseType: !243, size: 128, offset: 192)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !244, line: 10, size: 128, elements: !245)
!244 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!245 = !{!246, !248}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !243, file: !244, line: 12, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !35, line: 160, baseType: !23)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !243, file: !244, line: 16, baseType: !249, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !35, line: 196, baseType: !23)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !233, file: !232, line: 87, baseType: !241, size: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "status_str", scope: !233, file: !232, line: 89, baseType: !241, size: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !233, file: !232, line: 91, baseType: !241, size: 64, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !233, file: !232, line: 96, baseType: !26, size: 64, offset: 512)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !233, file: !232, line: 98, baseType: !241, size: 64, offset: 576)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !233, file: !232, line: 100, baseType: !241, size: 64, offset: 640)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !233, file: !232, line: 103, baseType: !241, size: 64, offset: 704)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "cookies", scope: !233, file: !232, line: 108, baseType: !241, size: 64, offset: 768)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !233, file: !232, line: 113, baseType: !241, size: 64, offset: 832)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !233, file: !232, line: 118, baseType: !241, size: 64, offset: 896)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "udata", scope: !233, file: !232, line: 120, baseType: !20, size: 64, offset: 960)
!261 = !DILocalVariable(name: "h", arg: 1, scope: !227, file: !3, line: 131, type: !230)
!262 = !DILocation(line: 131, column: 37, scope: !227)
!263 = !DILocation(line: 133, column: 20, scope: !227)
!264 = !DILocation(line: 133, column: 3, scope: !227)
!265 = !DILocation(line: 134, column: 30, scope: !266)
!266 = distinct !DILexicalBlock(scope: !227, file: !3, line: 134, column: 7)
!267 = !DILocation(line: 134, column: 33, scope: !266)
!268 = !DILocation(line: 134, column: 15, scope: !266)
!269 = !DILocation(line: 134, column: 39, scope: !266)
!270 = !DILocation(line: 134, column: 8, scope: !266)
!271 = !DILocation(line: 134, column: 61, scope: !266)
!272 = !DILocation(line: 135, column: 7, scope: !266)
!273 = !DILocation(line: 135, column: 33, scope: !266)
!274 = !DILocation(line: 135, column: 36, scope: !266)
!275 = !DILocation(line: 135, column: 18, scope: !266)
!276 = !DILocation(line: 135, column: 44, scope: !266)
!277 = !DILocation(line: 135, column: 11, scope: !266)
!278 = !DILocation(line: 135, column: 57, scope: !266)
!279 = !DILocation(line: 136, column: 7, scope: !266)
!280 = !DILocation(line: 136, column: 27, scope: !266)
!281 = !DILocation(line: 136, column: 11, scope: !266)
!282 = !DILocation(line: 136, column: 30, scope: !266)
!283 = !DILocation(line: 134, column: 7, scope: !227)
!284 = !DILocation(line: 136, column: 40, scope: !285)
!285 = distinct !DILexicalBlock(scope: !266, file: !3, line: 136, column: 38)
!286 = !DILocation(line: 136, column: 40, scope: !287)
!287 = distinct !DILexicalBlock(scope: !285, file: !3, line: 136, column: 40)
!288 = !DILocalVariable(name: "s", scope: !227, file: !3, line: 137, type: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "secinput", file: !290, line: 14, size: 320, elements: !291)
!290 = !DIFile(filename: "./secdesk.h", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored")
!291 = !{!292, !293, !294, !295, !296}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !289, file: !290, line: 15, baseType: !241, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "mi", scope: !289, file: !290, line: 16, baseType: !241, size: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !289, file: !290, line: 17, baseType: !241, size: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !289, file: !290, line: 18, baseType: !241, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !289, file: !290, line: 19, baseType: !241, size: 64, offset: 256)
!297 = !DILocation(line: 137, column: 19, scope: !227)
!298 = !DILocalVariable(name: "overlayImageFile", scope: !227, file: !3, line: 138, type: !299)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 4096, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 512)
!302 = !DILocation(line: 138, column: 8, scope: !227)
!303 = !DILocation(line: 139, column: 15, scope: !227)
!304 = !DILocation(line: 139, column: 18, scope: !227)
!305 = !DILocation(line: 139, column: 41, scope: !227)
!306 = !DILocation(line: 139, column: 3, scope: !227)
!307 = !DILocalVariable(name: "rsp", scope: !227, file: !3, line: 140, type: !42)
!308 = !DILocation(line: 140, column: 7, scope: !227)
!309 = !DILocation(line: 140, column: 34, scope: !227)
!310 = !DILocation(line: 140, column: 13, scope: !227)
!311 = !DILocalVariable(name: "response", scope: !227, file: !3, line: 141, type: !312)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8192, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 1024)
!315 = !DILocation(line: 141, column: 8, scope: !227)
!316 = !DILocation(line: 142, column: 11, scope: !227)
!317 = !DILocation(line: 142, column: 21, scope: !227)
!318 = !DILocation(line: 142, column: 39, scope: !227)
!319 = !DILocation(line: 142, column: 70, scope: !227)
!320 = !DILocation(line: 142, column: 3, scope: !227)
!321 = !DILocation(line: 143, column: 18, scope: !227)
!322 = !DILocation(line: 143, column: 21, scope: !227)
!323 = !DILocation(line: 143, column: 38, scope: !227)
!324 = !DILocation(line: 143, column: 31, scope: !227)
!325 = !DILocation(line: 143, column: 3, scope: !227)
!326 = !DILabel(scope: !227, name: "cleanup", file: !3, line: 145)
!327 = !DILocation(line: 145, column: 3, scope: !227)
!328 = !DILocation(line: 145, column: 24, scope: !227)
!329 = !DILocation(line: 145, column: 12, scope: !227)
!330 = !DILocation(line: 145, column: 28, scope: !227)
!331 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 173, type: !332, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !52)
!332 = !DISubroutineType(types: !333)
!333 = !{!42, !42, !122}
!334 = !DILocalVariable(name: "argc", arg: 1, scope: !331, file: !3, line: 173, type: !42)
!335 = !DILocation(line: 173, column: 14, scope: !331)
!336 = !DILocalVariable(name: "argv", arg: 2, scope: !331, file: !3, line: 173, type: !122)
!337 = !DILocation(line: 173, column: 33, scope: !331)
!338 = !DILocation(line: 174, column: 23, scope: !331)
!339 = !DILocation(line: 174, column: 29, scope: !331)
!340 = !DILocation(line: 174, column: 3, scope: !331)
!341 = !DILocation(line: 175, column: 3, scope: !331)
!342 = distinct !DISubprogram(name: "fiobj_obj2cstr", scope: !6, file: !6, line: 515, type: !343, scopeLine: 515, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !52)
!343 = !DISubroutineType(types: !344)
!344 = !{!345, !353}
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_str_info_s", file: !31, line: 287, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fio_str_info_s", file: !31, line: 283, size: 192, elements: !347)
!347 = !{!348, !351, !352}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "capa", scope: !346, file: !31, line: 284, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !350, line: 46, baseType: !27)
!350 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!351 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !346, file: !31, line: 285, baseType: !349, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !346, file: !31, line: 286, baseType: !40, size: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !241)
!354 = !DILocalVariable(name: "o", arg: 1, scope: !342, file: !6, line: 515, type: !353)
!355 = !DILocation(line: 515, column: 54, scope: !342)
!356 = !DILocation(line: 516, column: 8, scope: !357)
!357 = distinct !DILexicalBlock(scope: !342, file: !6, line: 516, column: 7)
!358 = !DILocation(line: 516, column: 7, scope: !342)
!359 = !DILocalVariable(name: "ret", scope: !360, file: !6, line: 517, type: !345)
!360 = distinct !DILexicalBlock(scope: !357, file: !6, line: 516, column: 11)
!361 = !DILocation(line: 517, column: 20, scope: !360)
!362 = !DILocation(line: 518, column: 5, scope: !360)
!363 = !DILocation(line: 520, column: 7, scope: !364)
!364 = distinct !DILexicalBlock(scope: !342, file: !6, line: 520, column: 7)
!365 = !DILocation(line: 520, column: 9, scope: !364)
!366 = !DILocation(line: 520, column: 7, scope: !342)
!367 = !DILocation(line: 521, column: 35, scope: !364)
!368 = !DILocation(line: 521, column: 38, scope: !364)
!369 = !DILocation(line: 521, column: 12, scope: !364)
!370 = !DILocation(line: 521, column: 5, scope: !364)
!371 = !DILocation(line: 522, column: 8, scope: !372)
!372 = distinct !DILexicalBlock(scope: !342, file: !6, line: 522, column: 7)
!373 = !DILocation(line: 522, column: 10, scope: !372)
!374 = !DILocation(line: 522, column: 37, scope: !372)
!375 = !DILocation(line: 522, column: 7, scope: !342)
!376 = !DILocation(line: 523, column: 30, scope: !377)
!377 = distinct !DILexicalBlock(scope: !372, file: !6, line: 522, column: 65)
!378 = !DILocation(line: 523, column: 13, scope: !377)
!379 = !DILocation(line: 523, column: 5, scope: !377)
!380 = !DILocalVariable(name: "ret", scope: !381, file: !6, line: 525, type: !345)
!381 = distinct !DILexicalBlock(scope: !382, file: !6, line: 524, column: 24)
!382 = distinct !DILexicalBlock(scope: !377, file: !6, line: 523, column: 33)
!383 = !DILocation(line: 525, column: 22, scope: !381)
!384 = !DILocation(line: 526, column: 7, scope: !381)
!385 = !DILocalVariable(name: "ret", scope: !386, file: !6, line: 529, type: !345)
!386 = distinct !DILexicalBlock(scope: !382, file: !6, line: 528, column: 25)
!387 = !DILocation(line: 529, column: 22, scope: !386)
!388 = !DILocation(line: 530, column: 7, scope: !386)
!389 = !DILocalVariable(name: "ret", scope: !390, file: !6, line: 533, type: !345)
!390 = distinct !DILexicalBlock(scope: !382, file: !6, line: 532, column: 24)
!391 = !DILocation(line: 533, column: 22, scope: !390)
!392 = !DILocation(line: 534, column: 7, scope: !390)
!393 = !DILocation(line: 537, column: 7, scope: !382)
!394 = !DILocation(line: 539, column: 3, scope: !377)
!395 = !DILocation(line: 540, column: 10, scope: !342)
!396 = !DILocation(line: 540, column: 28, scope: !342)
!397 = !DILocation(line: 540, column: 35, scope: !342)
!398 = !DILocation(line: 540, column: 3, scope: !342)
!399 = !DILocation(line: 541, column: 1, scope: !342)
!400 = distinct !DISubprogram(name: "fiobj_each1", scope: !6, file: !6, line: 638, type: !401, scopeLine: 639, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !52)
!401 = !DISubroutineType(types: !402)
!402 = !{!349, !241, !349, !403, !20}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!42, !241, !20}
!406 = !DILocalVariable(name: "o", arg: 1, scope: !400, file: !6, line: 638, type: !241)
!407 = !DILocation(line: 638, column: 37, scope: !400)
!408 = !DILocalVariable(name: "start_at", arg: 2, scope: !400, file: !6, line: 638, type: !349)
!409 = !DILocation(line: 638, column: 47, scope: !400)
!410 = !DILocalVariable(name: "task", arg: 3, scope: !400, file: !6, line: 639, type: !403)
!411 = !DILocation(line: 639, column: 37, scope: !400)
!412 = !DILocalVariable(name: "arg", arg: 4, scope: !400, file: !6, line: 639, type: !20)
!413 = !DILocation(line: 639, column: 72, scope: !400)
!414 = !DILocation(line: 640, column: 7, scope: !415)
!415 = distinct !DILexicalBlock(scope: !400, file: !6, line: 640, column: 7)
!416 = !DILocation(line: 640, column: 29, scope: !415)
!417 = !DILocation(line: 640, column: 32, scope: !415)
!418 = !DILocation(line: 640, column: 50, scope: !415)
!419 = !DILocation(line: 640, column: 7, scope: !400)
!420 = !DILocation(line: 641, column: 12, scope: !415)
!421 = !DILocation(line: 641, column: 30, scope: !415)
!422 = !DILocation(line: 641, column: 35, scope: !415)
!423 = !DILocation(line: 641, column: 38, scope: !415)
!424 = !DILocation(line: 641, column: 48, scope: !415)
!425 = !DILocation(line: 641, column: 54, scope: !415)
!426 = !DILocation(line: 641, column: 5, scope: !415)
!427 = !DILocation(line: 642, column: 3, scope: !400)
!428 = !DILocation(line: 643, column: 1, scope: !400)
!429 = distinct !DISubprogram(name: "get_fields", scope: !3, file: !3, line: 68, type: !404, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !52)
!430 = !DILocalVariable(name: "o", arg: 1, scope: !429, file: !3, line: 68, type: !241)
!431 = !DILocation(line: 68, column: 29, scope: !429)
!432 = !DILocalVariable(name: "arg", arg: 2, scope: !429, file: !3, line: 68, type: !20)
!433 = !DILocation(line: 68, column: 38, scope: !429)
!434 = !DILocalVariable(name: "s", scope: !429, file: !3, line: 69, type: !435)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!436 = !DILocation(line: 69, column: 20, scope: !429)
!437 = !DILocation(line: 69, column: 24, scope: !429)
!438 = !DILocation(line: 70, column: 7, scope: !439)
!439 = distinct !DILexicalBlock(scope: !429, file: !3, line: 70, column: 7)
!440 = !DILocation(line: 70, column: 7, scope: !429)
!441 = !DILocalVariable(name: "key", scope: !442, file: !3, line: 71, type: !40)
!442 = distinct !DILexicalBlock(scope: !439, file: !3, line: 70, column: 10)
!443 = !DILocation(line: 71, column: 12, scope: !442)
!444 = !DILocation(line: 71, column: 33, scope: !442)
!445 = !DILocation(line: 71, column: 18, scope: !442)
!446 = !DILocation(line: 71, column: 59, scope: !442)
!447 = !DILocation(line: 72, column: 16, scope: !448)
!448 = distinct !DILexicalBlock(scope: !442, file: !3, line: 72, column: 9)
!449 = !DILocation(line: 72, column: 9, scope: !448)
!450 = !DILocation(line: 72, column: 33, scope: !448)
!451 = !DILocation(line: 72, column: 9, scope: !442)
!452 = !DILocation(line: 72, column: 54, scope: !453)
!453 = distinct !DILexicalBlock(scope: !448, file: !3, line: 72, column: 40)
!454 = !DILocation(line: 72, column: 70, scope: !453)
!455 = !DILocation(line: 72, column: 42, scope: !453)
!456 = !DILocation(line: 72, column: 76, scope: !453)
!457 = !DILocation(line: 73, column: 21, scope: !458)
!458 = distinct !DILexicalBlock(scope: !448, file: !3, line: 73, column: 14)
!459 = !DILocation(line: 73, column: 14, scope: !458)
!460 = !DILocation(line: 73, column: 34, scope: !458)
!461 = !DILocation(line: 73, column: 14, scope: !448)
!462 = !DILocation(line: 73, column: 53, scope: !463)
!463 = distinct !DILexicalBlock(scope: !458, file: !3, line: 73, column: 40)
!464 = !DILocation(line: 73, column: 42, scope: !463)
!465 = !DILocation(line: 73, column: 45, scope: !463)
!466 = !DILocation(line: 73, column: 51, scope: !463)
!467 = !DILocation(line: 73, column: 56, scope: !463)
!468 = !DILocation(line: 74, column: 21, scope: !469)
!469 = distinct !DILexicalBlock(scope: !458, file: !3, line: 74, column: 14)
!470 = !DILocation(line: 74, column: 14, scope: !469)
!471 = !DILocation(line: 74, column: 31, scope: !469)
!472 = !DILocation(line: 74, column: 14, scope: !458)
!473 = !DILocation(line: 74, column: 50, scope: !474)
!474 = distinct !DILexicalBlock(scope: !469, file: !3, line: 74, column: 40)
!475 = !DILocation(line: 74, column: 42, scope: !474)
!476 = !DILocation(line: 74, column: 45, scope: !474)
!477 = !DILocation(line: 74, column: 48, scope: !474)
!478 = !DILocation(line: 74, column: 53, scope: !474)
!479 = !DILocation(line: 75, column: 21, scope: !480)
!480 = distinct !DILexicalBlock(scope: !469, file: !3, line: 75, column: 14)
!481 = !DILocation(line: 75, column: 14, scope: !480)
!482 = !DILocation(line: 75, column: 34, scope: !480)
!483 = !DILocation(line: 75, column: 14, scope: !469)
!484 = !DILocation(line: 75, column: 53, scope: !485)
!485 = distinct !DILexicalBlock(scope: !480, file: !3, line: 75, column: 40)
!486 = !DILocation(line: 75, column: 42, scope: !485)
!487 = !DILocation(line: 75, column: 45, scope: !485)
!488 = !DILocation(line: 75, column: 51, scope: !485)
!489 = !DILocation(line: 75, column: 56, scope: !485)
!490 = !DILocation(line: 76, column: 3, scope: !442)
!491 = !DILocation(line: 77, column: 3, scope: !429)
!492 = distinct !DISubprogram(name: "process_secinput", scope: !3, file: !3, line: 80, type: !493, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !52)
!493 = !DISubroutineType(types: !494)
!494 = !{!42, !435, !40}
!495 = !DILocalVariable(name: "s", arg: 1, scope: !492, file: !3, line: 80, type: !435)
!496 = !DILocation(line: 80, column: 46, scope: !492)
!497 = !DILocalVariable(name: "overlayImageFile", arg: 2, scope: !492, file: !3, line: 80, type: !40)
!498 = !DILocation(line: 80, column: 55, scope: !492)
!499 = !DILocalVariable(name: "tmp", scope: !492, file: !3, line: 81, type: !345)
!500 = !DILocation(line: 81, column: 18, scope: !492)
!501 = !DILocation(line: 81, column: 39, scope: !492)
!502 = !DILocation(line: 81, column: 42, scope: !492)
!503 = !DILocation(line: 81, column: 24, scope: !492)
!504 = !DILocalVariable(name: "filename", scope: !492, file: !3, line: 82, type: !40)
!505 = !DILocation(line: 82, column: 9, scope: !492)
!506 = !DILocation(line: 82, column: 39, scope: !492)
!507 = !DILocation(line: 82, column: 42, scope: !492)
!508 = !DILocation(line: 82, column: 24, scope: !492)
!509 = !DILocation(line: 82, column: 52, scope: !492)
!510 = !DILocalVariable(name: "dir", scope: !492, file: !3, line: 84, type: !511)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 2048, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 256)
!514 = !DILocation(line: 84, column: 8, scope: !492)
!515 = !DILocalVariable(name: "tmpfile", scope: !492, file: !3, line: 84, type: !299)
!516 = !DILocation(line: 84, column: 18, scope: !492)
!517 = !DILocation(line: 85, column: 11, scope: !492)
!518 = !DILocation(line: 85, column: 26, scope: !492)
!519 = !DILocation(line: 85, column: 3, scope: !492)
!520 = !DILocation(line: 86, column: 9, scope: !492)
!521 = !DILocation(line: 86, column: 3, scope: !492)
!522 = !DILocation(line: 87, column: 11, scope: !492)
!523 = !DILocation(line: 87, column: 45, scope: !492)
!524 = !DILocation(line: 87, column: 3, scope: !492)
!525 = !DILocalVariable(name: "fp", scope: !492, file: !3, line: 89, type: !526)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !528, line: 7, baseType: !529)
!528 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !530, line: 49, size: 1728, elements: !531)
!530 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!531 = !{!532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !547, !549, !550, !551, !553, !555, !557, !559, !562, !564, !567, !570, !571, !572, !573, !574}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !529, file: !530, line: 51, baseType: !42, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !529, file: !530, line: 54, baseType: !40, size: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !529, file: !530, line: 55, baseType: !40, size: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !529, file: !530, line: 56, baseType: !40, size: 64, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !529, file: !530, line: 57, baseType: !40, size: 64, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !529, file: !530, line: 58, baseType: !40, size: 64, offset: 320)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !529, file: !530, line: 59, baseType: !40, size: 64, offset: 384)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !529, file: !530, line: 60, baseType: !40, size: 64, offset: 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !529, file: !530, line: 61, baseType: !40, size: 64, offset: 512)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !529, file: !530, line: 64, baseType: !40, size: 64, offset: 576)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !529, file: !530, line: 65, baseType: !40, size: 64, offset: 640)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !529, file: !530, line: 66, baseType: !40, size: 64, offset: 704)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !529, file: !530, line: 68, baseType: !545, size: 64, offset: 768)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !530, line: 36, flags: DIFlagFwdDecl)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !529, file: !530, line: 70, baseType: !548, size: 64, offset: 832)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !529, file: !530, line: 72, baseType: !42, size: 32, offset: 896)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !529, file: !530, line: 73, baseType: !42, size: 32, offset: 928)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !529, file: !530, line: 74, baseType: !552, size: 64, offset: 960)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !35, line: 152, baseType: !23)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !529, file: !530, line: 77, baseType: !554, size: 16, offset: 1024)
!554 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !529, file: !530, line: 78, baseType: !556, size: 8, offset: 1040)
!556 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !529, file: !530, line: 79, baseType: !558, size: 8, offset: 1048)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8, elements: !74)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !529, file: !530, line: 81, baseType: !560, size: 64, offset: 1088)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !530, line: 43, baseType: null)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !529, file: !530, line: 89, baseType: !563, size: 64, offset: 1152)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !35, line: 153, baseType: !23)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !529, file: !530, line: 91, baseType: !565, size: 64, offset: 1216)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !530, line: 37, flags: DIFlagFwdDecl)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !529, file: !530, line: 92, baseType: !568, size: 64, offset: 1280)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !530, line: 38, flags: DIFlagFwdDecl)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !529, file: !530, line: 93, baseType: !548, size: 64, offset: 1344)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !529, file: !530, line: 94, baseType: !20, size: 64, offset: 1408)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !529, file: !530, line: 95, baseType: !349, size: 64, offset: 1472)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !529, file: !530, line: 96, baseType: !42, size: 32, offset: 1536)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !529, file: !530, line: 98, baseType: !575, size: 160, offset: 1568)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 160, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 20)
!578 = !DILocation(line: 89, column: 10, scope: !492)
!579 = !DILocation(line: 89, column: 39, scope: !492)
!580 = !DILocation(line: 89, column: 31, scope: !492)
!581 = !DILocation(line: 89, column: 24, scope: !492)
!582 = !DILocation(line: 90, column: 8, scope: !583)
!583 = distinct !DILexicalBlock(scope: !492, file: !3, line: 90, column: 7)
!584 = !DILocation(line: 90, column: 7, scope: !492)
!585 = !DILocation(line: 90, column: 12, scope: !583)
!586 = !DILocation(line: 91, column: 18, scope: !587)
!587 = distinct !DILexicalBlock(scope: !492, file: !3, line: 91, column: 7)
!588 = !DILocation(line: 91, column: 28, scope: !587)
!589 = !DILocation(line: 91, column: 36, scope: !587)
!590 = !DILocation(line: 91, column: 7, scope: !587)
!591 = !DILocation(line: 91, column: 40, scope: !587)
!592 = !DILocation(line: 91, column: 7, scope: !492)
!593 = !DILocation(line: 92, column: 13, scope: !594)
!594 = distinct !DILexicalBlock(scope: !587, file: !3, line: 91, column: 46)
!595 = !DILocation(line: 92, column: 62, scope: !594)
!596 = !DILocation(line: 92, column: 72, scope: !594)
!597 = !DILocation(line: 92, column: 5, scope: !594)
!598 = !DILocation(line: 93, column: 3, scope: !594)
!599 = !DILocation(line: 94, column: 10, scope: !492)
!600 = !DILocation(line: 94, column: 3, scope: !492)
!601 = !DILocalVariable(name: "tmp2", scope: !492, file: !3, line: 96, type: !602)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 256, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 32)
!605 = !DILocation(line: 96, column: 8, scope: !492)
!606 = !DILocation(line: 97, column: 17, scope: !492)
!607 = !DILocation(line: 97, column: 9, scope: !492)
!608 = !DILocation(line: 97, column: 3, scope: !492)
!609 = !DILocation(line: 98, column: 10, scope: !492)
!610 = !DILocation(line: 98, column: 3, scope: !492)
!611 = !DILocation(line: 99, column: 11, scope: !492)
!612 = !DILocation(line: 99, column: 42, scope: !492)
!613 = !DILocation(line: 99, column: 47, scope: !492)
!614 = !DILocation(line: 99, column: 3, scope: !492)
!615 = !DILocalVariable(name: "f", scope: !492, file: !3, line: 101, type: !40)
!616 = !DILocation(line: 101, column: 9, scope: !492)
!617 = !DILocalVariable(name: "m", scope: !492, file: !3, line: 101, type: !40)
!618 = !DILocation(line: 101, column: 13, scope: !492)
!619 = !DILocalVariable(name: "l", scope: !492, file: !3, line: 101, type: !40)
!620 = !DILocation(line: 101, column: 17, scope: !492)
!621 = !DILocation(line: 102, column: 29, scope: !492)
!622 = !DILocation(line: 102, column: 32, scope: !492)
!623 = !DILocation(line: 102, column: 14, scope: !492)
!624 = !DILocation(line: 102, column: 39, scope: !492)
!625 = !DILocation(line: 102, column: 7, scope: !492)
!626 = !DILocation(line: 102, column: 5, scope: !492)
!627 = !DILocation(line: 103, column: 29, scope: !492)
!628 = !DILocation(line: 103, column: 32, scope: !492)
!629 = !DILocation(line: 103, column: 14, scope: !492)
!630 = !DILocation(line: 103, column: 36, scope: !492)
!631 = !DILocation(line: 103, column: 7, scope: !492)
!632 = !DILocation(line: 103, column: 5, scope: !492)
!633 = !DILocation(line: 104, column: 29, scope: !492)
!634 = !DILocation(line: 104, column: 32, scope: !492)
!635 = !DILocation(line: 104, column: 14, scope: !492)
!636 = !DILocation(line: 104, column: 39, scope: !492)
!637 = !DILocation(line: 104, column: 7, scope: !492)
!638 = !DILocation(line: 104, column: 5, scope: !492)
!639 = !DILocalVariable(name: "embedding", scope: !492, file: !3, line: 107, type: !640)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !641, size: 8192, elements: !642)
!641 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!642 = !{!643}
!643 = !DISubrange(count: 128)
!644 = !DILocation(line: 107, column: 10, scope: !492)
!645 = !DILocation(line: 109, column: 16, scope: !492)
!646 = !DILocation(line: 109, column: 25, scope: !492)
!647 = !DILocation(line: 109, column: 3, scope: !492)
!648 = !DILocalVariable(name: "i", scope: !492, file: !3, line: 112, type: !42)
!649 = !DILocation(line: 112, column: 7, scope: !492)
!650 = !DILocation(line: 114, column: 17, scope: !492)
!651 = !DILocation(line: 114, column: 7, scope: !492)
!652 = !DILocation(line: 114, column: 5, scope: !492)
!653 = !DILocalVariable(name: "j", scope: !492, file: !3, line: 116, type: !42)
!654 = !DILocation(line: 116, column: 7, scope: !492)
!655 = !DILocation(line: 117, column: 14, scope: !492)
!656 = !DILocation(line: 117, column: 16, scope: !492)
!657 = !DILocation(line: 117, column: 18, scope: !492)
!658 = !DILocation(line: 117, column: 7, scope: !492)
!659 = !DILocation(line: 117, column: 5, scope: !492)
!660 = !DILocation(line: 118, column: 8, scope: !492)
!661 = !DILocation(line: 118, column: 3, scope: !492)
!662 = !DILocation(line: 118, column: 17, scope: !492)
!663 = !DILocation(line: 118, column: 12, scope: !492)
!664 = !DILocation(line: 118, column: 26, scope: !492)
!665 = !DILocation(line: 118, column: 21, scope: !492)
!666 = !DILocation(line: 120, column: 11, scope: !492)
!667 = !DILocation(line: 120, column: 20, scope: !492)
!668 = !DILocation(line: 120, column: 38, scope: !492)
!669 = !DILocation(line: 120, column: 3, scope: !492)
!670 = !DILocalVariable(name: "n", scope: !492, file: !3, line: 122, type: !42)
!671 = !DILocation(line: 122, column: 7, scope: !492)
!672 = !DILocation(line: 122, column: 18, scope: !492)
!673 = !DILocation(line: 122, column: 11, scope: !492)
!674 = !DILocation(line: 122, column: 39, scope: !492)
!675 = !DILocalVariable(name: "len", scope: !492, file: !3, line: 123, type: !42)
!676 = !DILocation(line: 123, column: 7, scope: !492)
!677 = !DILocation(line: 123, column: 20, scope: !492)
!678 = !DILocation(line: 123, column: 13, scope: !492)
!679 = !DILocation(line: 124, column: 11, scope: !492)
!680 = !DILocation(line: 124, column: 29, scope: !492)
!681 = !DILocation(line: 124, column: 48, scope: !492)
!682 = !DILocation(line: 124, column: 46, scope: !492)
!683 = !DILocation(line: 124, column: 51, scope: !492)
!684 = !DILocation(line: 124, column: 57, scope: !492)
!685 = !DILocation(line: 124, column: 55, scope: !492)
!686 = !DILocation(line: 124, column: 59, scope: !492)
!687 = !DILocation(line: 124, column: 3, scope: !492)
!688 = !DILocation(line: 126, column: 10, scope: !492)
!689 = !DILocation(line: 126, column: 3, scope: !492)
!690 = !DILocation(line: 128, column: 11, scope: !492)
!691 = !DILocation(line: 128, column: 13, scope: !492)
!692 = !DILocation(line: 128, column: 17, scope: !492)
!693 = !DILocation(line: 128, column: 20, scope: !492)
!694 = !DILocation(line: 128, column: 22, scope: !492)
!695 = !DILocation(line: 128, column: 26, scope: !492)
!696 = !DILocation(line: 128, column: 29, scope: !492)
!697 = !DILocation(line: 128, column: 34, scope: !492)
!698 = !DILocation(line: 128, column: 31, scope: !492)
!699 = !DILocation(line: 0, scope: !492)
!700 = !DILocation(line: 128, column: 10, scope: !492)
!701 = !DILocation(line: 128, column: 3, scope: !492)
!702 = distinct !DISubprogram(name: "fiobj_type_vtable", scope: !6, file: !6, line: 344, type: !703, scopeLine: 344, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !52)
!703 = !DISubroutineType(types: !704)
!704 = !{!705, !241}
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !707)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "fiobj_object_vtable_s", file: !6, line: 325, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 305, size: 576, elements: !709)
!709 = !{!710, !711, !719, !724, !729, !734, !737, !740, !745}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !708, file: !6, line: 307, baseType: !50, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "dealloc", scope: !708, file: !6, line: 309, baseType: !712, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{null, !241, !716, !20}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{null, !241, !20}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !708, file: !6, line: 311, baseType: !720, size: 64, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !721)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!26, !353}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "is_true", scope: !708, file: !6, line: 313, baseType: !725, size: 64, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!349, !353}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "is_eq", scope: !708, file: !6, line: 315, baseType: !730, size: 64, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !731)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!349, !353, !353}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "each", scope: !708, file: !6, line: 317, baseType: !735, size: 64, offset: 320)
!735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !736)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "to_str", scope: !708, file: !6, line: 320, baseType: !738, size: 64, offset: 384)
!738 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "to_i", scope: !708, file: !6, line: 322, baseType: !741, size: 64, offset: 448)
!741 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !742)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!21, !353}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "to_f", scope: !708, file: !6, line: 324, baseType: !746, size: 64, offset: 512)
!746 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!641, !353}
!750 = !DILocalVariable(name: "o", arg: 1, scope: !702, file: !6, line: 344, type: !241)
!751 = !DILocation(line: 344, column: 65, scope: !702)
!752 = !DILocation(line: 345, column: 11, scope: !702)
!753 = !DILocation(line: 345, column: 3, scope: !702)
!754 = !DILocation(line: 347, column: 5, scope: !755)
!755 = distinct !DILexicalBlock(scope: !702, file: !6, line: 345, column: 26)
!756 = !DILocation(line: 349, column: 5, scope: !755)
!757 = !DILocation(line: 351, column: 5, scope: !755)
!758 = !DILocation(line: 353, column: 5, scope: !755)
!759 = !DILocation(line: 355, column: 5, scope: !755)
!760 = !DILocation(line: 357, column: 5, scope: !755)
!761 = !DILocation(line: 362, column: 5, scope: !755)
!762 = !DILocation(line: 364, column: 3, scope: !702)
!763 = !DILocation(line: 365, column: 1, scope: !702)
!764 = distinct !DISubprogram(name: "fiobj_type", scope: !6, file: !6, line: 250, type: !765, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !52)
!765 = !DISubroutineType(types: !766)
!766 = !{!24, !241}
!767 = !DILocalVariable(name: "o", arg: 1, scope: !764, file: !6, line: 250, type: !241)
!768 = !DILocation(line: 250, column: 45, scope: !764)
!769 = !DILocation(line: 251, column: 8, scope: !770)
!770 = distinct !DILexicalBlock(scope: !764, file: !6, line: 251, column: 7)
!771 = !DILocation(line: 251, column: 7, scope: !764)
!772 = !DILocation(line: 252, column: 5, scope: !770)
!773 = !DILocation(line: 253, column: 7, scope: !774)
!774 = distinct !DILexicalBlock(scope: !764, file: !6, line: 253, column: 7)
!775 = !DILocation(line: 253, column: 9, scope: !774)
!776 = !DILocation(line: 253, column: 7, scope: !764)
!777 = !DILocation(line: 254, column: 5, scope: !774)
!778 = !DILocation(line: 255, column: 8, scope: !779)
!779 = distinct !DILexicalBlock(scope: !764, file: !6, line: 255, column: 7)
!780 = !DILocation(line: 255, column: 10, scope: !779)
!781 = !DILocation(line: 255, column: 37, scope: !779)
!782 = !DILocation(line: 255, column: 7, scope: !764)
!783 = !DILocation(line: 256, column: 29, scope: !779)
!784 = !DILocation(line: 256, column: 12, scope: !779)
!785 = !DILocation(line: 256, column: 5, scope: !779)
!786 = !DILocation(line: 258, column: 8, scope: !787)
!787 = distinct !DILexicalBlock(scope: !764, file: !6, line: 257, column: 7)
!788 = !DILocation(line: 258, column: 10, scope: !787)
!789 = !DILocation(line: 258, column: 37, scope: !787)
!790 = !DILocation(line: 257, column: 7, scope: !764)
!791 = !DILocation(line: 259, column: 5, scope: !787)
!792 = !DILocation(line: 260, column: 30, scope: !793)
!793 = distinct !DILexicalBlock(scope: !764, file: !6, line: 260, column: 7)
!794 = !DILocation(line: 260, column: 32, scope: !793)
!795 = !DILocation(line: 260, column: 59, scope: !793)
!796 = !DILocation(line: 260, column: 7, scope: !764)
!797 = !DILocation(line: 261, column: 5, scope: !793)
!798 = !DILocation(line: 262, column: 30, scope: !764)
!799 = !DILocation(line: 262, column: 10, scope: !764)
!800 = !DILocation(line: 262, column: 3, scope: !764)
!801 = !DILocation(line: 263, column: 1, scope: !764)
!802 = distinct !DISubprogram(name: "get_file", scope: !3, file: !3, line: 58, type: !404, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !52)
!803 = !DILocalVariable(name: "o", arg: 1, scope: !802, file: !3, line: 58, type: !241)
!804 = !DILocation(line: 58, column: 27, scope: !802)
!805 = !DILocalVariable(name: "arg", arg: 2, scope: !802, file: !3, line: 58, type: !20)
!806 = !DILocation(line: 58, column: 36, scope: !802)
