; ModuleID = 'websockets.c'
source_filename = "websockets.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.websocket_packet_info_s = type { i64, i8, i8 }
%struct.fio_str_info_s = type { i64, i64, i8* }
%struct.fiobj_object_vtable_s = type { i8*, void (i64, void (i64, i8*)*, i8*)*, i64 (i64)*, i64 (i64)*, i64 (i64, i64)*, i64 (i64, i64, i32 (i64, i8*)*, i8*)*, void (%struct.fio_str_info_s*, i64)*, i64 (i64)*, double (i64)* }
%struct.timespec = type { i64, i64 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.ws_s = type { %struct.fio_protocol_s, i64, void (%struct.ws_s*, %struct.fio_str_info_s*, i8)*, void (%struct.ws_s*)*, void (%struct.ws_s*)*, void (%struct.ws_s*)*, void (i64, i8*)*, i8*, i64, %struct.fio_ls_s, i8, %struct.buffer_s, i64, i64, i8, i8 }
%struct.fio_protocol_s = type { void (i64, %struct.fio_protocol_s*)*, void (i64, %struct.fio_protocol_s*)*, i8 (i64, %struct.fio_protocol_s*)*, void (i64, %struct.fio_protocol_s*)*, void (i64, %struct.fio_protocol_s*)*, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "FIO_LOG_LEVEL", scope: !2, file: !6, line: 433, type: !164, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !31, globals: !158, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "websockets.c", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!4 = !{!5, !12, !26}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fio_io_event", file: !6, line: 654, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../include/fio.h", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "FIO_EVENT_ON_DATA", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "FIO_EVENT_ON_READY", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "FIO_EVENT_ON_TIMEOUT", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 50, baseType: !14, size: 8, elements: !15)
!13 = !DIFile(filename: "../include/fiobject.h", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!14 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!16 = !DIEnumerator(name: "FIOBJ_T_NUMBER", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "FIOBJ_T_NULL", value: 6, isUnsigned: true)
!18 = !DIEnumerator(name: "FIOBJ_T_TRUE", value: 22, isUnsigned: true)
!19 = !DIEnumerator(name: "FIOBJ_T_FALSE", value: 38, isUnsigned: true)
!20 = !DIEnumerator(name: "FIOBJ_T_FLOAT", value: 39, isUnsigned: true)
!21 = !DIEnumerator(name: "FIOBJ_T_STRING", value: 40, isUnsigned: true)
!22 = !DIEnumerator(name: "FIOBJ_T_ARRAY", value: 41, isUnsigned: true)
!23 = !DIEnumerator(name: "FIOBJ_T_HASH", value: 42, isUnsigned: true)
!24 = !DIEnumerator(name: "FIOBJ_T_DATA", value: 43, isUnsigned: true)
!25 = !DIEnumerator(name: "FIOBJ_T_UNKNOWN", value: 44, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fio_protocol_lock_e", file: !6, line: 1508, baseType: !7, size: 32, elements: !27)
!27 = !{!28, !29, !30}
!28 = !DIEnumerator(name: "FIO_PR_LOCK_TASK", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "FIO_PR_LOCK_WRITE", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "FIO_PR_LOCK_STATE", value: 2, isUnsigned: true)
!31 = !{!32, !33, !59, !114, !117, !120, !62, !56, !121, !49, !122, !124, !127, !130, !41, !131, !132, !133, !139, !79, !113}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_protocol_s", file: !6, line: 544, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fio_protocol_s", file: !6, line: 561, size: 384, elements: !36)
!36 = !{!37, !44, !45, !53, !54, !55}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "on_data", scope: !35, file: !6, line: 563, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !41, !33}
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !42, line: 87, baseType: !43)
!42 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!43 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "on_ready", scope: !35, file: !6, line: 565, baseType: !38, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "on_shutdown", scope: !35, file: !6, line: 584, baseType: !46, size: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !41, !33}
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !50, line: 24, baseType: !51)
!50 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !52, line: 38, baseType: !14)
!52 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!53 = !DIDerivedType(tag: DW_TAG_member, name: "on_close", scope: !35, file: !6, line: 586, baseType: !38, size: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !35, file: !6, line: 588, baseType: !38, size: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "rsv", scope: !35, file: !6, line: 590, baseType: !56, size: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !57, line: 46, baseType: !58)
!57 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!58 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !62, !73, !73, !32}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ws_s", file: !64, line: 497, baseType: !65)
!64 = !DIFile(filename: "../include/http.h", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ws_s", file: !3, line: 105, size: 1472, elements: !66)
!66 = !{!67, !68, !69, !81, !85, !86, !87, !91, !92, !93, !103, !106, !111, !112, !115, !116}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !65, file: !3, line: 107, baseType: !34, size: 384)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !65, file: !3, line: 109, baseType: !41, size: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "on_message", scope: !65, file: !3, line: 111, baseType: !70, size: 64, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !62, !73, !49}
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_str_info_s", file: !6, line: 287, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fio_str_info_s", file: !6, line: 283, size: 192, elements: !75)
!75 = !{!76, !77, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "capa", scope: !74, file: !6, line: 284, baseType: !56, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !74, file: !6, line: 285, baseType: !56, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !74, file: !6, line: 286, baseType: !79, size: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "on_shutdown", scope: !65, file: !3, line: 112, baseType: !82, size: 64, offset: 512)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !62}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "on_ready", scope: !65, file: !3, line: 113, baseType: !82, size: 64, offset: 576)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "on_open", scope: !65, file: !3, line: 114, baseType: !82, size: 64, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "on_close", scope: !65, file: !3, line: 115, baseType: !88, size: 64, offset: 704)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !41, !32}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "udata", scope: !65, file: !3, line: 117, baseType: !32, size: 64, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "max_msg_size", scope: !65, file: !3, line: 119, baseType: !56, size: 64, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "subscriptions", scope: !65, file: !3, line: 121, baseType: !94, size: 192, offset: 896)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_ls_s", file: !6, line: 3141, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fio_ls_s", file: !6, line: 3137, size: 192, elements: !96)
!96 = !{!97, !99, !100}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !95, file: !6, line: 3138, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !95, file: !6, line: 3139, baseType: !98, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !95, file: !6, line: 3140, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "sub_lock", scope: !65, file: !3, line: 122, baseType: !104, size: 8, offset: 1088)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_lock_i", file: !6, line: 2060, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !49)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !65, file: !3, line: 124, baseType: !107, size: 128, offset: 1152)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buffer_s", file: !3, line: 40, size: 128, elements: !108)
!108 = !{!109, !110}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !107, file: !3, line: 41, baseType: !32, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !107, file: !3, line: 42, baseType: !56, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !65, file: !3, line: 126, baseType: !56, size: 64, offset: 1280)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !65, file: !3, line: 128, baseType: !113, size: 64, offset: 1344)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "FIOBJ", file: !13, line: 63, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !42, line: 90, baseType: !58)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "is_text", scope: !65, file: !3, line: 130, baseType: !49, size: 8, offset: 1408)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "is_client", scope: !65, file: !3, line: 132, baseType: !49, size: 8, offset: 1416)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "subscription_s", file: !6, line: 1680, baseType: !119)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "subscription_s", file: !6, line: 1680, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !50, line: 27, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !52, line: 45, baseType: !58)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !50, line: 25, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !52, line: 40, baseType: !126)
!126 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !50, line: 26, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !52, line: 42, baseType: !7)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "fiobj_type_enum", file: !13, line: 61, baseType: !12)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "fiobj_object_header_s", file: !13, line: 332, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 327, size: 64, elements: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !135, file: !13, line: 329, baseType: !131, size: 8)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !135, file: !13, line: 331, baseType: !128, size: 32, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_str_s", file: !6, line: 3409, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 3390, size: 384, elements: !142)
!142 = !{!143, !145, !146, !147, !151, !152, !153, !157}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !141, file: !6, line: 3392, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "small", scope: !141, file: !6, line: 3394, baseType: !49, size: 8, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "frozen", scope: !141, file: !6, line: 3395, baseType: !49, size: 8, offset: 40)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !141, file: !6, line: 3399, baseType: !148, size: 80, offset: 48)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 80, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 10)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "capa", scope: !141, file: !6, line: 3401, baseType: !122, size: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !141, file: !6, line: 3402, baseType: !122, size: 64, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "dealloc", scope: !141, file: !6, line: 3403, baseType: !154, size: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{null, !32}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !141, file: !6, line: 3404, baseType: !79, size: 64, offset: 320)
!158 = !{!159, !166, !168, !0, !170, !172, !174}
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "generic", scope: !161, file: !3, line: 489, type: !41, isLocal: true, isDefinition: true)
!161 = distinct !DISubprogram(name: "websocket_optimize4broadcasts", scope: !3, file: !3, line: 488, type: !162, scopeLine: 488, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !165)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !41, !164}
!164 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!165 = !{}
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "text", scope: !161, file: !3, line: 490, type: !41, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "binary", scope: !161, file: !3, line: 491, type: !41, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "fio_hash_secret_marker1", scope: !2, file: !6, line: 2433, type: !49, isLocal: false, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "fio_hash_secret_marker2", scope: !2, file: !6, line: 2434, type: !49, isLocal: false, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "fio_str_utf8_map", scope: !2, file: !6, line: 4116, type: !176, isLocal: true, isDefinition: true)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 256, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 32)
!179 = !{i32 7, !"Dwarf Version", i32 4}
!180 = !{i32 2, !"Debug Info Version", i32 3}
!181 = !{i32 1, !"wchar_size", i32 4}
!182 = !{!"clang version 10.0.0-4ubuntu1 "}
!183 = distinct !DISubprogram(name: "FIO_LOG2STDERR", scope: !6, file: !6, line: 437, type: !184, scopeLine: 437, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !165)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !186, null}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!188 = !DILocalVariable(name: "format", arg: 1, scope: !183, file: !6, line: 437, type: !186)
!189 = !DILocation(line: 437, column: 28, scope: !183)
!190 = !DILocalVariable(name: "tmp___log", scope: !183, file: !6, line: 438, type: !191)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 16384, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 2048)
!194 = !DILocation(line: 438, column: 8, scope: !183)
!195 = !DILocalVariable(name: "argv", scope: !183, file: !6, line: 439, type: !196)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !197, line: 52, baseType: !198)
!197 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !199, line: 32, baseType: !200)
!199 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stdarg.h", directory: "")
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 439, baseType: !201)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 192, elements: !208)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 439, size: 192, elements: !203)
!203 = !{!204, !205, !206, !207}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !202, file: !3, line: 439, baseType: !7, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !202, file: !3, line: 439, baseType: !7, size: 32, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !202, file: !3, line: 439, baseType: !32, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !202, file: !3, line: 439, baseType: !32, size: 64, offset: 128)
!208 = !{!209}
!209 = !DISubrange(count: 1)
!210 = !DILocation(line: 439, column: 11, scope: !183)
!211 = !DILocation(line: 440, column: 3, scope: !183)
!212 = !DILocalVariable(name: "len___log", scope: !183, file: !6, line: 441, type: !164)
!213 = !DILocation(line: 441, column: 7, scope: !183)
!214 = !DILocation(line: 441, column: 29, scope: !183)
!215 = !DILocation(line: 441, column: 66, scope: !183)
!216 = !DILocation(line: 441, column: 74, scope: !183)
!217 = !DILocation(line: 441, column: 19, scope: !183)
!218 = !DILocation(line: 442, column: 3, scope: !183)
!219 = !DILocation(line: 443, column: 7, scope: !220)
!220 = distinct !DILexicalBlock(scope: !183, file: !6, line: 443, column: 7)
!221 = !DILocation(line: 443, column: 17, scope: !220)
!222 = !DILocation(line: 443, column: 22, scope: !220)
!223 = !DILocation(line: 443, column: 25, scope: !220)
!224 = !DILocation(line: 443, column: 35, scope: !220)
!225 = !DILocation(line: 443, column: 7, scope: !183)
!226 = !DILocation(line: 444, column: 9, scope: !227)
!227 = distinct !DILexicalBlock(scope: !228, file: !6, line: 444, column: 9)
!228 = distinct !DILexicalBlock(scope: !220, file: !6, line: 443, column: 64)
!229 = !DILocation(line: 444, column: 19, scope: !227)
!230 = !DILocation(line: 444, column: 9, scope: !228)
!231 = !DILocation(line: 445, column: 14, scope: !232)
!232 = distinct !DILexicalBlock(scope: !227, file: !6, line: 444, column: 48)
!233 = !DILocation(line: 445, column: 24, scope: !232)
!234 = !DILocation(line: 445, column: 7, scope: !232)
!235 = !DILocation(line: 447, column: 17, scope: !232)
!236 = !DILocation(line: 448, column: 5, scope: !232)
!237 = !DILocation(line: 449, column: 65, scope: !238)
!238 = distinct !DILexicalBlock(scope: !227, file: !6, line: 448, column: 12)
!239 = !DILocation(line: 449, column: 7, scope: !238)
!240 = !DILocation(line: 450, column: 7, scope: !238)
!241 = !DILocation(line: 452, column: 3, scope: !228)
!242 = !DILocation(line: 453, column: 22, scope: !183)
!243 = !DILocation(line: 453, column: 3, scope: !183)
!244 = !DILocation(line: 453, column: 26, scope: !183)
!245 = !DILocation(line: 454, column: 13, scope: !183)
!246 = !DILocation(line: 454, column: 3, scope: !183)
!247 = !DILocation(line: 454, column: 24, scope: !183)
!248 = !DILocation(line: 455, column: 10, scope: !183)
!249 = !DILocation(line: 455, column: 21, scope: !183)
!250 = !DILocation(line: 455, column: 35, scope: !183)
!251 = !DILocation(line: 455, column: 3, scope: !183)
!252 = !DILocation(line: 456, column: 1, scope: !183)
!253 = distinct !DISubprogram(name: "create_ws_buffer", scope: !3, file: !3, line: 69, type: !254, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !165)
!254 = !DISubroutineType(types: !255)
!255 = !{!107, !62}
!256 = !DILocalVariable(name: "owner", arg: 1, scope: !253, file: !3, line: 69, type: !62)
!257 = !DILocation(line: 69, column: 40, scope: !253)
!258 = !DILocation(line: 70, column: 10, scope: !253)
!259 = !DILocalVariable(name: "buff", scope: !253, file: !3, line: 71, type: !107)
!260 = !DILocation(line: 71, column: 19, scope: !253)
!261 = !DILocation(line: 72, column: 8, scope: !253)
!262 = !DILocation(line: 72, column: 13, scope: !253)
!263 = !DILocation(line: 73, column: 27, scope: !253)
!264 = !DILocation(line: 73, column: 15, scope: !253)
!265 = !DILocation(line: 73, column: 8, scope: !253)
!266 = !DILocation(line: 73, column: 13, scope: !253)
!267 = !DILocation(line: 74, column: 3, scope: !253)
!268 = distinct !DISubprogram(name: "resize_ws_buffer", scope: !3, file: !3, line: 77, type: !269, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !165)
!269 = !DISubroutineType(types: !270)
!270 = !{!107, !62, !107}
!271 = !DILocalVariable(name: "owner", arg: 1, scope: !268, file: !3, line: 77, type: !62)
!272 = !DILocation(line: 77, column: 40, scope: !268)
!273 = !DILocalVariable(name: "buff", arg: 2, scope: !268, file: !3, line: 77, type: !107)
!274 = !DILocation(line: 77, column: 63, scope: !268)
!275 = !DILocation(line: 78, column: 15, scope: !268)
!276 = !DILocation(line: 78, column: 8, scope: !268)
!277 = !DILocation(line: 78, column: 13, scope: !268)
!278 = !DILocalVariable(name: "tmp", scope: !268, file: !3, line: 79, type: !32)
!279 = !DILocation(line: 79, column: 9, scope: !268)
!280 = !DILocation(line: 79, column: 28, scope: !268)
!281 = !DILocation(line: 79, column: 39, scope: !268)
!282 = !DILocation(line: 79, column: 15, scope: !268)
!283 = !DILocation(line: 80, column: 8, scope: !284)
!284 = distinct !DILexicalBlock(scope: !268, file: !3, line: 80, column: 7)
!285 = !DILocation(line: 80, column: 7, scope: !268)
!286 = !DILocation(line: 81, column: 20, scope: !287)
!287 = distinct !DILexicalBlock(scope: !284, file: !3, line: 80, column: 13)
!288 = !DILocation(line: 81, column: 5, scope: !287)
!289 = !DILocation(line: 82, column: 10, scope: !287)
!290 = !DILocation(line: 82, column: 15, scope: !287)
!291 = !DILocation(line: 83, column: 10, scope: !287)
!292 = !DILocation(line: 83, column: 15, scope: !287)
!293 = !DILocation(line: 84, column: 3, scope: !287)
!294 = !DILocation(line: 85, column: 15, scope: !268)
!295 = !DILocation(line: 85, column: 8, scope: !268)
!296 = !DILocation(line: 85, column: 13, scope: !268)
!297 = !DILocation(line: 86, column: 10, scope: !268)
!298 = !DILocation(line: 86, column: 3, scope: !268)
!299 = distinct !DISubprogram(name: "free_ws_buffer", scope: !3, file: !3, line: 88, type: !300, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !165)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !62, !107}
!302 = !DILocalVariable(name: "owner", arg: 1, scope: !299, file: !3, line: 88, type: !62)
!303 = !DILocation(line: 88, column: 27, scope: !299)
!304 = !DILocalVariable(name: "buff", arg: 2, scope: !299, file: !3, line: 88, type: !107)
!305 = !DILocation(line: 88, column: 50, scope: !299)
!306 = !DILocation(line: 89, column: 10, scope: !299)
!307 = !DILocation(line: 90, column: 13, scope: !299)
!308 = !DILocation(line: 90, column: 3, scope: !299)
!309 = !DILocation(line: 91, column: 1, scope: !299)
!310 = distinct !DISubprogram(name: "websocket_attach", scope: !3, file: !3, line: 330, type: !311, scopeLine: 331, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !165)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !41, !313, !375, !32, !56}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "http_settings_s", file: !64, line: 62, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "http_settings_s", file: !64, line: 318, size: 1024, elements: !316)
!316 = !{!317, !350, !354, !355, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "on_request", scope: !315, file: !64, line: 320, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{null, !321}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "http_s", file: !64, line: 121, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 74, size: 1024, elements: !324)
!324 = !{!325, !331, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !323, file: !64, line: 83, baseType: !326, size: 192)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !323, file: !64, line: 76, size: 192, elements: !327)
!327 = !{!328, !329, !330}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "vtbl", scope: !326, file: !64, line: 78, baseType: !32, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !326, file: !64, line: 80, baseType: !114, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "out_headers", scope: !326, file: !64, line: 82, baseType: !113, size: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "received_at", scope: !323, file: !64, line: 85, baseType: !332, size: 128, offset: 192)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !333, line: 10, size: 128, elements: !334)
!333 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!334 = !{!335, !337}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !332, file: !333, line: 12, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !52, line: 160, baseType: !43)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !332, file: !333, line: 16, baseType: !338, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !52, line: 196, baseType: !43)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !323, file: !64, line: 87, baseType: !113, size: 64, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "status_str", scope: !323, file: !64, line: 89, baseType: !113, size: 64, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !323, file: !64, line: 91, baseType: !113, size: 64, offset: 448)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !323, file: !64, line: 96, baseType: !114, size: 64, offset: 512)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !323, file: !64, line: 98, baseType: !113, size: 64, offset: 576)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !323, file: !64, line: 100, baseType: !113, size: 64, offset: 640)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !323, file: !64, line: 103, baseType: !113, size: 64, offset: 704)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "cookies", scope: !323, file: !64, line: 108, baseType: !113, size: 64, offset: 768)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !323, file: !64, line: 113, baseType: !113, size: 64, offset: 832)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !323, file: !64, line: 118, baseType: !113, size: 64, offset: 896)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "udata", scope: !323, file: !64, line: 120, baseType: !32, size: 64, offset: 960)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "on_upgrade", scope: !315, file: !64, line: 326, baseType: !351, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !321, !79, !56}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "on_response", scope: !315, file: !64, line: 328, baseType: !318, size: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "on_finish", scope: !315, file: !64, line: 330, baseType: !356, size: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{null, !359}
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "udata", scope: !315, file: !64, line: 332, baseType: !32, size: 64, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "public_folder", scope: !315, file: !64, line: 339, baseType: !186, size: 64, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "public_folder_length", scope: !315, file: !64, line: 343, baseType: !56, size: 64, offset: 384)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "max_header_size", scope: !315, file: !64, line: 353, baseType: !56, size: 64, offset: 448)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "max_body_size", scope: !315, file: !64, line: 359, baseType: !56, size: 64, offset: 512)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "max_clients", scope: !315, file: !64, line: 372, baseType: !41, size: 64, offset: 576)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !315, file: !64, line: 374, baseType: !32, size: 64, offset: 640)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !315, file: !64, line: 376, baseType: !41, size: 64, offset: 704)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !315, file: !64, line: 378, baseType: !41, size: 64, offset: 768)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "reserved3", scope: !315, file: !64, line: 380, baseType: !41, size: 64, offset: 832)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ws_max_msg_size", scope: !315, file: !64, line: 385, baseType: !56, size: 64, offset: 896)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !315, file: !64, line: 393, baseType: !49, size: 8, offset: 960)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ws_timeout", scope: !315, file: !64, line: 401, baseType: !49, size: 8, offset: 968)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !315, file: !64, line: 403, baseType: !49, size: 8, offset: 976)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "is_client", scope: !315, file: !64, line: 405, baseType: !49, size: 8, offset: 984)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "websocket_settings_s", file: !64, line: 546, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 503, size: 384, elements: !378)
!378 = !{!379, !380, !381, !382, !383, !384}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "on_message", scope: !377, file: !64, line: 512, baseType: !70, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "on_open", scope: !377, file: !64, line: 518, baseType: !82, size: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "on_ready", scope: !377, file: !64, line: 525, baseType: !82, size: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "on_shutdown", scope: !377, file: !64, line: 531, baseType: !82, size: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "on_close", scope: !377, file: !64, line: 543, baseType: !88, size: 64, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "udata", scope: !377, file: !64, line: 545, baseType: !32, size: 64, offset: 320)
!385 = !DILocalVariable(name: "uuid", arg: 1, scope: !310, file: !3, line: 330, type: !41)
!386 = !DILocation(line: 330, column: 32, scope: !310)
!387 = !DILocalVariable(name: "http_settings", arg: 2, scope: !310, file: !3, line: 330, type: !313)
!388 = !DILocation(line: 330, column: 55, scope: !310)
!389 = !DILocalVariable(name: "args", arg: 3, scope: !310, file: !3, line: 331, type: !375)
!390 = !DILocation(line: 331, column: 45, scope: !310)
!391 = !DILocalVariable(name: "data", arg: 4, scope: !310, file: !3, line: 331, type: !32)
!392 = !DILocation(line: 331, column: 57, scope: !310)
!393 = !DILocalVariable(name: "length", arg: 5, scope: !310, file: !3, line: 331, type: !56)
!394 = !DILocation(line: 331, column: 70, scope: !310)
!395 = !DILocalVariable(name: "ws", scope: !310, file: !3, line: 332, type: !62)
!396 = !DILocation(line: 332, column: 9, scope: !310)
!397 = !DILocation(line: 332, column: 28, scope: !310)
!398 = !DILocation(line: 332, column: 14, scope: !310)
!399 = !DILocation(line: 333, column: 3, scope: !400)
!400 = distinct !DILexicalBlock(scope: !310, file: !3, line: 333, column: 3)
!401 = !DILocation(line: 333, column: 3, scope: !310)
!402 = !DILocation(line: 333, column: 3, scope: !403)
!403 = distinct !DILexicalBlock(scope: !400, file: !3, line: 333, column: 3)
!404 = !DILocation(line: 333, column: 3, scope: !405)
!405 = distinct !DILexicalBlock(scope: !406, file: !3, line: 333, column: 3)
!406 = distinct !DILexicalBlock(scope: !403, file: !3, line: 333, column: 3)
!407 = !DILocation(line: 333, column: 3, scope: !406)
!408 = !DILocation(line: 333, column: 3, scope: !409)
!409 = distinct !DILexicalBlock(scope: !405, file: !3, line: 333, column: 3)
!410 = !DILocation(line: 335, column: 3, scope: !310)
!411 = !DILocation(line: 335, column: 7, scope: !310)
!412 = !DILocation(line: 335, column: 33, scope: !310)
!413 = !DILocation(line: 335, column: 16, scope: !310)
!414 = !DILocation(line: 337, column: 17, scope: !310)
!415 = !DILocation(line: 337, column: 23, scope: !310)
!416 = !DILocation(line: 337, column: 3, scope: !310)
!417 = !DILocation(line: 337, column: 7, scope: !310)
!418 = !DILocation(line: 337, column: 15, scope: !310)
!419 = !DILocation(line: 338, column: 18, scope: !310)
!420 = !DILocation(line: 338, column: 24, scope: !310)
!421 = !DILocation(line: 338, column: 3, scope: !310)
!422 = !DILocation(line: 338, column: 7, scope: !310)
!423 = !DILocation(line: 338, column: 16, scope: !310)
!424 = !DILocation(line: 339, column: 20, scope: !310)
!425 = !DILocation(line: 339, column: 26, scope: !310)
!426 = !DILocation(line: 339, column: 3, scope: !310)
!427 = !DILocation(line: 339, column: 7, scope: !310)
!428 = !DILocation(line: 339, column: 18, scope: !310)
!429 = !DILocation(line: 340, column: 18, scope: !310)
!430 = !DILocation(line: 340, column: 24, scope: !310)
!431 = !DILocation(line: 340, column: 3, scope: !310)
!432 = !DILocation(line: 340, column: 7, scope: !310)
!433 = !DILocation(line: 340, column: 16, scope: !310)
!434 = !DILocation(line: 341, column: 21, scope: !310)
!435 = !DILocation(line: 341, column: 27, scope: !310)
!436 = !DILocation(line: 341, column: 3, scope: !310)
!437 = !DILocation(line: 341, column: 7, scope: !310)
!438 = !DILocation(line: 341, column: 19, scope: !310)
!439 = !DILocation(line: 343, column: 15, scope: !310)
!440 = !DILocation(line: 343, column: 21, scope: !310)
!441 = !DILocation(line: 343, column: 3, scope: !310)
!442 = !DILocation(line: 343, column: 7, scope: !310)
!443 = !DILocation(line: 343, column: 13, scope: !310)
!444 = !DILocation(line: 344, column: 7, scope: !445)
!445 = distinct !DILexicalBlock(scope: !310, file: !3, line: 344, column: 7)
!446 = !DILocation(line: 344, column: 7, scope: !310)
!447 = !DILocation(line: 346, column: 21, scope: !448)
!448 = distinct !DILexicalBlock(scope: !445, file: !3, line: 344, column: 22)
!449 = !DILocation(line: 346, column: 36, scope: !448)
!450 = !DILocation(line: 346, column: 5, scope: !448)
!451 = !DILocation(line: 346, column: 9, scope: !448)
!452 = !DILocation(line: 346, column: 19, scope: !448)
!453 = !DILocation(line: 348, column: 24, scope: !448)
!454 = !DILocation(line: 348, column: 39, scope: !448)
!455 = !DILocation(line: 348, column: 5, scope: !448)
!456 = !DILocation(line: 348, column: 9, scope: !448)
!457 = !DILocation(line: 348, column: 22, scope: !448)
!458 = !DILocation(line: 350, column: 21, scope: !448)
!459 = !DILocation(line: 350, column: 27, scope: !448)
!460 = !DILocation(line: 350, column: 42, scope: !448)
!461 = !DILocation(line: 350, column: 5, scope: !448)
!462 = !DILocation(line: 351, column: 3, scope: !448)
!463 = !DILocation(line: 352, column: 5, scope: !464)
!464 = distinct !DILexicalBlock(scope: !445, file: !3, line: 351, column: 10)
!465 = !DILocation(line: 352, column: 9, scope: !464)
!466 = !DILocation(line: 352, column: 22, scope: !464)
!467 = !DILocation(line: 353, column: 21, scope: !464)
!468 = !DILocation(line: 353, column: 5, scope: !464)
!469 = !DILocation(line: 356, column: 7, scope: !470)
!470 = distinct !DILexicalBlock(scope: !310, file: !3, line: 356, column: 7)
!471 = !DILocation(line: 356, column: 12, scope: !470)
!472 = !DILocation(line: 356, column: 15, scope: !470)
!473 = !DILocation(line: 356, column: 7, scope: !310)
!474 = !DILocation(line: 357, column: 9, scope: !475)
!475 = distinct !DILexicalBlock(scope: !476, file: !3, line: 357, column: 9)
!476 = distinct !DILexicalBlock(scope: !470, file: !3, line: 356, column: 23)
!477 = !DILocation(line: 357, column: 18, scope: !475)
!478 = !DILocation(line: 357, column: 22, scope: !475)
!479 = !DILocation(line: 357, column: 29, scope: !475)
!480 = !DILocation(line: 357, column: 16, scope: !475)
!481 = !DILocation(line: 357, column: 9, scope: !476)
!482 = !DILocation(line: 358, column: 25, scope: !483)
!483 = distinct !DILexicalBlock(scope: !475, file: !3, line: 357, column: 35)
!484 = !DILocation(line: 358, column: 7, scope: !483)
!485 = !DILocation(line: 358, column: 11, scope: !483)
!486 = !DILocation(line: 358, column: 18, scope: !483)
!487 = !DILocation(line: 358, column: 23, scope: !483)
!488 = !DILocation(line: 359, column: 7, scope: !483)
!489 = !DILocation(line: 359, column: 11, scope: !483)
!490 = !DILocation(line: 359, column: 37, scope: !483)
!491 = !DILocation(line: 359, column: 41, scope: !483)
!492 = !DILocation(line: 359, column: 45, scope: !483)
!493 = !DILocation(line: 359, column: 20, scope: !483)
!494 = !DILocation(line: 360, column: 12, scope: !495)
!495 = distinct !DILexicalBlock(scope: !483, file: !3, line: 360, column: 11)
!496 = !DILocation(line: 360, column: 16, scope: !495)
!497 = !DILocation(line: 360, column: 23, scope: !495)
!498 = !DILocation(line: 360, column: 11, scope: !483)
!499 = !DILocation(line: 362, column: 20, scope: !500)
!500 = distinct !DILexicalBlock(scope: !495, file: !3, line: 360, column: 29)
!501 = !DILocation(line: 362, column: 44, scope: !500)
!502 = !DILocation(line: 362, column: 26, scope: !500)
!503 = !DILocation(line: 362, column: 9, scope: !500)
!504 = !DILocation(line: 363, column: 25, scope: !500)
!505 = !DILocation(line: 363, column: 9, scope: !500)
!506 = !DILocation(line: 364, column: 9, scope: !500)
!507 = !DILocation(line: 366, column: 5, scope: !483)
!508 = !DILocation(line: 367, column: 12, scope: !476)
!509 = !DILocation(line: 367, column: 16, scope: !476)
!510 = !DILocation(line: 367, column: 23, scope: !476)
!511 = !DILocation(line: 367, column: 29, scope: !476)
!512 = !DILocation(line: 367, column: 35, scope: !476)
!513 = !DILocation(line: 367, column: 5, scope: !476)
!514 = !DILocation(line: 368, column: 18, scope: !476)
!515 = !DILocation(line: 368, column: 5, scope: !476)
!516 = !DILocation(line: 368, column: 9, scope: !476)
!517 = !DILocation(line: 368, column: 16, scope: !476)
!518 = !DILocation(line: 369, column: 3, scope: !476)
!519 = !DILocation(line: 371, column: 14, scope: !310)
!520 = !DILocation(line: 371, column: 38, scope: !310)
!521 = !DILocation(line: 371, column: 20, scope: !310)
!522 = !DILocation(line: 371, column: 3, scope: !310)
!523 = !DILocation(line: 373, column: 19, scope: !310)
!524 = !DILocation(line: 373, column: 3, scope: !310)
!525 = !DILocation(line: 374, column: 1, scope: !310)
!526 = distinct !DISubprogram(name: "new_websocket", scope: !3, file: !3, line: 305, type: !527, scopeLine: 305, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !165)
!527 = !DISubroutineType(types: !528)
!528 = !{!62, !41}
!529 = !DILocalVariable(name: "uuid", arg: 1, scope: !526, file: !3, line: 305, type: !41)
!530 = !DILocation(line: 305, column: 37, scope: !526)
!531 = !DILocalVariable(name: "ws", scope: !526, file: !3, line: 307, type: !62)
!532 = !DILocation(line: 307, column: 9, scope: !526)
!533 = !DILocation(line: 307, column: 14, scope: !526)
!534 = !DILocation(line: 308, column: 4, scope: !526)
!535 = !DILocation(line: 308, column: 15, scope: !526)
!536 = !DILocation(line: 309, column: 16, scope: !526)
!537 = !DILocation(line: 316, column: 13, scope: !526)
!538 = !DILocation(line: 314, column: 24, scope: !526)
!539 = !DILocation(line: 308, column: 9, scope: !526)
!540 = !DILocation(line: 318, column: 10, scope: !526)
!541 = !DILocation(line: 318, column: 3, scope: !526)
!542 = distinct !DISubprogram(name: "websocket_close", scope: !3, file: !3, line: 726, type: !83, scopeLine: 726, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !165)
!543 = !DILocalVariable(name: "ws", arg: 1, scope: !542, file: !3, line: 726, type: !62)
!544 = !DILocation(line: 726, column: 28, scope: !542)
!545 = !DILocation(line: 727, column: 3, scope: !542)
!546 = !DILocation(line: 729, column: 13, scope: !542)
!547 = !DILocation(line: 729, column: 17, scope: !542)
!548 = !DILocation(line: 729, column: 3, scope: !542)
!549 = !DILocation(line: 730, column: 3, scope: !542)
!550 = !DILocalVariable(name: "type", arg: 1, scope: !161, file: !3, line: 488, type: !41)
!551 = !DILocation(line: 488, column: 45, scope: !161)
!552 = !DILocalVariable(name: "enable", arg: 2, scope: !161, file: !3, line: 488, type: !164)
!553 = !DILocation(line: 488, column: 55, scope: !161)
!554 = !DILocalVariable(name: "callback", scope: !161, file: !3, line: 492, type: !555)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!558, !73, !73, !49}
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_msg_metadata_s", file: !6, line: 1878, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fio_msg_metadata_s", file: !6, line: 1879, size: 192, elements: !560)
!560 = !{!561, !562, !579}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "type_id", scope: !559, file: !6, line: 1885, baseType: !41, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "on_finish", scope: !559, file: !6, line: 1891, baseType: !563, size: 64, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{null, !566, !32}
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_msg_s", file: !6, line: 1720, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fio_msg_s", file: !6, line: 1697, size: 640, elements: !569)
!569 = !{!570, !574, !575, !576, !577, !578}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !568, file: !6, line: 1699, baseType: !571, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !572, line: 26, baseType: !573)
!572 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !52, line: 41, baseType: !164)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !568, file: !6, line: 1706, baseType: !73, size: 192, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !568, file: !6, line: 1713, baseType: !73, size: 192, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "udata1", scope: !568, file: !6, line: 1715, baseType: !32, size: 64, offset: 448)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "udata2", scope: !568, file: !6, line: 1717, baseType: !32, size: 64, offset: 512)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "is_json", scope: !568, file: !6, line: 1719, baseType: !49, size: 8, offset: 576)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !559, file: !6, line: 1893, baseType: !32, size: 64, offset: 128)
!580 = !DILocation(line: 492, column: 24, scope: !161)
!581 = !DILocalVariable(name: "counter", scope: !161, file: !3, line: 493, type: !582)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!583 = !DILocation(line: 493, column: 13, scope: !161)
!584 = !DILocation(line: 494, column: 16, scope: !161)
!585 = !DILocation(line: 494, column: 14, scope: !161)
!586 = !DILocation(line: 494, column: 3, scope: !161)
!587 = !DILocation(line: 496, column: 13, scope: !588)
!588 = distinct !DILexicalBlock(scope: !161, file: !3, line: 494, column: 23)
!589 = !DILocation(line: 497, column: 14, scope: !588)
!590 = !DILocation(line: 498, column: 5, scope: !588)
!591 = !DILocation(line: 500, column: 13, scope: !588)
!592 = !DILocation(line: 501, column: 14, scope: !588)
!593 = !DILocation(line: 502, column: 5, scope: !588)
!594 = !DILocation(line: 504, column: 13, scope: !588)
!595 = !DILocation(line: 505, column: 14, scope: !588)
!596 = !DILocation(line: 506, column: 5, scope: !588)
!597 = !DILocation(line: 508, column: 5, scope: !588)
!598 = !DILocation(line: 510, column: 7, scope: !599)
!599 = distinct !DILexicalBlock(scope: !161, file: !3, line: 510, column: 7)
!600 = !DILocation(line: 510, column: 7, scope: !161)
!601 = !DILocation(line: 511, column: 9, scope: !602)
!602 = distinct !DILexicalBlock(scope: !603, file: !3, line: 511, column: 9)
!603 = distinct !DILexicalBlock(scope: !599, file: !3, line: 510, column: 15)
!604 = !DILocation(line: 511, column: 36, scope: !602)
!605 = !DILocation(line: 511, column: 9, scope: !603)
!606 = !DILocation(line: 512, column: 41, scope: !607)
!607 = distinct !DILexicalBlock(scope: !602, file: !3, line: 511, column: 42)
!608 = !DILocation(line: 512, column: 7, scope: !607)
!609 = !DILocation(line: 513, column: 5, scope: !607)
!610 = !DILocation(line: 514, column: 3, scope: !603)
!611 = !DILocation(line: 515, column: 9, scope: !612)
!612 = distinct !DILexicalBlock(scope: !613, file: !3, line: 515, column: 9)
!613 = distinct !DILexicalBlock(scope: !599, file: !3, line: 514, column: 10)
!614 = !DILocation(line: 515, column: 36, scope: !612)
!615 = !DILocation(line: 515, column: 9, scope: !613)
!616 = !DILocation(line: 516, column: 41, scope: !617)
!617 = distinct !DILexicalBlock(scope: !612, file: !3, line: 515, column: 42)
!618 = !DILocation(line: 516, column: 7, scope: !617)
!619 = !DILocation(line: 517, column: 5, scope: !617)
!620 = !DILocation(line: 519, column: 1, scope: !161)
!621 = distinct !DISubprogram(name: "websocket_optimize_generic", scope: !3, file: !3, line: 426, type: !556, scopeLine: 428, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !165)
!622 = !DILocalVariable(name: "ch", arg: 1, scope: !621, file: !3, line: 426, type: !73)
!623 = !DILocation(line: 426, column: 69, scope: !621)
!624 = !DILocalVariable(name: "msg", arg: 2, scope: !621, file: !3, line: 427, type: !73)
!625 = !DILocation(line: 427, column: 69, scope: !621)
!626 = !DILocalVariable(name: "is_json", arg: 3, scope: !621, file: !3, line: 428, type: !49)
!627 = !DILocation(line: 428, column: 62, scope: !621)
!628 = !DILocalVariable(name: "tmp", scope: !621, file: !3, line: 429, type: !140)
!629 = !DILocation(line: 429, column: 13, scope: !621)
!630 = !DILocation(line: 429, column: 19, scope: !621)
!631 = !DILocation(line: 430, column: 7, scope: !621)
!632 = !DILocation(line: 430, column: 15, scope: !621)
!633 = !DILocalVariable(name: "opcode", scope: !621, file: !3, line: 431, type: !14)
!634 = !DILocation(line: 431, column: 17, scope: !621)
!635 = !DILocation(line: 432, column: 11, scope: !636)
!636 = distinct !DILexicalBlock(scope: !621, file: !3, line: 432, column: 7)
!637 = !DILocation(line: 432, column: 15, scope: !636)
!638 = !DILocation(line: 432, column: 28, scope: !636)
!639 = !DILocation(line: 432, column: 31, scope: !636)
!640 = !DILocation(line: 432, column: 7, scope: !621)
!641 = !DILocation(line: 433, column: 12, scope: !642)
!642 = distinct !DILexicalBlock(scope: !636, file: !3, line: 432, column: 57)
!643 = !DILocation(line: 434, column: 3, scope: !642)
!644 = !DILocalVariable(name: "ret", scope: !621, file: !3, line: 435, type: !558)
!645 = !DILocation(line: 435, column: 22, scope: !621)
!646 = !DILocation(line: 435, column: 52, scope: !621)
!647 = !DILocation(line: 435, column: 28, scope: !621)
!648 = !DILocation(line: 436, column: 7, scope: !621)
!649 = !DILocation(line: 436, column: 15, scope: !621)
!650 = !DILocation(line: 437, column: 3, scope: !621)
!651 = distinct !DISubprogram(name: "websocket_optimize_text", scope: !3, file: !3, line: 442, type: !556, scopeLine: 444, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !165)
!652 = !DILocalVariable(name: "ch", arg: 1, scope: !651, file: !3, line: 442, type: !73)
!653 = !DILocation(line: 442, column: 66, scope: !651)
!654 = !DILocalVariable(name: "msg", arg: 2, scope: !651, file: !3, line: 443, type: !73)
!655 = !DILocation(line: 443, column: 66, scope: !651)
!656 = !DILocalVariable(name: "is_json", arg: 3, scope: !651, file: !3, line: 444, type: !49)
!657 = !DILocation(line: 444, column: 59, scope: !651)
!658 = !DILocalVariable(name: "ret", scope: !651, file: !3, line: 445, type: !558)
!659 = !DILocation(line: 445, column: 22, scope: !651)
!660 = !DILocation(line: 445, column: 28, scope: !651)
!661 = !DILocation(line: 446, column: 7, scope: !651)
!662 = !DILocation(line: 446, column: 15, scope: !651)
!663 = !DILocation(line: 447, column: 3, scope: !651)
!664 = distinct !DISubprogram(name: "websocket_optimize_binary", scope: !3, file: !3, line: 452, type: !556, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !165)
!665 = !DILocalVariable(name: "ch", arg: 1, scope: !664, file: !3, line: 452, type: !73)
!666 = !DILocation(line: 452, column: 68, scope: !664)
!667 = !DILocalVariable(name: "msg", arg: 2, scope: !664, file: !3, line: 453, type: !73)
!668 = !DILocation(line: 453, column: 68, scope: !664)
!669 = !DILocalVariable(name: "is_json", arg: 3, scope: !664, file: !3, line: 454, type: !49)
!670 = !DILocation(line: 454, column: 61, scope: !664)
!671 = !DILocalVariable(name: "ret", scope: !664, file: !3, line: 455, type: !558)
!672 = !DILocation(line: 455, column: 22, scope: !664)
!673 = !DILocation(line: 455, column: 28, scope: !664)
!674 = !DILocation(line: 456, column: 7, scope: !664)
!675 = !DILocation(line: 456, column: 15, scope: !664)
!676 = !DILocation(line: 457, column: 3, scope: !664)
!677 = distinct !DISubprogram(name: "websocket_subscribe", scope: !3, file: !3, line: 631, type: !678, scopeLine: 631, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !165)
!678 = !DISubroutineType(types: !679)
!679 = !{!114, !680}
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "websocket_subscribe_s", file: !681, line: 76, size: 576, elements: !682)
!681 = !DIFile(filename: "../include/websockets.h", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!682 = !{!683, !684, !685, !686, !687, !688, !693, !694}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ws", scope: !680, file: !681, line: 78, baseType: !62, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !680, file: !681, line: 80, baseType: !73, size: 192, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "on_message", scope: !680, file: !681, line: 86, baseType: !59, size: 64, offset: 256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "on_unsubscribe", scope: !680, file: !681, line: 91, baseType: !154, size: 64, offset: 320)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "udata", scope: !680, file: !681, line: 93, baseType: !32, size: 64, offset: 384)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !680, file: !681, line: 95, baseType: !689, size: 64, offset: 448)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "fio_match_fn", file: !6, line: 1726, baseType: !690)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!164, !73, !73}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "force_binary", scope: !680, file: !681, line: 104, baseType: !7, size: 1, offset: 512, flags: DIFlagBitField, extraData: i64 512)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "force_text", scope: !680, file: !681, line: 114, baseType: !7, size: 1, offset: 513, flags: DIFlagBitField, extraData: i64 512)
!695 = !DILocalVariable(name: "args", arg: 1, scope: !677, file: !3, line: 631, type: !680)
!696 = !DILocation(line: 631, column: 60, scope: !677)
!697 = !DILocation(line: 632, column: 13, scope: !698)
!698 = distinct !DILexicalBlock(scope: !677, file: !3, line: 632, column: 7)
!699 = !DILocation(line: 632, column: 8, scope: !698)
!700 = !DILocation(line: 632, column: 16, scope: !698)
!701 = !DILocation(line: 632, column: 38, scope: !698)
!702 = !DILocation(line: 632, column: 42, scope: !698)
!703 = !DILocation(line: 632, column: 20, scope: !698)
!704 = !DILocation(line: 632, column: 7, scope: !677)
!705 = !DILocation(line: 633, column: 5, scope: !698)
!706 = !DILocalVariable(name: "d", scope: !677, file: !3, line: 634, type: !707)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "websocket_sub_data_s", file: !3, line: 530, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 525, size: 192, elements: !710)
!710 = !{!711, !712, !713}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "on_message", scope: !709, file: !3, line: 526, baseType: !59, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "on_unsubscribe", scope: !709, file: !3, line: 528, baseType: !154, size: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "udata", scope: !709, file: !3, line: 529, baseType: !32, size: 64, offset: 128)
!714 = !DILocation(line: 634, column: 25, scope: !677)
!715 = !DILocation(line: 634, column: 29, scope: !677)
!716 = !DILocation(line: 635, column: 3, scope: !717)
!717 = distinct !DILexicalBlock(scope: !677, file: !3, line: 635, column: 3)
!718 = !DILocation(line: 635, column: 3, scope: !677)
!719 = !DILocation(line: 635, column: 3, scope: !720)
!720 = distinct !DILexicalBlock(scope: !717, file: !3, line: 635, column: 3)
!721 = !DILocation(line: 635, column: 3, scope: !722)
!722 = distinct !DILexicalBlock(scope: !723, file: !3, line: 635, column: 3)
!723 = distinct !DILexicalBlock(scope: !720, file: !3, line: 635, column: 3)
!724 = !DILocation(line: 635, column: 3, scope: !723)
!725 = !DILocation(line: 635, column: 3, scope: !726)
!726 = distinct !DILexicalBlock(scope: !722, file: !3, line: 635, column: 3)
!727 = !DILocation(line: 636, column: 4, scope: !677)
!728 = !DILocation(line: 636, column: 30, scope: !677)
!729 = !DILocation(line: 638, column: 26, scope: !677)
!730 = !DILocation(line: 639, column: 30, scope: !677)
!731 = !DILocation(line: 637, column: 21, scope: !677)
!732 = !DILocation(line: 636, column: 8, scope: !677)
!733 = !DILocalVariable(name: "handler", scope: !677, file: !3, line: 641, type: !734)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{null, !566}
!737 = !DILocation(line: 641, column: 10, scope: !677)
!738 = !DILocation(line: 642, column: 13, scope: !739)
!739 = distinct !DILexicalBlock(scope: !677, file: !3, line: 642, column: 7)
!740 = !DILocation(line: 642, column: 8, scope: !739)
!741 = !DILocation(line: 642, column: 7, scope: !677)
!742 = !DILocalVariable(name: "br_type", scope: !743, file: !3, line: 643, type: !41)
!743 = distinct !DILexicalBlock(scope: !739, file: !3, line: 642, column: 25)
!744 = !DILocation(line: 643, column: 14, scope: !743)
!745 = !DILocation(line: 644, column: 14, scope: !746)
!746 = distinct !DILexicalBlock(scope: !743, file: !3, line: 644, column: 9)
!747 = !DILocation(line: 644, column: 9, scope: !746)
!748 = !DILocation(line: 644, column: 9, scope: !743)
!749 = !DILocation(line: 645, column: 15, scope: !750)
!750 = distinct !DILexicalBlock(scope: !746, file: !3, line: 644, column: 28)
!751 = !DILocation(line: 646, column: 15, scope: !750)
!752 = !DILocation(line: 647, column: 5, scope: !750)
!753 = !DILocation(line: 647, column: 21, scope: !754)
!754 = distinct !DILexicalBlock(scope: !746, file: !3, line: 647, column: 16)
!755 = !DILocation(line: 647, column: 16, scope: !754)
!756 = !DILocation(line: 647, column: 16, scope: !746)
!757 = !DILocation(line: 648, column: 15, scope: !758)
!758 = distinct !DILexicalBlock(scope: !754, file: !3, line: 647, column: 33)
!759 = !DILocation(line: 649, column: 15, scope: !758)
!760 = !DILocation(line: 650, column: 5, scope: !758)
!761 = !DILocation(line: 651, column: 15, scope: !762)
!762 = distinct !DILexicalBlock(scope: !754, file: !3, line: 650, column: 12)
!763 = !DILocation(line: 652, column: 15, scope: !762)
!764 = !DILocation(line: 654, column: 35, scope: !743)
!765 = !DILocation(line: 654, column: 5, scope: !743)
!766 = !DILocation(line: 656, column: 67, scope: !743)
!767 = !DILocation(line: 656, column: 9, scope: !743)
!768 = !DILocation(line: 655, column: 5, scope: !743)
!769 = !DILocation(line: 655, column: 8, scope: !743)
!770 = !DILocation(line: 655, column: 19, scope: !743)
!771 = !DILocation(line: 657, column: 3, scope: !743)
!772 = !DILocalVariable(name: "sub", scope: !677, file: !3, line: 658, type: !117)
!773 = !DILocation(line: 658, column: 19, scope: !677)
!774 = !DILocation(line: 659, column: 7, scope: !677)
!775 = !DILocation(line: 663, column: 8, scope: !776)
!776 = distinct !DILexicalBlock(scope: !677, file: !3, line: 663, column: 7)
!777 = !DILocation(line: 663, column: 7, scope: !677)
!778 = !DILocation(line: 665, column: 5, scope: !779)
!779 = distinct !DILexicalBlock(scope: !776, file: !3, line: 663, column: 13)
!780 = !DILocalVariable(name: "pos", scope: !677, file: !3, line: 667, type: !120)
!781 = !DILocation(line: 667, column: 13, scope: !677)
!782 = !DILocation(line: 668, column: 18, scope: !677)
!783 = !DILocation(line: 668, column: 22, scope: !677)
!784 = !DILocation(line: 668, column: 3, scope: !677)
!785 = !DILocation(line: 669, column: 27, scope: !677)
!786 = !DILocation(line: 669, column: 31, scope: !677)
!787 = !DILocation(line: 669, column: 46, scope: !677)
!788 = !DILocation(line: 669, column: 9, scope: !677)
!789 = !DILocation(line: 669, column: 7, scope: !677)
!790 = !DILocation(line: 670, column: 20, scope: !677)
!791 = !DILocation(line: 670, column: 24, scope: !677)
!792 = !DILocation(line: 670, column: 3, scope: !677)
!793 = !DILocation(line: 672, column: 21, scope: !677)
!794 = !DILocation(line: 672, column: 10, scope: !677)
!795 = !DILocation(line: 672, column: 3, scope: !677)
!796 = !DILabel(scope: !677, name: "error", file: !3, line: 673)
!797 = !DILocation(line: 673, column: 1, scope: !677)
!798 = !DILocation(line: 674, column: 12, scope: !799)
!799 = distinct !DILexicalBlock(scope: !677, file: !3, line: 674, column: 7)
!800 = !DILocation(line: 674, column: 7, scope: !799)
!801 = !DILocation(line: 674, column: 7, scope: !677)
!802 = !DILocation(line: 675, column: 10, scope: !799)
!803 = !DILocation(line: 675, column: 30, scope: !799)
!804 = !DILocation(line: 675, column: 5, scope: !799)
!805 = !DILocation(line: 676, column: 3, scope: !677)
!806 = !DILocation(line: 677, column: 1, scope: !677)
!807 = distinct !DISubprogram(name: "websocket_on_pubsub_message", scope: !3, file: !3, line: 592, type: !735, scopeLine: 592, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !165)
!808 = !DILocalVariable(name: "msg", arg: 1, scope: !807, file: !3, line: 592, type: !566)
!809 = !DILocation(line: 592, column: 52, scope: !807)
!810 = !DILocalVariable(name: "pr", scope: !807, file: !3, line: 593, type: !33)
!811 = !DILocation(line: 593, column: 19, scope: !807)
!812 = !DILocation(line: 594, column: 39, scope: !807)
!813 = !DILocation(line: 594, column: 44, scope: !807)
!814 = !DILocation(line: 594, column: 29, scope: !807)
!815 = !DILocation(line: 594, column: 7, scope: !807)
!816 = !DILocation(line: 595, column: 8, scope: !817)
!817 = distinct !DILexicalBlock(scope: !807, file: !3, line: 595, column: 7)
!818 = !DILocation(line: 595, column: 7, scope: !807)
!819 = !DILocation(line: 596, column: 9, scope: !820)
!820 = distinct !DILexicalBlock(scope: !821, file: !3, line: 596, column: 9)
!821 = distinct !DILexicalBlock(scope: !817, file: !3, line: 595, column: 12)
!822 = !DILocation(line: 596, column: 15, scope: !820)
!823 = !DILocation(line: 596, column: 9, scope: !821)
!824 = !DILocation(line: 597, column: 7, scope: !820)
!825 = !DILocation(line: 598, column: 23, scope: !821)
!826 = !DILocation(line: 598, column: 5, scope: !821)
!827 = !DILocation(line: 599, column: 5, scope: !821)
!828 = !DILocalVariable(name: "d", scope: !807, file: !3, line: 601, type: !707)
!829 = !DILocation(line: 601, column: 25, scope: !807)
!830 = !DILocation(line: 601, column: 29, scope: !807)
!831 = !DILocation(line: 601, column: 34, scope: !807)
!832 = !DILocation(line: 603, column: 7, scope: !833)
!833 = distinct !DILexicalBlock(scope: !807, file: !3, line: 603, column: 7)
!834 = !DILocation(line: 603, column: 10, scope: !833)
!835 = !DILocation(line: 603, column: 7, scope: !807)
!836 = !DILocation(line: 604, column: 5, scope: !833)
!837 = !DILocation(line: 604, column: 8, scope: !833)
!838 = !DILocation(line: 604, column: 27, scope: !833)
!839 = !DILocation(line: 604, column: 19, scope: !833)
!840 = !DILocation(line: 604, column: 31, scope: !833)
!841 = !DILocation(line: 604, column: 36, scope: !833)
!842 = !DILocation(line: 604, column: 45, scope: !833)
!843 = !DILocation(line: 604, column: 50, scope: !833)
!844 = !DILocation(line: 604, column: 55, scope: !833)
!845 = !DILocation(line: 604, column: 58, scope: !833)
!846 = !DILocation(line: 605, column: 23, scope: !807)
!847 = !DILocation(line: 605, column: 3, scope: !807)
!848 = !DILocation(line: 606, column: 1, scope: !807)
!849 = distinct !DISubprogram(name: "websocket_on_pubsub_message_direct_bin", scope: !3, file: !3, line: 588, type: !735, scopeLine: 588, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !165)
!850 = !DILocalVariable(name: "msg", arg: 1, scope: !849, file: !3, line: 588, type: !566)
!851 = !DILocation(line: 588, column: 63, scope: !849)
!852 = !DILocation(line: 589, column: 47, scope: !849)
!853 = !DILocation(line: 589, column: 3, scope: !849)
!854 = !DILocation(line: 590, column: 1, scope: !849)
!855 = distinct !DISubprogram(name: "websocket_on_pubsub_message_direct_txt", scope: !3, file: !3, line: 584, type: !735, scopeLine: 584, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !165)
!856 = !DILocalVariable(name: "msg", arg: 1, scope: !855, file: !3, line: 584, type: !566)
!857 = !DILocation(line: 584, column: 63, scope: !855)
!858 = !DILocation(line: 585, column: 47, scope: !855)
!859 = !DILocation(line: 585, column: 3, scope: !855)
!860 = !DILocation(line: 586, column: 1, scope: !855)
!861 = distinct !DISubprogram(name: "websocket_on_pubsub_message_direct", scope: !3, file: !3, line: 580, type: !735, scopeLine: 580, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !165)
!862 = !DILocalVariable(name: "msg", arg: 1, scope: !861, file: !3, line: 580, type: !566)
!863 = !DILocation(line: 580, column: 59, scope: !861)
!864 = !DILocation(line: 581, column: 47, scope: !861)
!865 = !DILocation(line: 581, column: 3, scope: !861)
!866 = !DILocation(line: 582, column: 1, scope: !861)
!867 = distinct !DISubprogram(name: "websocket_on_unsubscribe", scope: !3, file: !3, line: 608, type: !868, scopeLine: 608, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !165)
!868 = !DISubroutineType(types: !869)
!869 = !{null, !32, !32}
!870 = !DILocalVariable(name: "u1", arg: 1, scope: !867, file: !3, line: 608, type: !32)
!871 = !DILocation(line: 608, column: 44, scope: !867)
!872 = !DILocalVariable(name: "u2", arg: 2, scope: !867, file: !3, line: 608, type: !32)
!873 = !DILocation(line: 608, column: 54, scope: !867)
!874 = !DILocalVariable(name: "d", scope: !867, file: !3, line: 609, type: !707)
!875 = !DILocation(line: 609, column: 25, scope: !867)
!876 = !DILocation(line: 609, column: 29, scope: !867)
!877 = !DILocation(line: 610, column: 7, scope: !878)
!878 = distinct !DILexicalBlock(scope: !867, file: !3, line: 610, column: 7)
!879 = !DILocation(line: 610, column: 10, scope: !878)
!880 = !DILocation(line: 610, column: 7, scope: !867)
!881 = !DILocation(line: 611, column: 5, scope: !882)
!882 = distinct !DILexicalBlock(scope: !878, file: !3, line: 610, column: 26)
!883 = !DILocation(line: 611, column: 8, scope: !882)
!884 = !DILocation(line: 611, column: 23, scope: !882)
!885 = !DILocation(line: 611, column: 26, scope: !882)
!886 = !DILocation(line: 612, column: 3, scope: !882)
!887 = !DILocation(line: 614, column: 17, scope: !888)
!888 = distinct !DILexicalBlock(scope: !867, file: !3, line: 614, column: 7)
!889 = !DILocation(line: 614, column: 20, scope: !888)
!890 = !DILocation(line: 614, column: 7, scope: !888)
!891 = !DILocation(line: 614, column: 31, scope: !888)
!892 = !DILocation(line: 614, column: 7, scope: !867)
!893 = !DILocation(line: 615, column: 5, scope: !894)
!894 = distinct !DILexicalBlock(scope: !888, file: !3, line: 614, column: 71)
!895 = !DILocation(line: 616, column: 3, scope: !894)
!896 = !DILocation(line: 616, column: 24, scope: !897)
!897 = distinct !DILexicalBlock(scope: !888, file: !3, line: 616, column: 14)
!898 = !DILocation(line: 616, column: 27, scope: !897)
!899 = !DILocation(line: 616, column: 14, scope: !897)
!900 = !DILocation(line: 616, column: 38, scope: !897)
!901 = !DILocation(line: 616, column: 14, scope: !888)
!902 = !DILocation(line: 618, column: 5, scope: !903)
!903 = distinct !DILexicalBlock(scope: !897, file: !3, line: 617, column: 56)
!904 = !DILocation(line: 619, column: 3, scope: !903)
!905 = !DILocation(line: 619, column: 24, scope: !906)
!906 = distinct !DILexicalBlock(scope: !897, file: !3, line: 619, column: 14)
!907 = !DILocation(line: 619, column: 27, scope: !906)
!908 = !DILocation(line: 619, column: 14, scope: !906)
!909 = !DILocation(line: 619, column: 38, scope: !906)
!910 = !DILocation(line: 619, column: 14, scope: !897)
!911 = !DILocation(line: 621, column: 5, scope: !912)
!912 = distinct !DILexicalBlock(scope: !906, file: !3, line: 620, column: 58)
!913 = !DILocation(line: 622, column: 3, scope: !912)
!914 = !DILocation(line: 623, column: 8, scope: !867)
!915 = !DILocation(line: 623, column: 3, scope: !867)
!916 = !DILocation(line: 624, column: 9, scope: !867)
!917 = !DILocation(line: 625, column: 1, scope: !867)
!918 = distinct !DISubprogram(name: "fio_lock", scope: !6, file: !6, line: 3019, type: !919, scopeLine: 3019, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !165)
!919 = !DISubroutineType(types: !920)
!920 = !{null, !921}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!922 = !DILocalVariable(name: "lock", arg: 1, scope: !918, file: !6, line: 3019, type: !921)
!923 = !DILocation(line: 3019, column: 43, scope: !918)
!924 = !DILocation(line: 3020, column: 3, scope: !918)
!925 = !DILocation(line: 3020, column: 22, scope: !918)
!926 = !DILocation(line: 3020, column: 10, scope: !918)
!927 = !DILocation(line: 3021, column: 5, scope: !928)
!928 = distinct !DILexicalBlock(scope: !918, file: !6, line: 3020, column: 29)
!929 = distinct !{!929, !924, !930}
!930 = !DILocation(line: 3022, column: 3, scope: !918)
!931 = !DILocation(line: 3023, column: 1, scope: !918)
!932 = distinct !DISubprogram(name: "fio_ls_push", scope: !6, file: !6, line: 3308, type: !933, scopeLine: 3308, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !165)
!933 = !DISubroutineType(types: !934)
!934 = !{!120, !120, !101}
!935 = !DILocalVariable(name: "pos", arg: 1, scope: !932, file: !6, line: 3308, type: !120)
!936 = !DILocation(line: 3308, column: 49, scope: !932)
!937 = !DILocalVariable(name: "obj", arg: 2, scope: !932, file: !6, line: 3308, type: !101)
!938 = !DILocation(line: 3308, column: 66, scope: !932)
!939 = !DILocation(line: 3309, column: 8, scope: !940)
!940 = distinct !DILexicalBlock(scope: !932, file: !6, line: 3309, column: 7)
!941 = !DILocation(line: 3309, column: 7, scope: !932)
!942 = !DILocation(line: 3310, column: 5, scope: !940)
!943 = !DILocalVariable(name: "item", scope: !932, file: !6, line: 3312, type: !120)
!944 = !DILocation(line: 3312, column: 13, scope: !932)
!945 = !DILocation(line: 3312, column: 32, scope: !932)
!946 = !DILocation(line: 3312, column: 20, scope: !932)
!947 = !DILocation(line: 3313, column: 3, scope: !948)
!948 = distinct !DILexicalBlock(scope: !932, file: !6, line: 3313, column: 3)
!949 = !DILocation(line: 3313, column: 3, scope: !932)
!950 = !DILocation(line: 3313, column: 3, scope: !951)
!951 = distinct !DILexicalBlock(scope: !948, file: !6, line: 3313, column: 3)
!952 = !DILocation(line: 3313, column: 3, scope: !953)
!953 = distinct !DILexicalBlock(scope: !954, file: !6, line: 3313, column: 3)
!954 = distinct !DILexicalBlock(scope: !951, file: !6, line: 3313, column: 3)
!955 = !DILocation(line: 3313, column: 3, scope: !954)
!956 = !DILocation(line: 3313, column: 3, scope: !957)
!957 = distinct !DILexicalBlock(scope: !953, file: !6, line: 3313, column: 3)
!958 = !DILocation(line: 3314, column: 4, scope: !932)
!959 = !DILocation(line: 3314, column: 21, scope: !932)
!960 = !DILocation(line: 3314, column: 30, scope: !932)
!961 = !DILocation(line: 3314, column: 35, scope: !932)
!962 = !DILocation(line: 3314, column: 49, scope: !932)
!963 = !DILocation(line: 3314, column: 61, scope: !932)
!964 = !DILocation(line: 3314, column: 11, scope: !932)
!965 = !DILocation(line: 3316, column: 21, scope: !932)
!966 = !DILocation(line: 3316, column: 3, scope: !932)
!967 = !DILocation(line: 3316, column: 8, scope: !932)
!968 = !DILocation(line: 3316, column: 14, scope: !932)
!969 = !DILocation(line: 3316, column: 19, scope: !932)
!970 = !DILocation(line: 3317, column: 15, scope: !932)
!971 = !DILocation(line: 3317, column: 3, scope: !932)
!972 = !DILocation(line: 3317, column: 8, scope: !932)
!973 = !DILocation(line: 3317, column: 13, scope: !932)
!974 = !DILocation(line: 3318, column: 10, scope: !932)
!975 = !DILocation(line: 3318, column: 3, scope: !932)
!976 = !DILocation(line: 3319, column: 1, scope: !932)
!977 = distinct !DISubprogram(name: "fio_unlock", scope: !6, file: !6, line: 3006, type: !978, scopeLine: 3006, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !165)
!978 = !DISubroutineType(types: !979)
!979 = !{!164, !921}
!980 = !DILocalVariable(name: "lock", arg: 1, scope: !977, file: !6, line: 3006, type: !921)
!981 = !DILocation(line: 3006, column: 44, scope: !977)
!982 = !DILocation(line: 3007, column: 3, scope: !977)
!983 = !{i32 135585}
!984 = !DILocalVariable(name: "ret", scope: !977, file: !6, line: 3008, type: !104)
!985 = !DILocation(line: 3008, column: 14, scope: !977)
!986 = !DILocation(line: 3008, column: 20, scope: !977)
!987 = !DILocation(line: 3009, column: 10, scope: !977)
!988 = !DILocation(line: 3009, column: 3, scope: !977)
!989 = distinct !DISubprogram(name: "websocket_unsubscribe", scope: !3, file: !3, line: 682, type: !990, scopeLine: 682, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !165)
!990 = !DISubroutineType(types: !991)
!991 = !{null, !62, !114}
!992 = !DILocalVariable(name: "ws", arg: 1, scope: !989, file: !3, line: 682, type: !62)
!993 = !DILocation(line: 682, column: 34, scope: !989)
!994 = !DILocalVariable(name: "subscription_id", arg: 2, scope: !989, file: !3, line: 682, type: !114)
!995 = !DILocation(line: 682, column: 48, scope: !989)
!996 = !DILocation(line: 683, column: 50, scope: !989)
!997 = !DILocation(line: 683, column: 38, scope: !989)
!998 = !DILocation(line: 683, column: 68, scope: !989)
!999 = !DILocation(line: 683, column: 19, scope: !989)
!1000 = !DILocation(line: 683, column: 3, scope: !989)
!1001 = !DILocation(line: 684, column: 13, scope: !989)
!1002 = !DILocation(line: 684, column: 17, scope: !989)
!1003 = !DILocation(line: 684, column: 3, scope: !989)
!1004 = !DILocation(line: 685, column: 29, scope: !989)
!1005 = !DILocation(line: 685, column: 17, scope: !989)
!1006 = !DILocation(line: 685, column: 3, scope: !989)
!1007 = !DILocation(line: 686, column: 15, scope: !989)
!1008 = !DILocation(line: 686, column: 19, scope: !989)
!1009 = !DILocation(line: 686, column: 3, scope: !989)
!1010 = !DILocation(line: 688, column: 9, scope: !989)
!1011 = !DILocation(line: 689, column: 1, scope: !989)
!1012 = distinct !DISubprogram(name: "fio_ls_remove", scope: !6, file: !6, line: 3295, type: !1013, scopeLine: 3295, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !165)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!32, !120}
!1015 = !DILocalVariable(name: "node", arg: 1, scope: !1012, file: !6, line: 3295, type: !120)
!1016 = !DILocation(line: 3295, column: 47, scope: !1012)
!1017 = !DILocation(line: 3296, column: 8, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !1012, file: !6, line: 3296, column: 7)
!1019 = !DILocation(line: 3296, column: 13, scope: !1018)
!1020 = !DILocation(line: 3296, column: 16, scope: !1018)
!1021 = !DILocation(line: 3296, column: 22, scope: !1018)
!1022 = !DILocation(line: 3296, column: 30, scope: !1018)
!1023 = !DILocation(line: 3296, column: 27, scope: !1018)
!1024 = !DILocation(line: 3296, column: 7, scope: !1012)
!1025 = !DILocation(line: 3298, column: 5, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1018, file: !6, line: 3296, column: 36)
!1027 = !DILocalVariable(name: "ret", scope: !1012, file: !6, line: 3300, type: !101)
!1028 = !DILocation(line: 3300, column: 15, scope: !1012)
!1029 = !DILocation(line: 3300, column: 21, scope: !1012)
!1030 = !DILocation(line: 3300, column: 27, scope: !1012)
!1031 = !DILocation(line: 3301, column: 22, scope: !1012)
!1032 = !DILocation(line: 3301, column: 28, scope: !1012)
!1033 = !DILocation(line: 3301, column: 3, scope: !1012)
!1034 = !DILocation(line: 3301, column: 9, scope: !1012)
!1035 = !DILocation(line: 3301, column: 15, scope: !1012)
!1036 = !DILocation(line: 3301, column: 20, scope: !1012)
!1037 = !DILocation(line: 3302, column: 22, scope: !1012)
!1038 = !DILocation(line: 3302, column: 28, scope: !1012)
!1039 = !DILocation(line: 3302, column: 3, scope: !1012)
!1040 = !DILocation(line: 3302, column: 9, scope: !1012)
!1041 = !DILocation(line: 3302, column: 15, scope: !1012)
!1042 = !DILocation(line: 3302, column: 20, scope: !1012)
!1043 = !DILocation(line: 3303, column: 12, scope: !1012)
!1044 = !DILocation(line: 3303, column: 3, scope: !1012)
!1045 = !DILocation(line: 3304, column: 18, scope: !1012)
!1046 = !DILocation(line: 3304, column: 3, scope: !1012)
!1047 = !DILocation(line: 3305, column: 1, scope: !1012)
!1048 = distinct !DISubprogram(name: "websocket_udata_get", scope: !3, file: !3, line: 696, type: !1049, scopeLine: 696, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !165)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!32, !62}
!1051 = !DILocalVariable(name: "ws", arg: 1, scope: !1048, file: !3, line: 696, type: !62)
!1052 = !DILocation(line: 696, column: 33, scope: !1048)
!1053 = !DILocation(line: 696, column: 46, scope: !1048)
!1054 = !DILocation(line: 696, column: 50, scope: !1048)
!1055 = !DILocation(line: 696, column: 39, scope: !1048)
!1056 = distinct !DISubprogram(name: "websocket_uuid", scope: !3, file: !3, line: 699, type: !1057, scopeLine: 699, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !165)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!41, !62}
!1059 = !DILocalVariable(name: "ws", arg: 1, scope: !1056, file: !3, line: 699, type: !62)
!1060 = !DILocation(line: 699, column: 31, scope: !1056)
!1061 = !DILocation(line: 699, column: 44, scope: !1056)
!1062 = !DILocation(line: 699, column: 48, scope: !1056)
!1063 = !DILocation(line: 699, column: 37, scope: !1056)
!1064 = distinct !DISubprogram(name: "websocket_udata_set", scope: !3, file: !3, line: 703, type: !1065, scopeLine: 703, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !165)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!32, !62, !32}
!1067 = !DILocalVariable(name: "ws", arg: 1, scope: !1064, file: !3, line: 703, type: !62)
!1068 = !DILocation(line: 703, column: 33, scope: !1064)
!1069 = !DILocalVariable(name: "udata", arg: 2, scope: !1064, file: !3, line: 703, type: !32)
!1070 = !DILocation(line: 703, column: 43, scope: !1064)
!1071 = !DILocalVariable(name: "old", scope: !1064, file: !3, line: 704, type: !32)
!1072 = !DILocation(line: 704, column: 9, scope: !1064)
!1073 = !DILocation(line: 704, column: 15, scope: !1064)
!1074 = !DILocation(line: 704, column: 19, scope: !1064)
!1075 = !DILocation(line: 705, column: 15, scope: !1064)
!1076 = !DILocation(line: 705, column: 3, scope: !1064)
!1077 = !DILocation(line: 705, column: 7, scope: !1064)
!1078 = !DILocation(line: 705, column: 13, scope: !1064)
!1079 = !DILocation(line: 706, column: 10, scope: !1064)
!1080 = !DILocation(line: 706, column: 3, scope: !1064)
!1081 = distinct !DISubprogram(name: "websocket_is_client", scope: !3, file: !3, line: 714, type: !1082, scopeLine: 714, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !165)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!49, !62}
!1084 = !DILocalVariable(name: "ws", arg: 1, scope: !1081, file: !3, line: 714, type: !62)
!1085 = !DILocation(line: 714, column: 35, scope: !1081)
!1086 = !DILocation(line: 714, column: 48, scope: !1081)
!1087 = !DILocation(line: 714, column: 52, scope: !1081)
!1088 = !DILocation(line: 714, column: 41, scope: !1081)
!1089 = distinct !DISubprogram(name: "websocket_write", scope: !3, file: !3, line: 717, type: !1090, scopeLine: 717, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !165)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!164, !62, !73, !49}
!1092 = !DILocalVariable(name: "ws", arg: 1, scope: !1089, file: !3, line: 717, type: !62)
!1093 = !DILocation(line: 717, column: 27, scope: !1089)
!1094 = !DILocalVariable(name: "msg", arg: 2, scope: !1089, file: !3, line: 717, type: !73)
!1095 = !DILocation(line: 717, column: 46, scope: !1089)
!1096 = !DILocalVariable(name: "is_text", arg: 3, scope: !1089, file: !3, line: 717, type: !49)
!1097 = !DILocation(line: 717, column: 59, scope: !1089)
!1098 = !DILocation(line: 718, column: 20, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1089, file: !3, line: 718, column: 7)
!1100 = !DILocation(line: 718, column: 24, scope: !1099)
!1101 = !DILocation(line: 718, column: 7, scope: !1099)
!1102 = !DILocation(line: 718, column: 7, scope: !1089)
!1103 = !DILocation(line: 719, column: 26, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1099, file: !3, line: 718, column: 29)
!1105 = !DILocation(line: 719, column: 30, scope: !1104)
!1106 = !DILocation(line: 719, column: 38, scope: !1104)
!1107 = !DILocation(line: 719, column: 48, scope: !1104)
!1108 = !DILocation(line: 719, column: 53, scope: !1104)
!1109 = !DILocation(line: 720, column: 26, scope: !1104)
!1110 = !DILocation(line: 720, column: 30, scope: !1104)
!1111 = !DILocation(line: 719, column: 5, scope: !1104)
!1112 = !DILocation(line: 721, column: 5, scope: !1104)
!1113 = !DILocation(line: 723, column: 3, scope: !1089)
!1114 = !DILocation(line: 724, column: 1, scope: !1089)
!1115 = distinct !DISubprogram(name: "websocket_write_impl", scope: !3, file: !3, line: 382, type: !1116, scopeLine: 383, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !165)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{null, !41, !32, !56, !80, !80, !80, !80}
!1118 = !DILocalVariable(name: "fd", arg: 1, scope: !1115, file: !3, line: 382, type: !41)
!1119 = !DILocation(line: 382, column: 43, scope: !1115)
!1120 = !DILocalVariable(name: "data", arg: 2, scope: !1115, file: !3, line: 382, type: !32)
!1121 = !DILocation(line: 382, column: 53, scope: !1115)
!1122 = !DILocalVariable(name: "len", arg: 3, scope: !1115, file: !3, line: 382, type: !56)
!1123 = !DILocation(line: 382, column: 66, scope: !1115)
!1124 = !DILocalVariable(name: "text", arg: 4, scope: !1115, file: !3, line: 382, type: !80)
!1125 = !DILocation(line: 382, column: 76, scope: !1115)
!1126 = !DILocalVariable(name: "first", arg: 5, scope: !1115, file: !3, line: 383, type: !80)
!1127 = !DILocation(line: 383, column: 39, scope: !1115)
!1128 = !DILocalVariable(name: "last", arg: 6, scope: !1115, file: !3, line: 383, type: !80)
!1129 = !DILocation(line: 383, column: 51, scope: !1115)
!1130 = !DILocalVariable(name: "client", arg: 7, scope: !1115, file: !3, line: 383, type: !80)
!1131 = !DILocation(line: 383, column: 62, scope: !1115)
!1132 = !DILocation(line: 384, column: 7, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1115, file: !3, line: 384, column: 7)
!1134 = !DILocation(line: 384, column: 11, scope: !1133)
!1135 = !DILocation(line: 384, column: 7, scope: !1115)
!1136 = !DILocalVariable(name: "buff", scope: !1137, file: !3, line: 385, type: !32)
!1137 = distinct !DILexicalBlock(scope: !1133, file: !3, line: 384, column: 33)
!1138 = !DILocation(line: 385, column: 11, scope: !1137)
!1139 = !DILocation(line: 385, column: 29, scope: !1137)
!1140 = !DILocation(line: 385, column: 33, scope: !1137)
!1141 = !DILocation(line: 385, column: 18, scope: !1137)
!1142 = !DILocation(line: 386, column: 12, scope: !1143)
!1143 = !DILexicalBlockFile(scope: !1137, file: !3, discriminator: 0)
!1144 = !DILocation(line: 386, column: 43, scope: !1143)
!1145 = !DILocation(line: 386, column: 49, scope: !1143)
!1146 = !DILocation(line: 386, column: 55, scope: !1143)
!1147 = !DILocation(line: 386, column: 61, scope: !1143)
!1148 = !DILocation(line: 386, column: 60, scope: !1143)
!1149 = !DILocation(line: 387, column: 43, scope: !1143)
!1150 = !DILocation(line: 387, column: 50, scope: !1143)
!1151 = !DILocation(line: 386, column: 21, scope: !1143)
!1152 = !DILocation(line: 388, column: 43, scope: !1143)
!1153 = !DILocation(line: 388, column: 49, scope: !1143)
!1154 = !DILocation(line: 388, column: 55, scope: !1143)
!1155 = !DILocation(line: 388, column: 61, scope: !1143)
!1156 = !DILocation(line: 388, column: 60, scope: !1143)
!1157 = !DILocation(line: 389, column: 43, scope: !1143)
!1158 = !DILocation(line: 389, column: 50, scope: !1143)
!1159 = !DILocation(line: 388, column: 21, scope: !1143)
!1160 = !DILocation(line: 386, column: 9, scope: !1143)
!1161 = !DILocation(line: 390, column: 5, scope: !1143)
!1162 = !DILocation(line: 392, column: 3, scope: !1143)
!1163 = !DILocation(line: 394, column: 5, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1133, file: !3, line: 392, column: 10)
!1165 = !DILocation(line: 394, column: 12, scope: !1164)
!1166 = !DILocation(line: 394, column: 16, scope: !1164)
!1167 = !DILocation(line: 395, column: 28, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1164, file: !3, line: 394, column: 37)
!1169 = !DILocation(line: 395, column: 32, scope: !1168)
!1170 = !DILocation(line: 395, column: 57, scope: !1168)
!1171 = !DILocation(line: 395, column: 63, scope: !1168)
!1172 = !DILocation(line: 395, column: 73, scope: !1168)
!1173 = !DILocation(line: 395, column: 7, scope: !1168)
!1174 = !DILocation(line: 396, column: 26, scope: !1168)
!1175 = !DILocation(line: 396, column: 32, scope: !1168)
!1176 = !DILocation(line: 396, column: 12, scope: !1168)
!1177 = !DILocation(line: 397, column: 13, scope: !1168)
!1178 = !DILocation(line: 398, column: 11, scope: !1168)
!1179 = distinct !{!1179, !1163, !1180}
!1180 = !DILocation(line: 399, column: 5, scope: !1164)
!1181 = !DILocation(line: 400, column: 26, scope: !1164)
!1182 = !DILocation(line: 400, column: 30, scope: !1164)
!1183 = !DILocation(line: 400, column: 36, scope: !1164)
!1184 = !DILocation(line: 400, column: 41, scope: !1164)
!1185 = !DILocation(line: 400, column: 47, scope: !1164)
!1186 = !DILocation(line: 400, column: 57, scope: !1164)
!1187 = !DILocation(line: 400, column: 5, scope: !1164)
!1188 = !DILocation(line: 402, column: 3, scope: !1115)
!1189 = distinct !DISubprogram(name: "on_data_first", scope: !3, file: !3, line: 282, type: !39, scopeLine: 282, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !165)
!1190 = !DILocalVariable(name: "sockfd", arg: 1, scope: !1189, file: !3, line: 282, type: !41)
!1191 = !DILocation(line: 282, column: 36, scope: !1189)
!1192 = !DILocalVariable(name: "ws_", arg: 2, scope: !1189, file: !3, line: 282, type: !33)
!1193 = !DILocation(line: 282, column: 60, scope: !1189)
!1194 = !DILocalVariable(name: "ws", scope: !1189, file: !3, line: 283, type: !1195)
!1195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!1196 = !DILocation(line: 283, column: 15, scope: !1189)
!1197 = !DILocation(line: 283, column: 28, scope: !1189)
!1198 = !DILocation(line: 283, column: 20, scope: !1189)
!1199 = !DILocation(line: 284, column: 7, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1189, file: !3, line: 284, column: 7)
!1201 = !DILocation(line: 284, column: 11, scope: !1200)
!1202 = !DILocation(line: 284, column: 7, scope: !1189)
!1203 = !DILocation(line: 285, column: 5, scope: !1200)
!1204 = !DILocation(line: 285, column: 9, scope: !1200)
!1205 = !DILocation(line: 285, column: 17, scope: !1200)
!1206 = !DILocation(line: 286, column: 3, scope: !1189)
!1207 = !DILocation(line: 286, column: 7, scope: !1189)
!1208 = !DILocation(line: 286, column: 16, scope: !1189)
!1209 = !DILocation(line: 286, column: 24, scope: !1189)
!1210 = !DILocation(line: 287, column: 3, scope: !1189)
!1211 = !DILocation(line: 287, column: 7, scope: !1189)
!1212 = !DILocation(line: 287, column: 16, scope: !1189)
!1213 = !DILocation(line: 287, column: 25, scope: !1189)
!1214 = !DILocation(line: 289, column: 7, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1189, file: !3, line: 289, column: 7)
!1216 = !DILocation(line: 289, column: 11, scope: !1215)
!1217 = !DILocation(line: 289, column: 7, scope: !1189)
!1218 = !DILocation(line: 290, column: 36, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1215, file: !3, line: 289, column: 19)
!1220 = !DILocation(line: 290, column: 40, scope: !1219)
!1221 = !DILocation(line: 290, column: 47, scope: !1219)
!1222 = !DILocation(line: 290, column: 53, scope: !1219)
!1223 = !DILocation(line: 290, column: 57, scope: !1219)
!1224 = !DILocation(line: 290, column: 65, scope: !1219)
!1225 = !DILocation(line: 291, column: 39, scope: !1219)
!1226 = !DILocation(line: 291, column: 43, scope: !1219)
!1227 = !DILocation(line: 291, column: 38, scope: !1219)
!1228 = !DILocation(line: 291, column: 37, scope: !1219)
!1229 = !DILocation(line: 291, column: 54, scope: !1219)
!1230 = !DILocation(line: 291, column: 36, scope: !1219)
!1231 = !DILocation(line: 290, column: 18, scope: !1219)
!1232 = !DILocation(line: 290, column: 5, scope: !1219)
!1233 = !DILocation(line: 290, column: 9, scope: !1219)
!1234 = !DILocation(line: 290, column: 16, scope: !1219)
!1235 = !DILocation(line: 292, column: 3, scope: !1219)
!1236 = !DILocation(line: 293, column: 19, scope: !1189)
!1237 = !DILocation(line: 293, column: 3, scope: !1189)
!1238 = !DILocation(line: 294, column: 19, scope: !1189)
!1239 = !DILocation(line: 294, column: 3, scope: !1189)
!1240 = !DILocation(line: 295, column: 1, scope: !1189)
!1241 = distinct !DISubprogram(name: "on_shutdown", scope: !3, file: !3, line: 233, type: !47, scopeLine: 233, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !165)
!1242 = !DILocalVariable(name: "fd", arg: 1, scope: !1241, file: !3, line: 233, type: !41)
!1243 = !DILocation(line: 233, column: 37, scope: !1241)
!1244 = !DILocalVariable(name: "ws", arg: 2, scope: !1241, file: !3, line: 233, type: !33)
!1245 = !DILocation(line: 233, column: 57, scope: !1241)
!1246 = !DILocation(line: 234, column: 10, scope: !1241)
!1247 = !DILocation(line: 235, column: 7, scope: !1248)
!1248 = distinct !DILexicalBlock(scope: !1241, file: !3, line: 235, column: 7)
!1249 = !DILocation(line: 235, column: 10, scope: !1248)
!1250 = !DILocation(line: 235, column: 22, scope: !1248)
!1251 = !DILocation(line: 235, column: 27, scope: !1248)
!1252 = !DILocation(line: 235, column: 13, scope: !1248)
!1253 = !DILocation(line: 235, column: 7, scope: !1241)
!1254 = !DILocation(line: 236, column: 14, scope: !1248)
!1255 = !DILocation(line: 236, column: 19, scope: !1248)
!1256 = !DILocation(line: 236, column: 39, scope: !1248)
!1257 = !DILocation(line: 236, column: 31, scope: !1248)
!1258 = !DILocation(line: 236, column: 5, scope: !1248)
!1259 = !DILocation(line: 237, column: 16, scope: !1260)
!1260 = distinct !DILexicalBlock(scope: !1241, file: !3, line: 237, column: 7)
!1261 = !DILocation(line: 237, column: 21, scope: !1260)
!1262 = !DILocation(line: 237, column: 7, scope: !1260)
!1263 = !DILocation(line: 237, column: 7, scope: !1241)
!1264 = !DILocation(line: 238, column: 5, scope: !1265)
!1265 = distinct !DILexicalBlock(scope: !1260, file: !3, line: 237, column: 32)
!1266 = !DILocation(line: 240, column: 3, scope: !1265)
!1267 = !DILocation(line: 241, column: 5, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1260, file: !3, line: 240, column: 10)
!1269 = !DILocation(line: 244, column: 3, scope: !1241)
!1270 = distinct !DISubprogram(name: "on_close", scope: !3, file: !3, line: 222, type: !39, scopeLine: 222, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !165)
!1271 = !DILocalVariable(name: "uuid", arg: 1, scope: !1270, file: !3, line: 222, type: !41)
!1272 = !DILocation(line: 222, column: 31, scope: !1270)
!1273 = !DILocalVariable(name: "_ws", arg: 2, scope: !1270, file: !3, line: 222, type: !33)
!1274 = !DILocation(line: 222, column: 53, scope: !1270)
!1275 = !DILocation(line: 223, column: 22, scope: !1270)
!1276 = !DILocation(line: 223, column: 14, scope: !1270)
!1277 = !DILocation(line: 223, column: 3, scope: !1270)
!1278 = !DILocation(line: 224, column: 9, scope: !1270)
!1279 = !DILocation(line: 225, column: 1, scope: !1270)
!1280 = distinct !DISubprogram(name: "ws_ping", scope: !3, file: !3, line: 211, type: !39, scopeLine: 211, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !165)
!1281 = !DILocalVariable(name: "fd", arg: 1, scope: !1280, file: !3, line: 211, type: !41)
!1282 = !DILocation(line: 211, column: 30, scope: !1280)
!1283 = !DILocalVariable(name: "ws", arg: 2, scope: !1280, file: !3, line: 211, type: !33)
!1284 = !DILocation(line: 211, column: 50, scope: !1280)
!1285 = !DILocation(line: 212, column: 10, scope: !1280)
!1286 = !DILocation(line: 213, column: 16, scope: !1287)
!1287 = distinct !DILexicalBlock(scope: !1280, file: !3, line: 213, column: 7)
!1288 = !DILocation(line: 213, column: 21, scope: !1287)
!1289 = !DILocation(line: 213, column: 7, scope: !1287)
!1290 = !DILocation(line: 213, column: 7, scope: !1280)
!1291 = !DILocation(line: 214, column: 5, scope: !1292)
!1292 = distinct !DILexicalBlock(scope: !1287, file: !3, line: 213, column: 32)
!1293 = !DILocation(line: 216, column: 3, scope: !1292)
!1294 = !DILocation(line: 217, column: 5, scope: !1295)
!1295 = distinct !DILexicalBlock(scope: !1287, file: !3, line: 216, column: 10)
!1296 = !DILocation(line: 220, column: 1, scope: !1280)
!1297 = distinct !DISubprogram(name: "on_data", scope: !3, file: !3, line: 247, type: !39, scopeLine: 247, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !165)
!1298 = !DILocalVariable(name: "sockfd", arg: 1, scope: !1297, file: !3, line: 247, type: !41)
!1299 = !DILocation(line: 247, column: 30, scope: !1297)
!1300 = !DILocalVariable(name: "ws_", arg: 2, scope: !1297, file: !3, line: 247, type: !33)
!1301 = !DILocation(line: 247, column: 54, scope: !1297)
!1302 = !DILocalVariable(name: "ws", scope: !1297, file: !3, line: 248, type: !1195)
!1303 = !DILocation(line: 248, column: 15, scope: !1297)
!1304 = !DILocation(line: 248, column: 28, scope: !1297)
!1305 = !DILocation(line: 248, column: 20, scope: !1297)
!1306 = !DILocation(line: 249, column: 7, scope: !1307)
!1307 = distinct !DILexicalBlock(scope: !1297, file: !3, line: 249, column: 7)
!1308 = !DILocation(line: 249, column: 10, scope: !1307)
!1309 = !DILocation(line: 249, column: 7, scope: !1297)
!1310 = !DILocation(line: 250, column: 5, scope: !1307)
!1311 = !DILocalVariable(name: "info", scope: !1297, file: !3, line: 251, type: !1312)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "websocket_packet_info_s", file: !1313, line: 99, size: 128, elements: !1314)
!1313 = !DIFile(filename: "../include/websocket_parser.h", directory: "/home/mlevatich/m/build/apps/eridemo2020/secdesk/.solution/refactored/facilio/src")
!1314 = !{!1315, !1316, !1317}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "packet_length", scope: !1312, file: !1313, line: 101, baseType: !122, size: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "head_length", scope: !1312, file: !1313, line: 103, baseType: !49, size: 8, offset: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "masked", scope: !1312, file: !1313, line: 105, baseType: !49, size: 8, offset: 72)
!1318 = !DILocation(line: 251, column: 34, scope: !1297)
!1319 = !DILocation(line: 252, column: 29, scope: !1297)
!1320 = !DILocation(line: 252, column: 33, scope: !1297)
!1321 = !DILocation(line: 252, column: 40, scope: !1297)
!1322 = !DILocation(line: 252, column: 46, scope: !1297)
!1323 = !DILocation(line: 252, column: 50, scope: !1297)
!1324 = !DILocation(line: 252, column: 7, scope: !1297)
!1325 = !DILocalVariable(name: "raw_length", scope: !1297, file: !3, line: 253, type: !1326)
!1326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!1327 = !DILocation(line: 253, column: 18, scope: !1297)
!1328 = !DILocation(line: 253, column: 36, scope: !1297)
!1329 = !DILocation(line: 253, column: 57, scope: !1297)
!1330 = !DILocation(line: 253, column: 52, scope: !1297)
!1331 = !DILocation(line: 253, column: 50, scope: !1297)
!1332 = !DILocation(line: 255, column: 7, scope: !1333)
!1333 = distinct !DILexicalBlock(scope: !1297, file: !3, line: 255, column: 7)
!1334 = !DILocation(line: 255, column: 11, scope: !1333)
!1335 = !DILocation(line: 255, column: 26, scope: !1333)
!1336 = !DILocation(line: 255, column: 24, scope: !1333)
!1337 = !DILocation(line: 255, column: 7, scope: !1297)
!1338 = !DILocation(line: 257, column: 21, scope: !1339)
!1339 = distinct !DILexicalBlock(scope: !1333, file: !3, line: 255, column: 38)
!1340 = !DILocation(line: 257, column: 5, scope: !1339)
!1341 = !DILocation(line: 258, column: 5, scope: !1339)
!1342 = !DILocation(line: 261, column: 7, scope: !1343)
!1343 = distinct !DILexicalBlock(scope: !1297, file: !3, line: 261, column: 7)
!1344 = !DILocation(line: 261, column: 20, scope: !1343)
!1345 = !DILocation(line: 261, column: 24, scope: !1343)
!1346 = !DILocation(line: 261, column: 31, scope: !1343)
!1347 = !DILocation(line: 261, column: 18, scope: !1343)
!1348 = !DILocation(line: 261, column: 7, scope: !1297)
!1349 = !DILocation(line: 262, column: 31, scope: !1350)
!1350 = distinct !DILexicalBlock(scope: !1343, file: !3, line: 261, column: 37)
!1351 = !DILocation(line: 262, column: 5, scope: !1350)
!1352 = !DILocation(line: 262, column: 9, scope: !1350)
!1353 = !DILocation(line: 262, column: 16, scope: !1350)
!1354 = !DILocation(line: 262, column: 21, scope: !1350)
!1355 = !DILocation(line: 263, column: 5, scope: !1350)
!1356 = !DILocation(line: 263, column: 9, scope: !1350)
!1357 = !DILocation(line: 263, column: 35, scope: !1350)
!1358 = !DILocation(line: 263, column: 39, scope: !1350)
!1359 = !DILocation(line: 263, column: 43, scope: !1350)
!1360 = !DILocation(line: 263, column: 18, scope: !1350)
!1361 = !DILocation(line: 264, column: 10, scope: !1362)
!1362 = distinct !DILexicalBlock(scope: !1350, file: !3, line: 264, column: 9)
!1363 = !DILocation(line: 264, column: 14, scope: !1362)
!1364 = !DILocation(line: 264, column: 21, scope: !1362)
!1365 = !DILocation(line: 264, column: 9, scope: !1350)
!1366 = !DILocation(line: 266, column: 23, scope: !1367)
!1367 = distinct !DILexicalBlock(scope: !1362, file: !3, line: 264, column: 27)
!1368 = !DILocation(line: 266, column: 7, scope: !1367)
